#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivitySearchView

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ActivitySearchView.ActivitySearchView_C.SetPartyTooLargeText
// 0x0008 (0x0008 - 0x0000)
struct ActivitySearchView_C_SetPartyTooLargeText final
{
public:
	class UCommonRichTextBlock*                   CommonRichTextBlock;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ActivitySearchView_C_SetPartyTooLargeText;

// Function ActivitySearchView.ActivitySearchView_C.SetIslandNotFoundText
// 0x0008 (0x0008 - 0x0000)
struct ActivitySearchView_C_SetIslandNotFoundText final
{
public:
	class UCommonRichTextBlock*                   CommonRichTextBlock;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ActivitySearchView_C_SetIslandNotFoundText;

// Function ActivitySearchView.ActivitySearchView_C.SetEnterIslandCodeText
// 0x0008 (0x0008 - 0x0000)
struct ActivitySearchView_C_SetEnterIslandCodeText final
{
public:
	class UCommonRichTextBlock*                   CommonRichTextBlock;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ActivitySearchView_C_SetEnterIslandCodeText;

// Function ActivitySearchView.ActivitySearchView_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ActivitySearchView_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ActivitySearchView_C_PreConstruct;

// Function ActivitySearchView.ActivitySearchView_C.OnActivityValidated
// 0x0001 (0x0001 - 0x0000)
struct ActivitySearchView_C_OnActivityValidated final
{
public:
	EFortActivityValidationResult                 ValidateResult;                                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ActivitySearchView_C_OnActivityValidated;

// Function ActivitySearchView.ActivitySearchView_C.ExecuteUbergraph_ActivitySearchView
// 0x0010 (0x0010 - 0x0000)
struct ActivitySearchView_C_ExecuteUbergraph_ActivitySearchView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortActivityValidationResult                 K2Node_Event_ValidateResult;                       // 0x0005(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ActivitySearchView_C_ExecuteUbergraph_ActivitySearchView;

}

