#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserRowPromoted

#include "Basic.hpp"

#include "DiscoveryBrowserUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserRowPromoted.ActivityBrowserRowPromoted_C
// 0x0030 (0x0310 - 0x02E0)
class UActivityBrowserRowPromoted_C final : public UFortActivityBrowserRowPromoted
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnPeek;                                            // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnRowActiveInactiveAnim;                           // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 TakeoverTile;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBContent;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsWaitingForInactiveAnim;                          // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateWidgetVisibility();
	void UpdateNewRow(bool IsActive, bool PlayAnimation_0);
	void SnapToEndOfAnimation(class UWidgetAnimation* InAnimation, EUMGSequencePlayMode PlayMode);
	void OnRowPeekStateChanged(const bool bIsInPeekState);
	void OnRowMoveDown();
	void OnRowIsActiveChanged(const bool bIsActive);
	void OnCategoryItemChanged(const bool bIsActive, const bool bPlayAnimation);
	void HandleInputMethodChanged(ECommonInputType NewInputType);
	void Finished_B26293ED40CE705EEB4611B38FB15D81();
	void ExecuteUbergraph_ActivityBrowserRowPromoted(int32 EntryPoint);
	void Destruct();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ActivityBrowserRowPromoted_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActivityBrowserRowPromoted_C")
	}
	static class UActivityBrowserRowPromoted_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserRowPromoted_C>();
	}
};
DUMPER7_ASSERTS_UActivityBrowserRowPromoted_C;

}

