#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserLobbyTileButton

#include "Basic.hpp"

#include "DiscoveryBrowserUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserLobbyTileButton.ActivityBrowserLobbyTileButton_C
// 0x0050 (0x0F90 - 0x0F40)
class UActivityBrowserLobbyTileButton_C final : public UFortActivityLobbyTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SelectedMatchmaking;                               // 0x0F48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0F50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         ButtonPromptHB;                                    // 0x0F58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_KeyArt;                                      // 0x0F60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TileSize;                                          // 0x0F68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsDisabled;                                        // 0x0F70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F71[0x3];                                      // 0x0F71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   KeyArtParameter;                                   // 0x0F74(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MissingArtParameter;                               // 0x0F7C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnDeselected();
	void BP_OnDisabled();
	void BP_OnEnabled();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void ExecuteUbergraph_ActivityBrowserLobbyTileButton(int32 EntryPoint);
	void OnPreviewImageChanged(const bool bIsLoading, const class UTexture* Texture);
	void OnSelectedMatchmaking();
	void OnUnSelectedMatchmakingCanceled();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ActivityBrowserLobbyTileButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActivityBrowserLobbyTileButton_C")
	}
	static class UActivityBrowserLobbyTileButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserLobbyTileButton_C>();
	}
};
DUMPER7_ASSERTS_UActivityBrowserLobbyTileButton_C;

}

