#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivitySearchView

#include "Basic.hpp"

#include "DiscoveryBrowserUI_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivitySearchView.ActivitySearchView_C
// 0x0070 (0x05B0 - 0x0540)
class UActivitySearchView_C final : public UFortActivitySearchView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Code;                                      // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_ValidationFeedback;                           // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WarningOvr;                                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   MessageIslandNotFound;                             // 0x0568(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   MessagePartyTooLarge;                              // 0x0580(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   MessageDefaultEnter;                               // 0x0598(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetPartyTooLargeText(class UCommonRichTextBlock* CommonRichTextBlock);
	void SetIslandNotFoundText(class UCommonRichTextBlock* CommonRichTextBlock);
	void SetEnterIslandCodeText(class UCommonRichTextBlock* CommonRichTextBlock);
	void PreConstruct(bool IsDesignTime);
	void OnActivityValidated(const EFortActivityValidationResult ValidateResult);
	void OnActivityClear();
	void ExecuteUbergraph_ActivitySearchView(int32 EntryPoint);
	void Construct();
	void BP_OnActivated();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ActivitySearchView_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActivitySearchView_C")
	}
	static class UActivitySearchView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivitySearchView_C>();
	}
};
DUMPER7_ASSERTS_UActivitySearchView_C;

}

