#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityCreateView

#include "Basic.hpp"

#include "DiscoveryBrowserUI_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityCreateView.ActivityCreateView_C
// 0x0030 (0x0540 - 0x0510)
class UActivityCreateView_C final : public UFortActivityCreateView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DisabledIconPulse;                                 // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         DisabledWarningHB;                                 // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DisabledWarningMessage;                            // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void RefreshDisabledState();
	void ExecuteUbergraph_ActivityCreateView(int32 EntryPoint);
	void BP_OnPartySizeChanged(const int32 PartySize);
	void BP_OnLocalPlayerPromotedToLeader();
	void BP_OnLocalPlayerDemoted();
	void BP_OnActivated();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ActivityCreateView_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActivityCreateView_C")
	}
	static class UActivityCreateView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityCreateView_C>();
	}
};
DUMPER7_ASSERTS_UActivityCreateView_C;

}

