#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserTileExpandDetailsButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActivityBrowserTileExpandDetailsButton.ActivityBrowserTileExpandDetailsButton_C
// 0x0040 (0x0EF0 - 0x0EB0)
class UActivityBrowserTileExpandDetailsButton_C final : public UCommonButtonBase
{
public:
	uint8                                         Pad_EA8[0x8];                                      // 0x0EA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0EB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FocusFlash;                                        // 0x0EB8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnPCHoverUnHover;                                  // 0x0EC0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnFocus;                                           // 0x0EC8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_DetailsIcon;                                 // 0x0ED0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ScalingSB;                                         // 0x0ED8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         KeybindShift_X;                                    // 0x0EE0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KeybindShift_Y;                                    // 0x0EE4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BrushPadding;                                      // 0x0EE8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SnapAnimationToEnd(class UWidgetAnimation* InAnimation, EUMGSequencePlayMode PlayMode);
	void SetBrushPadding();
	void PreConstruct(bool IsDesignTime);
	void OnTileReset();
	void OnTileLostFocus();
	void OnTileFocused();
	void ExecuteUbergraph_ActivityBrowserTileExpandDetailsButton(int32 EntryPoint);
	void Construct();
	void ChangeKeybindLocation();
	void BP_OnUnhovered();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ActivityBrowserTileExpandDetailsButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActivityBrowserTileExpandDetailsButton_C")
	}
	static class UActivityBrowserTileExpandDetailsButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityBrowserTileExpandDetailsButton_C>();
	}
};
DUMPER7_ASSERTS_UActivityBrowserTileExpandDetailsButton_C;

}

