#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityPlayerBrowserHistoryView

#include "Basic.hpp"


namespace SDK::Params
{

// Function ActivityPlayerBrowserHistoryView.ActivityPlayerBrowserHistoryView_C.ExecuteUbergraph_ActivityPlayerBrowserHistoryView
// 0x0018 (0x0018 - 0x0000)
struct ActivityPlayerBrowserHistoryView_C_ExecuteUbergraph_ActivityPlayerBrowserHistoryView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ActivityPlayerBrowserHistoryView_C_ExecuteUbergraph_ActivityPlayerBrowserHistoryView;

}

