#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivityBrowserTag

#include "Basic.hpp"

#include "DiscoveryBrowserUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ActivityBrowserTag.ActivityBrowserTag_C.SetTextColorFromMaterialInstance
// 0x0030 (0x0030 - 0x0000)
struct ActivityBrowserTag_C_SetTextColorFromMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0014)()
};
DUMPER7_ASSERTS_ActivityBrowserTag_C_SetTextColorFromMaterialInstance;

// Function ActivityBrowserTag.ActivityBrowserTag_C.SetDefaultStyling
// 0x00B0 (0x00B0 - 0x0000)
struct ActivityBrowserTag_C_SetDefaultStyling final
{
public:
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0000(0x00B0)()
};
DUMPER7_ASSERTS_ActivityBrowserTag_C_SetDefaultStyling;

// Function ActivityBrowserTag.ActivityBrowserTag_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserTag_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ActivityBrowserTag_C_PreConstruct;

// Function ActivityBrowserTag.ActivityBrowserTag_C.ExecuteUbergraph_ActivityBrowserTag
// 0x00D0 (0x00D0 - 0x0000)
struct ActivityBrowserTag_C_ExecuteUbergraph_ActivityBrowserTag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x00B0)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortActivityBrowserTagType                   CallFunc_GetTagType_ReturnValue;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ActivityBrowserTag_C_ExecuteUbergraph_ActivityBrowserTag;

}

