#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArgonUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "ArgonRuntime_structs.hpp"
#include "ArgonUI_structs.hpp"


namespace SDK
{

// Class ArgonUI.ArgonWidgetBase
// 0x0008 (0x0310 - 0x0308)
class UArgonWidgetBase : public ULTMWidgetBase
{
public:
	class AFortAthenaMutator_Argon*               ArgonMutator;                                      // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BindToMutator_BP();
	void UnbindFromMutator_BP();

	TArray<class AFortPlayerStateAthena*> GetTeamPlayerStates(uint8 Team) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ArgonWidgetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArgonWidgetBase")
	}
	static class UArgonWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArgonWidgetBase>();
	}
};
DUMPER7_ASSERTS_UArgonWidgetBase;

// Class ArgonUI.ArgonHUDAlertWidget
// 0x0020 (0x0330 - 0x0310)
class UArgonHUDAlertWidget final : public UArgonWidgetBase
{
public:
	float                                         DisplayPlayerFinishedMessageTime;                  // 0x0310(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FArgonFinishedPlayerInfo>       PlayerFinishedMessageQueue;                        // 0x0318(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisplayPlayerFinishedMessage(const struct FArgonFinishedPlayerInfo& FinishedInfo);
	void ForceHidePlayerFinishedMessage();
	void OnPlayerFinished(const struct FArgonFinishedPlayerInfo& FinishedPlayerInfo);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ArgonHUDAlertWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArgonHUDAlertWidget")
	}
	static class UArgonHUDAlertWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArgonHUDAlertWidget>();
	}
};
DUMPER7_ASSERTS_UArgonHUDAlertWidget;

// Class ArgonUI.ArgonLeaderboardWidget
// 0x0010 (0x0320 - 0x0310)
class UArgonLeaderboardWidget final : public UArgonWidgetBase
{
public:
	TArray<struct FArgonLeaderboardData>          LeaderboardEntries;                                // 0x0310(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void OnAnyTeamTicketCountChanged();
	void OnRacingPlayersByPlaceChanged();
	void UpdateLeaderboardUI();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ArgonLeaderboardWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArgonLeaderboardWidget")
	}
	static class UArgonLeaderboardWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArgonLeaderboardWidget>();
	}
};
DUMPER7_ASSERTS_UArgonLeaderboardWidget;

}

