#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AudioGameplayVolume

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AudioGameplayVolume.AudioGameplayVolumeComponentBase.SetPriority
// 0x0004 (0x0004 - 0x0000)
struct AudioGameplayVolumeComponentBase_SetPriority final
{
public:
	int32                                         InPriority;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AudioGameplayVolumeComponentBase_SetPriority;

// Function AudioGameplayVolume.AttenuationVolumeComponent.SetExteriorVolume
// 0x0008 (0x0008 - 0x0000)
struct AttenuationVolumeComponent_SetExteriorVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolateTime;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AttenuationVolumeComponent_SetExteriorVolume;

// Function AudioGameplayVolume.AttenuationVolumeComponent.SetInteriorVolume
// 0x0008 (0x0008 - 0x0000)
struct AttenuationVolumeComponent_SetInteriorVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolateTime;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AttenuationVolumeComponent_SetInteriorVolume;

// Function AudioGameplayVolume.AudioGameplayVolume.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct AudioGameplayVolume_SetEnabled final
{
public:
	bool                                          bNewEnabled;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AudioGameplayVolume_SetEnabled;

// Function AudioGameplayVolume.FilterVolumeComponent.SetExteriorLPF
// 0x0008 (0x0008 - 0x0000)
struct FilterVolumeComponent_SetExteriorLPF final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolateTime;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FilterVolumeComponent_SetExteriorLPF;

// Function AudioGameplayVolume.FilterVolumeComponent.SetInteriorLPF
// 0x0008 (0x0008 - 0x0000)
struct FilterVolumeComponent_SetInteriorLPF final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolateTime;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FilterVolumeComponent_SetInteriorLPF;

// Function AudioGameplayVolume.SubmixSendVolumeComponent.SetSubmixSendSettings
// 0x0010 (0x0010 - 0x0000)
struct SubmixSendVolumeComponent_SetSubmixSendSettings final
{
public:
	TArray<struct FAudioVolumeSubmixSendSettings> NewSubmixSendSettings;                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubmixSendVolumeComponent_SetSubmixSendSettings;

}

