#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AudioGameplayVolume

#include "Basic.hpp"

#include "AudioGameplay_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class AudioGameplayVolume.AudioGameplayVolumeSubsystem
// 0x0128 (0x0158 - 0x0030)
class UAudioGameplayVolumeSubsystem final : public UAudioEngineSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<uint32, class UAudioGameplayVolumeProxyComponent*> AGVComponents;                           // 0x0038(0x0050)(ExportObject, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0xD0];                                      // 0x0088(0x00D0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioGameplayVolumeSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioGameplayVolumeSubsystem")
	}
	static class UAudioGameplayVolumeSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioGameplayVolumeSubsystem>();
	}
};
DUMPER7_ASSERTS_UAudioGameplayVolumeSubsystem;

// Class AudioGameplayVolume.AudioGameplayVolumeComponentBase
// 0x0008 (0x00C0 - 0x00B8)
class UAudioGameplayVolumeComponentBase : public UAudioGameplayComponent
{
public:
	int32                                         Priority;                                          // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetPriority(int32 InPriority);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioGameplayVolumeComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioGameplayVolumeComponentBase")
	}
	static class UAudioGameplayVolumeComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioGameplayVolumeComponentBase>();
	}
};
DUMPER7_ASSERTS_UAudioGameplayVolumeComponentBase;

// Class AudioGameplayVolume.AttenuationVolumeComponent
// 0x0010 (0x00D0 - 0x00C0)
class UAttenuationVolumeComponent final : public UAudioGameplayVolumeComponentBase
{
public:
	float                                         ExteriorVolume;                                    // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ExteriorTime;                                      // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         InteriorVolume;                                    // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         InteriorTime;                                      // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetExteriorVolume(float Volume, float InterpolateTime);
	void SetInteriorVolume(float Volume, float InterpolateTime);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AttenuationVolumeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AttenuationVolumeComponent")
	}
	static class UAttenuationVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttenuationVolumeComponent>();
	}
};
DUMPER7_ASSERTS_UAttenuationVolumeComponent;

// Class AudioGameplayVolume.AudioGameplayVolume
// 0x0010 (0x0268 - 0x0258)
class AAudioGameplayVolume : public AVolume
{
public:
	class UAudioGameplayVolumeProxyComponent*     AGVComponent;                                      // 0x0258(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnabled;                                          // 0x0260(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_bEnabled();
	void SetEnabled(bool bNewEnabled);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioGameplayVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioGameplayVolume")
	}
	static class AAudioGameplayVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAudioGameplayVolume>();
	}
};
DUMPER7_ASSERTS_AAudioGameplayVolume;

// Class AudioGameplayVolume.AudioGameplayVolumeProxyComponent
// 0x0028 (0x00E0 - 0x00B8)
class UAudioGameplayVolumeProxyComponent final : public UAudioGameplayComponent
{
public:
	class UAudioGameplayVolumeProxy*              Proxy;                                             // 0x00B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnProxyEnter;                                      // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnProxyExit;                                       // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioGameplayVolumeProxyComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioGameplayVolumeProxyComponent")
	}
	static class UAudioGameplayVolumeProxyComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioGameplayVolumeProxyComponent>();
	}
};
DUMPER7_ASSERTS_UAudioGameplayVolumeProxyComponent;

// Class AudioGameplayVolume.AudioGameplayVolumeProxy
// 0x0020 (0x0048 - 0x0028)
class UAudioGameplayVolumeProxy : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioGameplayVolumeProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioGameplayVolumeProxy")
	}
	static class UAudioGameplayVolumeProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioGameplayVolumeProxy>();
	}
};
DUMPER7_ASSERTS_UAudioGameplayVolumeProxy;

// Class AudioGameplayVolume.AGVPrimitiveComponentProxy
// 0x0008 (0x0050 - 0x0048)
class UAGVPrimitiveComponentProxy final : public UAudioGameplayVolumeProxy
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AGVPrimitiveComponentProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AGVPrimitiveComponentProxy")
	}
	static class UAGVPrimitiveComponentProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAGVPrimitiveComponentProxy>();
	}
};
DUMPER7_ASSERTS_UAGVPrimitiveComponentProxy;

// Class AudioGameplayVolume.AGVConditionProxy
// 0x0008 (0x0050 - 0x0048)
class UAGVConditionProxy final : public UAudioGameplayVolumeProxy
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AGVConditionProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AGVConditionProxy")
	}
	static class UAGVConditionProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAGVConditionProxy>();
	}
};
DUMPER7_ASSERTS_UAGVConditionProxy;

// Class AudioGameplayVolume.FilterVolumeComponent
// 0x0010 (0x00D0 - 0x00C0)
class UFilterVolumeComponent final : public UAudioGameplayVolumeComponentBase
{
public:
	float                                         ExteriorLPF;                                       // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ExteriorLPFTime;                                   // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         InteriorLPF;                                       // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         InteriorLPFTime;                                   // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetExteriorLPF(float Volume, float InterpolateTime);
	void SetInteriorLPF(float Volume, float InterpolateTime);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FilterVolumeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FilterVolumeComponent")
	}
	static class UFilterVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFilterVolumeComponent>();
	}
};
DUMPER7_ASSERTS_UFilterVolumeComponent;

// Class AudioGameplayVolume.SubmixSendVolumeComponent
// 0x0010 (0x00D0 - 0x00C0)
class USubmixSendVolumeComponent final : public UAudioGameplayVolumeComponentBase
{
public:
	TArray<struct FAudioVolumeSubmixSendSettings> SubmixSendSettings;                                // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void SetSubmixSendSettings(const TArray<struct FAudioVolumeSubmixSendSettings>& NewSubmixSendSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SubmixSendVolumeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SubmixSendVolumeComponent")
	}
	static class USubmixSendVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubmixSendVolumeComponent>();
	}
};
DUMPER7_ASSERTS_USubmixSendVolumeComponent;

}

