#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AudioShapes

#include "Basic.hpp"

#include "AudioGameplay_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class AudioShapes.AudioShapeComponent
// 0x0098 (0x0150 - 0x00B8)
class UAudioShapeComponent : public UAudioGameplayComponent
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxDistanceOffset;                                 // 0x00C0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmoothingDistance;                                 // 0x00C4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeTime;                                          // 0x00C8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bIsAudible)> OnAudibleStateChanged;                           // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMap<class FName, class UAudioComponent*>     AudioComponents;                                   // 0x00E0(0x0050)(ExportObject, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class APlayerController*>              LocalControllers;                                  // 0x0130(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_140[0x10];                                     // 0x0140(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateAudioShape(const TArray<class APlayerController*>& InLocalControllers);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioShapeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioShapeComponent")
	}
	static class UAudioShapeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeComponent>();
	}
};
DUMPER7_ASSERTS_UAudioShapeComponent;

// Class AudioShapes.AudioShapePrimitiveComponent
// 0x0060 (0x01B0 - 0x0150)
class UAudioShapePrimitiveComponent : public UAudioShapeComponent
{
public:
	class USoundBase*                             SoundOnEdge;                                       // 0x0150(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             SoundOnInside;                                     // 0x0158(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsInside)> OnInsideStateChanged;                             // 0x0160(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bUseOwningActorTransform;                          // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoRefreshShape;                                 // 0x0171(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ActorTransformScale;                               // 0x0174(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_180[0x30];                                     // 0x0180(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UAudioComponent* GetEdgeAudioComponent();
	class UAudioComponent* GetInsideAudioComponent();

	bool GetIsPlayerInside() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioShapePrimitiveComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioShapePrimitiveComponent")
	}
	static class UAudioShapePrimitiveComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapePrimitiveComponent>();
	}
};
DUMPER7_ASSERTS_UAudioShapePrimitiveComponent;

// Class AudioShapes.AudioShapeBoxComponent
// 0x0030 (0x01E0 - 0x01B0)
class UAudioShapeBoxComponent final : public UAudioShapePrimitiveComponent
{
public:
	struct FTransform                             BoxTransform;                                      // 0x01B0(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	void SetBoxTransform(const struct FTransform& InTransform);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioShapeBoxComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioShapeBoxComponent")
	}
	static class UAudioShapeBoxComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeBoxComponent>();
	}
};
DUMPER7_ASSERTS_UAudioShapeBoxComponent;

// Class AudioShapes.AudioShapeCylinderComponent
// 0x0008 (0x01B8 - 0x01B0)
class UAudioShapeCylinderComponent final : public UAudioShapePrimitiveComponent
{
public:
	float                                         HalfHeight;                                        // 0x01B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x01B4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SetHalfHeight(float InHalfHeight);
	void SetRadius(float InRadius);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioShapeCylinderComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioShapeCylinderComponent")
	}
	static class UAudioShapeCylinderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeCylinderComponent>();
	}
};
DUMPER7_ASSERTS_UAudioShapeCylinderComponent;

// Class AudioShapes.AudioShapeLineComponent
// 0x0018 (0x01C8 - 0x01B0)
class UAudioShapeLineComponent final : public UAudioShapePrimitiveComponent
{
public:
	struct FVector                                StartPoint;                                        // 0x01B0(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndPoint;                                          // 0x01BC(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SetEndPoint(const struct FVector& InEndPoint);
	void SetStartPoint(const struct FVector& InStartPoint);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioShapeLineComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioShapeLineComponent")
	}
	static class UAudioShapeLineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeLineComponent>();
	}
};
DUMPER7_ASSERTS_UAudioShapeLineComponent;

// Class AudioShapes.AudioShapeSphereComponent
// 0x0008 (0x01B8 - 0x01B0)
class UAudioShapeSphereComponent final : public UAudioShapePrimitiveComponent
{
public:
	float                                         Radius;                                            // 0x01B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetRadius(float InRadius);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioShapeSphereComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioShapeSphereComponent")
	}
	static class UAudioShapeSphereComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeSphereComponent>();
	}
};
DUMPER7_ASSERTS_UAudioShapeSphereComponent;

// Class AudioShapes.AudioShapeSubsystem
// 0x0058 (0x0088 - 0x0030)
class UAudioShapeSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAudioShapeComponent*>           AudioShapes;                                       // 0x0058(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class APlayerController*>              LocalControllers;                                  // 0x0068(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x10];                                      // 0x0078(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioShapeSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioShapeSubsystem")
	}
	static class UAudioShapeSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioShapeSubsystem>();
	}
};
DUMPER7_ASSERTS_UAudioShapeSubsystem;

}

