#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_Glider_Generic_Legacy_Assassians

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Athena_Glider_Generic_Legacy_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Athena_Glider_Generic_Legacy_Assassians.B_Athena_Glider_Generic_Legacy_Assassians_C
// 0x0020 (0x04F0 - 0x04D0)
class AB_Athena_Glider_Generic_Legacy_Assassians_C final : public AB_Athena_Glider_Generic_Legacy_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Athena_Glider_Generic_Legacy_Assassians_C; // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TailLightSequence_NewTrack_0_9C5BDB45438879F20B0D0889F0162762; // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TailLightSequence__Direction_9C5BDB45438879F20B0D0889F0162762; // 0x04DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DD[0x3];                                      // 0x04DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TailLightSequence;                                 // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Bits_MID;                                          // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Athena_Glider_Generic_Legacy_Assassians(int32 EntryPoint);
	void OnParachuteTrailUpdated(float MovementLengthSquared, float ForwardDot, float RightDot, float RotationalMovementAcceleration);
	void TailLightSequence__FinishedFunc();
	void TailLightSequence__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_Athena_Glider_Generic_Legacy_Assassians_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_Athena_Glider_Generic_Legacy_Assassians_C")
	}
	static class AB_Athena_Glider_Generic_Legacy_Assassians_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Athena_Glider_Generic_Legacy_Assassians_C>();
	}
};
DUMPER7_ASSERTS_AB_Athena_Glider_Generic_Legacy_Assassians_C;

}

