#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_Galileo_Lobster_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_Melee_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Athena_Galileo_Lobster_Parent.B_Athena_Galileo_Lobster_Parent_C
// 0x0138 (0x1708 - 0x15D0)
class AB_Athena_Galileo_Lobster_Parent_C final : public AB_Melee_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Athena_Galileo_Lobster_Parent_C;  // 0x15D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_Galileo_Lobster_BlockBreakWarning;               // 0x15D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Galileo_Lobster_Blade_Masked_VisibleUnderwater_; // 0x15E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Galileo_Lobster_Blade;                          // 0x15E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        IdleAudio;                                         // 0x15F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x15F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Activation_A485AC534A744AA4695BBF8F84A8850F; // 0x1600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_A485AC534A744AA4695BBF8F84A8850F; // 0x1604(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1605[0x3];                                     // 0x1605(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x1608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BladeVisibility;                                   // 0x1610(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1611[0x7];                                     // 0x1611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        PlayerCharacter;                                   // 0x1618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     ImpactDecal;                                       // 0x1620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactTipLocation;                                 // 0x1628(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SlashImpactColor;                                  // 0x1634(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               MeleeImpact;                                       // 0x1640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OpenSound;                                         // 0x1648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             CloseSound;                                        // 0x1650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BladeHueColorShift;                                // 0x1658(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BladeRedBlueSwitch;                                // 0x165C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BladeEmissiveIntensity;                            // 0x1660(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BlockingImpactColor;                               // 0x1664(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSkeletalAudioComponent*            SkeletalAudioComponent;                            // 0x1670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_MeleeAttackAbility;                              // 0x1678(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  T_HudElementToHide;                                // 0x1698(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           Timer_ShowReticleStatus;                           // 0x16B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AEmitterCameraLensEffectBase*           BlockBreakWarningLensFX;                           // 0x16C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentPoise;                                      // 0x16C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16CC[0x4];                                     // 0x16CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Timer_BlockBreakWarning;                           // 0x16D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TC_ActionsThatHideBlade;                           // 0x16D8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TScriptInterface<class ICameraLensEffectInterface> LensEffectInterface_BlockBreakWarning;        // 0x16F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void BlockBreak();
	void CreateSkeletalAudioComp(class UFortSkeletalAudioComponent** Component);
	void CurrentPoiseChanged(float CurrentPoise_0);
	void DeactivateBlockBreakWarning();
	void DoBulletBlockEffect(const struct FVector& ImpactLocation);
	void ExecuteUbergraph_B_Athena_Galileo_Lobster_Parent(int32 EntryPoint);
	void Holstered();
	void K2_OnUnEquip();
	void OnPlayImpactFX(const struct FHitResult& HitResult, EPhysicalSurface ImpactPhysicalSurface, class UFXSystemComponent* SpawnedPSC);
	void OnRep_BladeVisibility();
	void OnWeaponAttached();
	void OnWeaponVisibilityChanged(bool bVisible, bool bSetForLocalControllerOnly);
	void ReceiveBeginPlay();
	void ReticleStatusDisplay(bool Hide);
	void RPCUnequip();
	void SetBladeVisibility(bool Visible);
	void ShowReticleStatusDisplay();
	void StartIdleFX();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void ToggleDodgePrompt(bool Visible);
	void ToggleDynamicAudio(bool CanPlayIdleAudio);
	void TurnOnLobster();
	void Unholstered();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_Athena_Galileo_Lobster_Parent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_Athena_Galileo_Lobster_Parent_C")
	}
	static class AB_Athena_Galileo_Lobster_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Athena_Galileo_Lobster_Parent_C>();
	}
};
DUMPER7_ASSERTS_AB_Athena_Galileo_Lobster_Parent_C;

}

