#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Mantis_Weapon_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "B_Melee_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Mantis_Weapon_Parent.B_Mantis_Weapon_Parent_C
// 0x0060 (0x1630 - 0x15D0)
class AB_Mantis_Weapon_Parent_C final : public AB_Melee_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Mantis_Weapon_Parent_C;           // 0x15D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortMantisWeaponComponent*             FortMantisWeapon;                                  // 0x15D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerCharacter;                                   // 0x15E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_MeleeAttackAbility;                              // 0x15E8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  T_HudElementToHide;                                // 0x1608(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           Timer_ShowReticleStatus;                           // 0x1628(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Mantis_Weapon_Parent(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReticleStatusDisplay(bool Hide);
	void ShowReticleStatusDisplay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_Mantis_Weapon_Parent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_Mantis_Weapon_Parent_C")
	}
	static class AB_Mantis_Weapon_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Mantis_Weapon_Parent_C>();
	}
};
DUMPER7_ASSERTS_AB_Mantis_Weapon_Parent_C;

}

