#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassBase

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "BattlePassBase_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "BlueprintContext_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class BattlePassBase.BattlePassLandingPageBase
// 0x0108 (0x0438 - 0x0330)
class UBattlePassLandingPageBase : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_330[0xF0];                                     // 0x0330(0x00F0)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattlePassLandingPageButton*           LastHoveredPageButton;                             // 0x0420(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_428[0x10];                                     // 0x0428(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattlePassLandingPageBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattlePassLandingPageBase")
	}
	static class UBattlePassLandingPageBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassLandingPageBase>();
	}
};
DUMPER7_ASSERTS_UBattlePassLandingPageBase;

// Class BattlePassBase.BattlePassLandingPageButton
// 0x0090 (0x0F40 - 0x0EB0)
class UBattlePassLandingPageButton : public UCommonButtonBase
{
public:
	EBattlePassView                               SubPageType;                                       // 0x0EA8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBattlePassFeatures                           FeatureType;                                       // 0x0EA9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EAA[0x6];                                      // 0x0EAA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBattlePassLandingPageEntryPreviewInfo PreviewInfo;                                       // 0x0EB0(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UFortBangWrapper_NUI*                   BangWrapper;                                       // 0x0EF0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUsesTelemetry;                                    // 0x0EF8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EF9[0x3];                                      // 0x0EF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              Telemetry_Size;                                    // 0x0EFC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIntPoint                              Telemetry_Position;                                // 0x0F04(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0C[0x34];                                     // 0x0F0C(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSubscriptionOwnershipUpdated(const bool bOwnsSubsciption);
	void OnSubscriptionTextureLoaded(class UTexture2D* Texture);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattlePassLandingPageButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattlePassLandingPageButton")
	}
	static class UBattlePassLandingPageButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassLandingPageButton>();
	}
};
DUMPER7_ASSERTS_UBattlePassLandingPageButton;

// Class BattlePassBase.FortBattlePassContext
// 0x0000 (0x0030 - 0x0030)
class UFortBattlePassContext final : public UBlueprintContextBase
{
public:
	bool CanPurchaseBattlePassLevel() const;
	class FText GetCurrentChapterAsText(const bool bFullText) const;
	class FText GetCurrentSeasonNumberAsText(const bool bFullText) const;
	TArray<struct FSeasonCurrencyMcpData> GetSeasonalCurrencies() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBattlePassContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBattlePassContext")
	}
	static class UFortBattlePassContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassContext>();
	}
};
DUMPER7_ASSERTS_UFortBattlePassContext;

// Class BattlePassBase.BattlePassRewardPageBase
// 0x00E8 (0x0418 - 0x0330)
class UBattlePassRewardPageBase : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_330[0xE8];                                     // 0x0330(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattlePassRewardPageBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattlePassRewardPageBase")
	}
	static class UBattlePassRewardPageBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassRewardPageBase>();
	}
};
DUMPER7_ASSERTS_UBattlePassRewardPageBase;

// Class BattlePassBase.BattlePassSubPageInterface
// 0x0000 (0x0000 - 0x0000)
class IBattlePassSubPageInterface final
{
public:
	void OnEnterSubPage();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattlePassSubPageInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattlePassSubPageInterface")
	}
	static class IBattlePassSubPageInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IBattlePassSubPageInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IBattlePassSubPageInterface;

// Class BattlePassBase.BattlePassUIGameFeatureAction
// 0x0078 (0x00A0 - 0x0028)
class UBattlePassUIGameFeatureAction final : public UFortUIGameFeatureAction
{
public:
	TSoftClassPtr<class UClass>                   BattlePassScreenClass;                             // 0x0028(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   BattlePassResourceWidgetClass;                     // 0x0050(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   BattlePassInfoModalClass;                          // 0x0078(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattlePassUIGameFeatureAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattlePassUIGameFeatureAction")
	}
	static class UBattlePassUIGameFeatureAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassUIGameFeatureAction>();
	}
};
DUMPER7_ASSERTS_UBattlePassUIGameFeatureAction;

// Class BattlePassBase.FortBattlePassBulkBuyPageBase
// 0x0168 (0x0498 - 0x0330)
class UFortBattlePassBulkBuyPageBase : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_330[0xE8];                                     // 0x0330(0x00E8)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_Addition;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Subtraction;                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                       DynamicEntryBox_TilesEntries;                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonVisibilitySwitcher*              Switcher_BottomButtons;                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortHoldableButton*                    Button_BuyLevels;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortHoldableButton*                    Button_ClaimReward;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaSeasonItemData_BattleStar*       SeasonData_BattleStar;                             // 0x0448(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSeasonItemDefinition*            SeasonItemDefinition;                              // 0x0450(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTile*                    FocusedReward;                                     // 0x0458(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_460[0x30];                                     // 0x0460(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             ScrollBox_Pages;                                   // 0x0490(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleUserScrolled(float ScrollAmount);
	void OnCostChanged(const int32 Cost);
	void OnPageRangeChanged(const int32 FromPage, const int32 ToPage);
	void OnRewardCountChanged(const int32 Count);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBattlePassBulkBuyPageBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBattlePassBulkBuyPageBase")
	}
	static class UFortBattlePassBulkBuyPageBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassBulkBuyPageBase>();
	}
};
DUMPER7_ASSERTS_UFortBattlePassBulkBuyPageBase;

// Class BattlePassBase.FortBattlePassCheckBoxButton
// 0x0000 (0x0EB0 - 0x0EB0)
class UFortBattlePassCheckBoxButton : public UCommonButtonBase
{
public:
	void OnStateChanged(const bool bNewIsChecked);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBattlePassCheckBoxButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBattlePassCheckBoxButton")
	}
	static class UFortBattlePassCheckBoxButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassCheckBoxButton>();
	}
};
DUMPER7_ASSERTS_UFortBattlePassCheckBoxButton;

// Class BattlePassBase.FortBattlePassCurrencyPanel
// 0x0040 (0x0288 - 0x0248)
class UFortBattlePassCurrencyPanel : public UUserWidget
{
public:
	class UHorizontalBox*                         HBox_BattleStarContainer;                          // 0x0248(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_BattleStar;                                   // 0x0250(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHorizontalBox*                         HBox_CustomSkinContainer;                          // 0x0258(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_CustomSkin;                                   // 0x0260(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_268[0x20];                                     // 0x0268(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBattlePassCurrencyPanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBattlePassCurrencyPanel")
	}
	static class UFortBattlePassCurrencyPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassCurrencyPanel>();
	}
};
DUMPER7_ASSERTS_UFortBattlePassCurrencyPanel;

// Class BattlePassBase.FortBattlePassCustomSkinCategoryTile
// 0x00C0 (0x0308 - 0x0248)
class UFortBattlePassCustomSkinCategoryTile final : public UUserWidget
{
public:
	uint8                                         Pad_248[0x20];                                     // 0x0248(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UProgressBar*                           ProgressBar;                                       // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortDynamicEntryBox*                   FortDynamicEntryBox_Items;                         // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URichTextBlock*                         Text_CategoryTitle;                                // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortBattlePassTile*                    PreviewedTile;                                     // 0x0280(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         OwnedRewards;                                      // 0x0288(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_28C[0x7C];                                     // 0x028C(0x007C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FocusTile(const int32 Index_0);
	void OnLockedProgressUpdated(const int32 CurrentlyOwnedBeforeCategory, const int32 TotalRewardsBeforeCategory, const float LockedProgress);
	void OnLockedStateChanged(const bool bCategoryLocked);
	void OnOwnedTilesUpdated(const int32 CurrentlyOwnedRewards, const int32 TotalRewards, const float CategoryProgress);
	void SetPreviewedTile(const int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBattlePassCustomSkinCategoryTile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBattlePassCustomSkinCategoryTile")
	}
	static class UFortBattlePassCustomSkinCategoryTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassCustomSkinCategoryTile>();
	}
};
DUMPER7_ASSERTS_UFortBattlePassCustomSkinCategoryTile;

// Class BattlePassBase.FortBattlePassCustomSkinPageBase
// 0x0188 (0x04B8 - 0x0330)
class UFortBattlePassCustomSkinPageBase : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_330[0x168];                                    // 0x0330(0x0168)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             ScrollBox_Categories;                              // 0x0498(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortDynamicEntryBox*                   FortDynamicEntryBox_Categories;                    // 0x04A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4A8[0x8];                                      // 0x04A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattlePassEnabledInputData*            EquipEnabledData;                                  // 0x04B0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBattlePassCustomSkinPageBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBattlePassCustomSkinPageBase")
	}
	static class UFortBattlePassCustomSkinPageBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassCustomSkinPageBase>();
	}
};
DUMPER7_ASSERTS_UFortBattlePassCustomSkinPageBase;

// Class BattlePassBase.FortBattlePassPurchaseResourcesWidget
// 0x00B8 (0x03E8 - 0x0330)
class UFortBattlePassPurchaseResourcesWidget : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_330[0x8];                                      // 0x0330(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      Button_Addition;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_BatchAddition;                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Subtraction;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_BatchSubtraction;                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortHoldableButton*                    Button_Purchase;                                   // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_GetVBucks;                                  // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_ReloadMtx;                                  // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortBattlePassCheckBoxButton*          CheckBox_Bundle;                                   // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_CloseMobile;                                // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentLevel;                                      // 0x0388(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsOfferActive;                                    // 0x038C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentVBucks;                                     // 0x0390(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentBattleStars;                                // 0x0394(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         BatchNum;                                          // 0x0398(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentPage;                                       // 0x039C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOfferUnavailable;                                 // 0x03A0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxBundleLevel;                                    // 0x03A4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxLevel;                                          // 0x03A8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxLevelPurchases;                                 // 0x03AC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         BundleAmount;                                      // 0x03B0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    LevelPreviewItem;                                  // 0x03B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C0[0x28];                                     // 0x03C0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandlePurchaseComplete(bool bSuccess, const TArray<struct FPurchasedItemInfo>& PurchasedItems, const class FString& OfferId);
	void HandlePurchaseMultiComplete(bool bSuccess, const TArray<struct FPurchasedItemInfo>& PurchasedItems, const TArray<class FString>& OfferIdList);
	bool IsReloadMtxEnabled();
	void OnAmountChangeButtonClicked();
	void OnOfferUnavailable();
	void OnPurchaseAmountChanged(const int32 NewAmount, const int32 LevelsLeft);
	void OnTotalPriceChanged(const int32 NewPrice);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBattlePassPurchaseResourcesWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBattlePassPurchaseResourcesWidget")
	}
	static class UFortBattlePassPurchaseResourcesWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassPurchaseResourcesWidget>();
	}
};
DUMPER7_ASSERTS_UFortBattlePassPurchaseResourcesWidget;

// Class BattlePassBase.FortBattlePassResourceCounter
// 0x0028 (0x0298 - 0x0270)
class UFortBattlePassResourceCounter : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                       Text_ResourceName;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         LazyImage_ResourceIcon;                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ResourceCount;                                // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_288[0x10];                                     // 0x0288(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBattlePassResourceCounter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBattlePassResourceCounter")
	}
	static class UFortBattlePassResourceCounter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassResourceCounter>();
	}
};
DUMPER7_ASSERTS_UFortBattlePassResourceCounter;

// Class BattlePassBase.FortBattlePassResourcesWidgetBase
// 0x0038 (0x02A8 - 0x0270)
class UFortBattlePassResourcesWidgetBase : public UFortGlobalSeasonResourceWidget
{
public:
	TSubclassOf<class UFortBattlePassResourceCounter> ResourceCounterClass;                          // 0x0270(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   MoreInfoModal;                                     // 0x0278(0x0028)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                       EntryBox_ResourceCounters;                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ShowResourcesInfoModal();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBattlePassResourcesWidgetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBattlePassResourcesWidgetBase")
	}
	static class UFortBattlePassResourcesWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassResourcesWidgetBase>();
	}
};
DUMPER7_ASSERTS_UFortBattlePassResourcesWidgetBase;

// Class BattlePassBase.FortBattlePassRewardGrid
// 0x00C8 (0x03F8 - 0x0330)
class UFortBattlePassRewardGrid : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_330[0x68];                                     // 0x0330(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortBattlePassTileBase>    GridTileClass;                                     // 0x0398(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortBattlePassTileBase>    GridEmptyTileClass;                                // 0x03A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                              GridCellPadding;                                   // 0x03A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassRewardGridHeader*        PageHeader;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGridPanel*                             GridPanel_Rewards;                                 // 0x03B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBattlePassTileBase*                TopLeftTile;                                       // 0x03C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UCommonButtonBase>       LastFocusedTile;                                   // 0x03C8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D0[0x28];                                     // 0x03D0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPageSelected();
	void OnPageUnselected();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBattlePassRewardGrid")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBattlePassRewardGrid")
	}
	static class UFortBattlePassRewardGrid* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassRewardGrid>();
	}
};
DUMPER7_ASSERTS_UFortBattlePassRewardGrid;

// Class BattlePassBase.FortBattlePassRewardGridHeader
// 0x0008 (0x0250 - 0x0248)
class UFortBattlePassRewardGridHeader : public UUserWidget
{
public:
	uint8                                         Pad_248[0x8];                                      // 0x0248(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBattlePassLevelSet(const int32 BattlePassLevel);
	void OnPageLocked(const int32 RequiredLevel, const int32 RequiredRewards);
	void OnPageNumberSet(const int32 InPageNumber);
	void OnPageUnlocked(const int32 PurchasedRewards, const int32 TotalRewards);
	void OnSetPageCustomName(const class FText& CustomName);
	void OnSetPageType(const ERewardPageType PageType);

	int32 GetPageNumber() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBattlePassRewardGridHeader")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBattlePassRewardGridHeader")
	}
	static class UFortBattlePassRewardGridHeader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassRewardGridHeader>();
	}
};
DUMPER7_ASSERTS_UFortBattlePassRewardGridHeader;

// Class BattlePassBase.FortBattlePassTileBase
// 0x0050 (0x0F80 - 0x0F30)
class UFortBattlePassTileBase : public UFortHoldableButton
{
public:
	class USizeBox*                               SizeBox_Content;                                   // 0x0F30(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         UnitHeight;                                        // 0x0F38(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         UnitWidth;                                         // 0x0F3C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F40[0x40];                                     // 0x0F40(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPeeked();
	void OnRevealed();
	void OnSetRequiresBattlePass(const bool bRequiresBP);
	void OnSizeChanged(const struct FVector2D& NewSize);
	void OnStateChanged(const EBattlePassTileAvailabilityStates NewState);
	void SetSize(const EPageItemTileSize TileSize, const struct FVector2D& CellSpacing);
	void SetState(const EBattlePassTileAvailabilityStates NewState);

	const EBattlePassTileAvailabilityStates GetState() const;
	bool IsAvailable() const;
	bool IsLocked() const;
	bool IsOwned() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBattlePassTileBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBattlePassTileBase")
	}
	static class UFortBattlePassTileBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassTileBase>();
	}
};
DUMPER7_ASSERTS_UFortBattlePassTileBase;

// Class BattlePassBase.FortBattlePassTile
// 0x0060 (0x0FE0 - 0x0F80)
class UFortBattlePassTile : public UFortBattlePassTileBase
{
public:
	uint8                                         Pad_F80[0x10];                                     // 0x0F80(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLazyImage*                         Image_RewardItem;                                  // 0x0F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_Currency;                                    // 0x0F98(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FA0[0x40];                                     // 0x0FA0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAffordabilityChanged(const bool bHasEnougCurrency);
	void OnHighlighted();
	void OnLockedProgressUpdated(const float Progress, const int32 CurrentlyOwnedRewards, const int32 NeededRewards);
	void OnLockedStateUpdated(const bool OwnsBattlePass, const bool ParentUnlocked, const bool HasRemainingPrerequisites, const bool bIsDelayed);
	void OnPreviewed();
	void OnSetCurrencyAndPrice(const EBattlePassCurrencyType Currency, const int32 Price);
	void OnSetTrack(const bool bIsFreeTrack, const bool bOwnsBattlePass);
	void OnTilePreviewCycled();
	void OnUnhighlighted();
	void OnUnpreviewed();

	bool HasPrerequisites() const;
	bool IsAffordable() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBattlePassTile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBattlePassTile")
	}
	static class UFortBattlePassTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassTile>();
	}
};
DUMPER7_ASSERTS_UFortBattlePassTile;

// Class BattlePassBase.FortBattlePassTutorialTooltip
// 0x0010 (0x0280 - 0x0270)
class UFortBattlePassTutorialTooltip : public UCommonUserWidget
{
public:
	class UCommonRichTextBlock*                   Text_Tooltip;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HideTooltip();
	void SetText(const class FText& Text);
	void SetTooltipEnabled(const bool bEnable);
	void ShowTooltip();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBattlePassTutorialTooltip")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBattlePassTutorialTooltip")
	}
	static class UFortBattlePassTutorialTooltip* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBattlePassTutorialTooltip>();
	}
};
DUMPER7_ASSERTS_UFortBattlePassTutorialTooltip;

}

