#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS19_LandingPages

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePassS19UI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS19_LandingPages.BPS19_LandingPages_C
// 0x00B0 (0x0538 - 0x0488)
class UBPS19_LandingPages_C final : public UBattlePassLandingPageS19
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_OwnBP;                               // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPS19_SeasonalDataWidget_C*            SeasonDataWidget;                                  // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonVisibilitySwitcher*              Switcher_BottonButtons;                            // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              On_show_BP_character;                              // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Custo_Character;                           // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Mystery_Character;                         // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Bonus_Character;                           // 0x04E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Crew_Character;                            // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Buy_BP;                                    // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Buy_Level;                                 // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              On_show_Gift_Battle_Pass;                          // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          BPOwned;                                           // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CustomizationOwned;                                // 0x0531(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Button_BonusRewards_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Button_BuyBattlePass_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Button_CharacterCustomizer_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Button_GiftBattlePass_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Button_JoinSubscription_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Button_MysteryRewards_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Button_Quests_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__Button_RewardOverview_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Button_BonusRewards_Event_0(class UBPS19_LandingPageButton_C* Button_BonusRewards_0);
	void Button_BuyBattlePass_Event_0(class UBPS19_LandingPage_SmallButton_C* Button_BuyBattlePass_0);
	void Button_BuyResources_Event_0(class UBPS19_LandingPage_SmallButton_C* Button_BuyResources_0);
	void Button_CharacterCustomizer_Event_0(class UBPS19_LandingPageButton_C* Button_CharacterCustomizer_0);
	void Button_GiftBattlePass_Event_0(class UBPS19_LandingPage_SmallButton_C* Button_GiftBattlePass_0);
	void Button_JoinSubscription_Event_0(class UBPS19_LandingPageButton_C* Button_JoinSubscription_0);
	void Button_MysteryRewards_Event_0(class UBPS19_LandingPageButton_C* Button_MysteryRewards);
	void Button_RewardOverview_Event_2(class UBPS19_LandingPageButton_C* Button_RewardOverview);
	void ExecuteUbergraph_BPS19_LandingPages(int32 EntryPoint);
	void On_BattlePass_completed(bool BPComplete);
	void On_Level_Changed(int32 Level);
	void OnBattlePassGiftingAllowed(const bool bGiftingAllowed);
	void OnBattlePassOwned();
	void OnBattlePassSubscriptionAllowed(const bool bSubscriptionAllowed);
	void OnEnterSubPage();
	void play_intro();
	void SequenceEvent__ENTRYPOINTBPS19_LandingPages_0(class UBPS19_LandingPageButton_C* Button_RewardOverview);
	void SequenceEvent__ENTRYPOINTBPS19_LandingPages_1(class UBPS19_LandingPageButton_C* Button_CharacterCustomizer_0);
	void SequenceEvent__ENTRYPOINTBPS19_LandingPages_2(class UBPS19_LandingPageButton_C* Button_MysteryRewards);
	void SequenceEvent__ENTRYPOINTBPS19_LandingPages_3(class UBPS19_LandingPageButton_C* Button_BonusRewards_0);
	void SequenceEvent__ENTRYPOINTBPS19_LandingPages_4(class UBPS19_LandingPageButton_C* Button_JoinSubscription_0);
	void SequenceEvent__ENTRYPOINTBPS19_LandingPages_5(class UBPS19_LandingPage_SmallButton_C* Button_BuyResources_0);
	void SequenceEvent__ENTRYPOINTBPS19_LandingPages_6(class UBPS19_LandingPage_SmallButton_C* Button_GiftBattlePass_0);
	void SequenceEvent__ENTRYPOINTBPS19_LandingPages_7(class UBPS19_LandingPage_SmallButton_C* Button_BuyBattlePass_0);
	void UpdateBonusPageDelay(bool Delayed);
	void UpdateCustomizationButton();
	void UpdateCustomizationSkinAcquired(bool SkinAcquired);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPS19_LandingPages_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPS19_LandingPages_C")
	}
	static class UBPS19_LandingPages_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS19_LandingPages_C>();
	}
};
DUMPER7_ASSERTS_UBPS19_LandingPages_C;

}

