#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ButterCakeRuntime

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum ButterCakeRuntime.EFortButterCakeFootPhase
// NumValues: 0x0010
enum class EFortButterCakeFootPhase : uint8
{
	RightPlantA                              = 0,
	RightPlantB                              = 1,
	RightPlantC                              = 2,
	LeftPlantA                               = 3,
	LeftPlantB                               = 4,
	LeftPlantC                               = 5,
	HostileRightPass                         = 6,
	HostileRightPlant                        = 7,
	HostileLeftPass                          = 8,
	HostileLeftPlant                         = 9,
	BothPlant                                = 10,
	BothPlantA                               = 11,
	BothPlantB                               = 12,
	BothPlantC                               = 13,
	BothPlantD                               = 14,
	EFortButterCakeFootPhase_MAX             = 15,
};

// ScriptStruct ButterCakeRuntime.RigUnit_ButterCakeBaseMutable
// 0x0000 (0x00D0 - 0x00D0)
struct FRigUnit_ButterCakeBaseMutable : public FRigUnitMutable
{
};
DUMPER7_ASSERTS_FRigUnit_ButterCakeBaseMutable;

// ScriptStruct ButterCakeRuntime.RigUnit_UpdateSomeGroundTraces
// 0x0000 (0x00D0 - 0x00D0)
struct FRigUnit_UpdateSomeGroundTraces final : public FRigUnit_ButterCakeBaseMutable
{
};
DUMPER7_ASSERTS_FRigUnit_UpdateSomeGroundTraces;

// ScriptStruct ButterCakeRuntime.RigUnit_ButterCakeBase
// 0x0000 (0x0008 - 0x0008)
struct FRigUnit_ButterCakeBase : public FRigUnit
{
};
DUMPER7_ASSERTS_FRigUnit_ButterCakeBase;

// ScriptStruct ButterCakeRuntime.RigUnit_GetGroundHitAtIndex
// 0x0020 (0x0028 - 0x0008)
struct FRigUnit_GetGroundHitAtIndex final : public FRigUnit_ButterCakeBase
{
public:
	int32                                         Index;                                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Normal;                                            // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigUnit_GetGroundHitAtIndex;

// ScriptStruct ButterCakeRuntime.RigUnit_BoneGroundTrace
// 0x0030 (0x0038 - 0x0008)
struct FRigUnit_BoneGroundTrace final : public FRigUnit_ButterCakeBase
{
public:
	struct FRigElementKey                         bone;                                              // 0x0008(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Above;                                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Below;                                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHit;                                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitNormal;                                         // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_BoneGroundTrace;

// ScriptStruct ButterCakeRuntime.RigUnit_UpdateAllGroundTraces
// 0x0000 (0x00D0 - 0x00D0)
struct FRigUnit_UpdateAllGroundTraces final : public FRigUnit_ButterCakeBaseMutable
{
};
DUMPER7_ASSERTS_FRigUnit_UpdateAllGroundTraces;

// ScriptStruct ButterCakeRuntime.RigUnit_MoveFeetToGround
// 0x0020 (0x00F0 - 0x00D0)
struct FRigUnit_MoveFeetToGround final : public FRigUnit_ButterCakeBaseMutable
{
public:
	TArray<struct FTransform>                     FootEffectorTransformList;                         // 0x00D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 FootEffectorStrengthAlphaList;                     // 0x00E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_MoveFeetToGround;

// ScriptStruct ButterCakeRuntime.RigUnit_MoveTailOutOfGround
// 0x0040 (0x0110 - 0x00D0)
struct FRigUnit_MoveTailOutOfGround final : public FRigUnit_ButterCakeBaseMutable
{
public:
	bool                                          bShouldDoIK;                                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0xF];                                       // 0x00D1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TailTipEffectorTransform;                          // 0x00E0(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_MoveTailOutOfGround;

// ScriptStruct ButterCakeRuntime.RigUnit_MoveChinOutOfGround
// 0x0040 (0x0110 - 0x00D0)
struct FRigUnit_MoveChinOutOfGround final : public FRigUnit_ButterCakeBaseMutable
{
public:
	bool                                          bShouldDoIK;                                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0xF];                                       // 0x00D1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ChinEffectorTransform;                             // 0x00E0(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_MoveChinOutOfGround;

}

