#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ButterCakeRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "ButterCakeRuntime_structs.hpp"


namespace SDK::Params
{

// Function ButterCakeRuntime.ButterCakeUnstuckComponent.HandleAthenaGamePhaseChanged
// 0x0001 (0x0001 - 0x0000)
struct ButterCakeUnstuckComponent_HandleAthenaGamePhaseChanged final
{
public:
	EAthenaGamePhase                              GamePhase;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ButterCakeUnstuckComponent_HandleAthenaGamePhaseChanged;

// Function ButterCakeRuntime.FortAIAnimInstance_ButterCake.ComputeFootPhase
// 0x0001 (0x0001 - 0x0000)
struct FortAIAnimInstance_ButterCake_ComputeFootPhase final
{
public:
	EFortButterCakeFootPhase                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAIAnimInstance_ButterCake_ComputeFootPhase;

// Function ButterCakeRuntime.FortAIAnimInstance_ButterCake.ComputeLeanAngleByVelocity
// 0x0004 (0x0004 - 0x0000)
struct FortAIAnimInstance_ButterCake_ComputeLeanAngleByVelocity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAIAnimInstance_ButterCake_ComputeLeanAngleByVelocity;

// Function ButterCakeRuntime.FortButterCakeComponent_Telemetry.OnEnterBerserk
// 0x0008 (0x0008 - 0x0000)
struct FortButterCakeComponent_Telemetry_OnEnterBerserk final
{
public:
	const class AController*                      Instigator;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortButterCakeComponent_Telemetry_OnEnterBerserk;

// Function ButterCakeRuntime.FortButterCakeComponent_Telemetry.OnItemsEaten
// 0x0004 (0x0004 - 0x0000)
struct FortButterCakeComponent_Telemetry_OnItemsEaten final
{
public:
	int32                                         ItemsCount;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortButterCakeComponent_Telemetry_OnItemsEaten;

// Function ButterCakeRuntime.FortButterCakeComponent_Telemetry.OnItemsSneezed
// 0x0004 (0x0004 - 0x0000)
struct FortButterCakeComponent_Telemetry_OnItemsSneezed final
{
public:
	int32                                         ItemsCount;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortButterCakeComponent_Telemetry_OnItemsSneezed;

// Function ButterCakeRuntime.FortButterCakeControlRig.GetGroundHitLocationAt
// 0x0010 (0x0010 - 0x0000)
struct FortButterCakeControlRig_GetGroundHitLocationAt final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortButterCakeControlRig_GetGroundHitLocationAt;

// Function ButterCakeRuntime.FortButterCakeControlRig.GetGroundHitNormalAt
// 0x0010 (0x0010 - 0x0000)
struct FortButterCakeControlRig_GetGroundHitNormalAt final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortButterCakeControlRig_GetGroundHitNormalAt;

}

