#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CampsiteRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CampsiteRuntime_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// Class CampsiteRuntime.FortControllerComponent_CampsiteAccountItem
// 0x0040 (0x00F0 - 0x00B0)
class UFortControllerComponent_CampsiteAccountItem : public UActorComponent
{
public:
	class UFortCampsiteAccountItemDefinition*     CampsiteAccountItemDefinition;                     // 0x00B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FCampsiteAccountData                   CampsiteAccountData;                               // 0x00B8(0x0028)(Transient, NativeAccessSpecifierPrivate)
	TArray<struct FFortItemEntry>                 CurrentlyStashedItemEntries;                       // 0x00E0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	void CacheAccountItemData();
	void ClearStashedItem(const int32 StashedItemIndex);
	bool ClearStashedItemAndGiveToPlayer(const class AActor* SourceActor, const int32 StashedItemIndex);
	void ClearStoredCampsiteLocations();
	void OnAthenaProfileInitialized();
	bool StashCurrentlyHeldItemAndRemoveFromInventory(const int32 StashedItemIndex);
	bool SwapStashedItem(const class AActor* SourceActor, const int32 StashedItemIndex);
	void WriteStashedItem(const class UFortWorldItem* Item, const int32 StashedItemIndex);
	void WriteStashedItemFromEntry(const struct FFortItemEntry& ItemEntry, const int32 StashedItemIndex);

	struct FFortItemEntry GetCurrentlyStashedItemAsItemEntry(const int32 StashedItemIndex) const;
	bool HasCurrentlyStashedItem(const int32 StashedItemIndex) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortControllerComponent_CampsiteAccountItem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortControllerComponent_CampsiteAccountItem")
	}
	static class UFortControllerComponent_CampsiteAccountItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortControllerComponent_CampsiteAccountItem>();
	}
};
DUMPER7_ASSERTS_UFortControllerComponent_CampsiteAccountItem;

// Class CampsiteRuntime.AbandonedCampsiteManager
// 0x0180 (0x03A0 - 0x0220)
class AAbandonedCampsiteManager final : public AActor
{
public:
	struct FScalableFloat                         MinNumAbandonedCampsites;                          // 0x0220(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxNumAbandonedCampsites;                          // 0x0248(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         AbandonedCampsitesEnabled;                         // 0x0270(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<EAbandonedCampsiteSpawnType, struct FScalableFloat> SpawnTypeWeights;                       // 0x0298(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UEnvQuery>               Spawn_EnvironmentalQuery;                          // 0x02E8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   AbandonedCampsiteAsset;                            // 0x0310(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AAbandonedCampsitePlacedSpawner*> PreplacedCampsiteSpawnPoints;                     // 0x0338(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class AAbandonedCampsitePlacedSpawner*> DeferredPreplacedCampsiteSpawns;                  // 0x0348(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_358[0x10];                                     // 0x0358(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCampsiteAnalytics*                     Analytics;                                         // 0x0368(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_370[0x30];                                     // 0x0370(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnGamePhaseStepChanged(const TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, const EAthenaGamePhaseStep GamePhaseStep);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbandonedCampsiteManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbandonedCampsiteManager")
	}
	static class AAbandonedCampsiteManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAbandonedCampsiteManager>();
	}
};
DUMPER7_ASSERTS_AAbandonedCampsiteManager;

// Class CampsiteRuntime.AbandonedCampsitePlacedSpawner
// 0x0028 (0x0248 - 0x0220)
class AAbandonedCampsitePlacedSpawner final : public AActor
{
public:
	TSoftClassPtr<class UClass>                   AbandonedTentAsset;                                // 0x0220(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SpawnCampsite();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbandonedCampsitePlacedSpawner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbandonedCampsitePlacedSpawner")
	}
	static class AAbandonedCampsitePlacedSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAbandonedCampsitePlacedSpawner>();
	}
};
DUMPER7_ASSERTS_AAbandonedCampsitePlacedSpawner;

// Class CampsiteRuntime.AbandonedTentSpawnPointComponent
// 0x0030 (0x0510 - 0x04E0)
class UAbandonedTentSpawnPointComponent final : public UStaticMeshComponent
{
public:
	struct FScalableFloat                         SpawnChance;                                       // 0x04E0(0x0028)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_508[0x8];                                      // 0x0508(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbandonedTentSpawnPointComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbandonedTentSpawnPointComponent")
	}
	static class UAbandonedTentSpawnPointComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbandonedTentSpawnPointComponent>();
	}
};
DUMPER7_ASSERTS_UAbandonedTentSpawnPointComponent;

// Class CampsiteRuntime.CampsiteAnalytics
// 0x0010 (0x0038 - 0x0028)
class UCampsiteAnalytics final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CampsiteAnalytics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CampsiteAnalytics")
	}
	static class UCampsiteAnalytics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCampsiteAnalytics>();
	}
};
DUMPER7_ASSERTS_UCampsiteAnalytics;

// Class CampsiteRuntime.CampsiteConversationComponent
// 0x0000 (0x00B0 - 0x00B0)
class UCampsiteConversationComponent final : public UActorComponent
{
public:
	void StartConversation(class AFortPlayerController* InstigatingController);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CampsiteConversationComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CampsiteConversationComponent")
	}
	static class UCampsiteConversationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCampsiteConversationComponent>();
	}
};
DUMPER7_ASSERTS_UCampsiteConversationComponent;

// Class CampsiteRuntime.CampsiteFunctionLibraryNative
// 0x0000 (0x0028 - 0x0028)
class UCampsiteFunctionLibraryNative final : public UBlueprintFunctionLibrary
{
public:
	static bool IsItemAvailable(class UObject* WorldContextObject, const class UFortItem* FortItem);
	static bool IsItemDefinitionAvailable(class UObject* WorldContextObject, const class UFortItemDefinition* FortItem);
	static bool IsItemEntryAvailable(class UObject* WorldContextObject, const struct FFortItemEntry& FortItem);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CampsiteFunctionLibraryNative")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CampsiteFunctionLibraryNative")
	}
	static class UCampsiteFunctionLibraryNative* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCampsiteFunctionLibraryNative>();
	}
};
DUMPER7_ASSERTS_UCampsiteFunctionLibraryNative;

// Class CampsiteRuntime.CampsiteImprovementComponent
// 0x00C0 (0x0170 - 0x00B0)
class UCampsiteImprovementComponent final : public UActorComponent
{
public:
	struct FSlateBrush                            MiniMapIconBrush;                                  // 0x00B0(0x00B0)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	int32                                         ImprovementOwnerSquadId;                           // 0x0160(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSimpleMiniMapIndicator*            MinimapIndicator;                                  // 0x0168(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void CreateIndicator();
	void OnRep_ImprovementOwnerSquadId();
	void RemoveIndicator();
	void SetImprovementOwnerSquadId(int32 SquadId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CampsiteImprovementComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CampsiteImprovementComponent")
	}
	static class UCampsiteImprovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCampsiteImprovementComponent>();
	}
};
DUMPER7_ASSERTS_UCampsiteImprovementComponent;

// Class CampsiteRuntime.FortGameStateComponent_Campsite
// 0x0118 (0x01C8 - 0x00B0)
class UFortGameStateComponent_Campsite : public UFortGameStateComponent
{
public:
	TSet<class UFortItemDefinition*>              AllowedItemDefinitions;                            // 0x00B0(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UFortItemDefinition>> BlacklistedItemDefinitions;                    // 0x0100(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<struct FSoftObjectPath>                BlacklistedItemPaths;                              // 0x0110(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<class AAbandonedCampsitePlacedSpawner*> PlacedCampsiteSpawnPoints;                        // 0x0120(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_130[0x18];                                     // 0x0130(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UFortAthenaAIBotNameDataAsset> BotNameDataAsset;                            // 0x0148(0x0028)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_170[0x50];                                     // 0x0170(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             BotNameDataTable;                                  // 0x01C0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ClaimUnusedBotName(class FString* OutBotName);
	void RegisterCampsiteLocation(const struct FVector& NewCampsiteLocation);
	void RegisterPreplacedCampsite(class AAbandonedCampsitePlacedSpawner* PreplacedCampsiteSpawnPoint);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortGameStateComponent_Campsite")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortGameStateComponent_Campsite")
	}
	static class UFortGameStateComponent_Campsite* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameStateComponent_Campsite>();
	}
};
DUMPER7_ASSERTS_UFortGameStateComponent_Campsite;

// Class CampsiteRuntime.FortQueryTest_AbandonedCampsite
// 0x0048 (0x0240 - 0x01F8)
class UFortQueryTest_AbandonedCampsite final : public UEnvQueryTest
{
public:
	float                                         TraceRadius;                                       // 0x01F8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                TraceStartOffset;                                  // 0x01FC(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                TraceEndOffset;                                    // 0x0208(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECollisionChannel                             BlockingChannel;                                   // 0x0214(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPhysicalMaterial>       BlockingMaterial;                                  // 0x0218(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortQueryTest_AbandonedCampsite")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortQueryTest_AbandonedCampsite")
	}
	static class UFortQueryTest_AbandonedCampsite* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQueryTest_AbandonedCampsite>();
	}
};
DUMPER7_ASSERTS_UFortQueryTest_AbandonedCampsite;

}

