#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonConversationRuntime

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonConversationRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class CommonConversationRuntime.ConversationNode
// 0x0030 (0x0058 - 0x0028)
class UConversationNode : public UObject
{
public:
	class UObject*                                EvalWorldContextObj;                               // 0x0028(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NodeName;                                          // 0x0030(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  Compiled_NodeGUID;                                 // 0x0040(0x0010)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UConversationNode*                      ParentNode;                                        // 0x0050(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	struct FLinearColor GetDebugParticipantColor(const struct FGameplayTag& ParticipantID) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationNode")
	}
	static class UConversationNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationNode>();
	}
};
DUMPER7_ASSERTS_UConversationNode;

// Class CommonConversationRuntime.ConversationNodeWithLinks
// 0x0010 (0x0068 - 0x0058)
class UConversationNodeWithLinks : public UConversationNode
{
public:
	TArray<struct FGuid>                          OutputConnections;                                 // 0x0058(0x0010)(BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationNodeWithLinks")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationNodeWithLinks")
	}
	static class UConversationNodeWithLinks* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationNodeWithLinks>();
	}
};
DUMPER7_ASSERTS_UConversationNodeWithLinks;

// Class CommonConversationRuntime.ConversationParticipantComponent
// 0x0100 (0x01B0 - 0x00B0)
class UConversationParticipantComponent : public UActorComponent
{
public:
	uint8                                         Pad_B0[0xDC];                                      // 0x00B0(0x00DC)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ConversationsActive;                               // 0x018C(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UConversationInstance*                  Auth_CurrentConversation;                          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UConversationInstance*>          Auth_Conversations;                                // 0x0198(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientExecuteTaskAndSideEffects(const struct FConversationNodeHandle& Handle);
	void ClientStartConversation(const struct FGameplayTag& AsParticipant);
	void ClientUpdateConversation(const struct FClientConversationMessagePayload& Message);
	void ClientUpdateConversations(int32 InConversationsActive);
	void ClientUpdateConversationTaskChoiceData(const struct FConversationNodeHandle& Handle, const struct FClientConversationOptionEntry& OptionEntry);
	void ClientUpdateParticipants(const struct FConversationParticipants& InParticipants);
	class FText GetParticipantDisplayName();
	void OnRep_ConversationsActive(int32 OldConversationsActive);
	void RequestServerAdvanceConversation(const struct FAdvanceConversationRequest& InChoicePicked);
	void ServerAdvanceConversation(const struct FAdvanceConversationRequest& InChoicePicked);

	bool IsInActiveConversation() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationParticipantComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationParticipantComponent")
	}
	static class UConversationParticipantComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationParticipantComponent>();
	}
};
DUMPER7_ASSERTS_UConversationParticipantComponent;

// Class CommonConversationRuntime.ConversationSubNode
// 0x0000 (0x0058 - 0x0058)
class UConversationSubNode : public UConversationNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationSubNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationSubNode")
	}
	static class UConversationSubNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationSubNode>();
	}
};
DUMPER7_ASSERTS_UConversationSubNode;

// Class CommonConversationRuntime.ConversationChoiceNode
// 0x0038 (0x0090 - 0x0058)
class UConversationChoiceNode : public UConversationSubNode
{
public:
	class FText                                   DefaultChoiceDisplayText;                          // 0x0058(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ChoiceTags;                                        // 0x0070(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	void FillChoice(const struct FConversationContext& Context, struct FClientConversationOptionEntry* ChoiceEntry) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationChoiceNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationChoiceNode")
	}
	static class UConversationChoiceNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationChoiceNode>();
	}
};
DUMPER7_ASSERTS_UConversationChoiceNode;

// Class CommonConversationRuntime.ConversationContextHelpers
// 0x0000 (0x0028 - 0x0028)
class UConversationContextHelpers final : public UBlueprintFunctionLibrary
{
public:
	static struct FConversationTaskResult AbortConversation(const struct FConversationContext& Context);
	static struct FConversationTaskResult AdvanceConversation(const struct FConversationContext& Context);
	static struct FConversationTaskResult AdvanceConversationWithChoice(const struct FConversationContext& Context, const struct FAdvanceConversationRequest& Choice);
	static bool CanConversationContinue(const struct FConversationTaskResult& ConversationTasResult);
	static class UConversationParticipantComponent* FindConversationComponent(class AActor* Actor);
	static class UConversationInstance* GetConversationInstance(const struct FConversationContext& Context);
	static class UConversationParticipantComponent* GetConversationParticipant(const struct FConversationContext& Context, const struct FGameplayTag& ParticipantTag);
	static class AActor* GetConversationParticipantActor(const struct FConversationContext& Context, const struct FGameplayTag& ParticipantTag);
	static struct FConversationNodeHandle GetCurrentConversationNodeHandle(const struct FConversationContext& Context);
	static void MakeConversationParticipant(const struct FConversationContext& Context, class AActor* ParticipantActor, const struct FGameplayTag& ParticipantTag);
	static struct FConversationTaskResult PauseConversationAndSendClientChoices(const struct FConversationContext& Context, const struct FClientConversationMessage& Message);
	static struct FConversationTaskResult ReturnToConversationStart(const struct FConversationContext& Context);
	static struct FConversationTaskResult ReturnToCurrentClientChoice(const struct FConversationContext& Context);
	static struct FConversationTaskResult ReturnToLastClientChoice(const struct FConversationContext& Context);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationContextHelpers")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationContextHelpers")
	}
	static class UConversationContextHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationContextHelpers>();
	}
};
DUMPER7_ASSERTS_UConversationContextHelpers;

// Class CommonConversationRuntime.ConversationDatabase
// 0x00B8 (0x00E8 - 0x0030)
class UConversationDatabase final : public UPrimaryDataAsset
{
public:
	int32                                         CompilerVersion;                                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGuid, class UConversationNode*>  ReachableNodeMap;                                  // 0x0038(0x0050)(NativeAccessSpecifierPrivate)
	TArray<struct FConversationEntryList>         EntryTags;                                         // 0x0088(0x0010)(ZeroConstructor, AssetRegistrySearchable, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  ExitTags;                                          // 0x0098(0x0020)(AssetRegistrySearchable, NativeAccessSpecifierPrivate)
	TArray<struct FGuid>                          InternalNodeIds;                                   // 0x00B8(0x0010)(ZeroConstructor, AssetRegistrySearchable, NativeAccessSpecifierPrivate)
	TArray<struct FGuid>                          LinkedToNodeIds;                                   // 0x00C8(0x0010)(ZeroConstructor, AssetRegistrySearchable, NativeAccessSpecifierPrivate)
	TArray<struct FCommonDialogueBankParticipant> Speakers;                                          // 0x00D8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationDatabase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationDatabase")
	}
	static class UConversationDatabase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationDatabase>();
	}
};
DUMPER7_ASSERTS_UConversationDatabase;

// Class CommonConversationRuntime.ConversationEntryPointNode
// 0x0008 (0x0070 - 0x0068)
class UConversationEntryPointNode final : public UConversationNodeWithLinks
{
public:
	struct FGameplayTag                           EntryTag;                                          // 0x0068(0x0008)(Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationEntryPointNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationEntryPointNode")
	}
	static class UConversationEntryPointNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationEntryPointNode>();
	}
};
DUMPER7_ASSERTS_UConversationEntryPointNode;

// Class CommonConversationRuntime.ConversationInstance
// 0x0180 (0x01A8 - 0x0028)
class UConversationInstance : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConversationParticipants              Participants;                                      // 0x0050(0x0010)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x148];                                     // 0x0060(0x0148)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationInstance")
	}
	static class UConversationInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationInstance>();
	}
};
DUMPER7_ASSERTS_UConversationInstance;

// Class CommonConversationRuntime.ConversationLibrary
// 0x0000 (0x0028 - 0x0028)
class UConversationLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UConversationInstance* StartConversation(const struct FGameplayTag& ConversationEntryTag, class AActor* Instigator, const struct FGameplayTag& InstigatorTag, class AActor* Target, const struct FGameplayTag& TargetTag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationLibrary")
	}
	static class UConversationLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationLibrary>();
	}
};
DUMPER7_ASSERTS_UConversationLibrary;

// Class CommonConversationRuntime.ConversationTaskNode
// 0x0018 (0x0080 - 0x0068)
class UConversationTaskNode : public UConversationNodeWithLinks
{
public:
	TArray<class UConversationSubNode*>           SubNodes;                                          // 0x0068(0x0010)(BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIgnoreRequirementsWhileAdvancingConversations;    // 0x0078(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ExecuteClientEffects(const struct FConversationContext& Context) const;
	struct FConversationTaskResult ExecuteTaskNode(const struct FConversationContext& Context) const;
	void GatherStaticExtraData(const struct FConversationContext& Context, TArray<struct FConversationNodeParameterPair>* InOutExtraData) const;
	bool GetNodeBodyColor(struct FLinearColor* BodyColor) const;
	EConversationRequirementResult IsRequirementSatisfied(const struct FConversationContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationTaskNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationTaskNode")
	}
	static class UConversationTaskNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationTaskNode>();
	}
};
DUMPER7_ASSERTS_UConversationTaskNode;

// Class CommonConversationRuntime.ConversationLinkNode
// 0x0008 (0x0088 - 0x0080)
class UConversationLinkNode final : public UConversationTaskNode
{
public:
	struct FGameplayTag                           RemoteEntryTag;                                    // 0x0080(0x0008)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationLinkNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationLinkNode")
	}
	static class UConversationLinkNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationLinkNode>();
	}
};
DUMPER7_ASSERTS_UConversationLinkNode;

// Class CommonConversationRuntime.ConversationRegistry
// 0x01C8 (0x01F8 - 0x0030)
class UConversationRegistry final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetSerializeScriptStructCache_ConvVersion ConversationChoiceDataStructCache;             // 0x0038(0x0060)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x160];                                     // 0x0098(0x0160)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationRegistry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationRegistry")
	}
	static class UConversationRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationRegistry>();
	}
};
DUMPER7_ASSERTS_UConversationRegistry;

// Class CommonConversationRuntime.ConversationRequirementNode
// 0x0000 (0x0058 - 0x0058)
class UConversationRequirementNode : public UConversationSubNode
{
public:
	EConversationRequirementResult IsRequirementSatisfied(const struct FConversationContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationRequirementNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationRequirementNode")
	}
	static class UConversationRequirementNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationRequirementNode>();
	}
};
DUMPER7_ASSERTS_UConversationRequirementNode;

// Class CommonConversationRuntime.ConversationSettings
// 0x0028 (0x0060 - 0x0038)
class UConversationSettings final : public UDeveloperSettings
{
public:
	TSoftClassPtr<class UClass>                   ConversationInstanceClass;                         // 0x0038(0x0028)(Edit, Config, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationSettings")
	}
	static class UConversationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationSettings>();
	}
};
DUMPER7_ASSERTS_UConversationSettings;

// Class CommonConversationRuntime.ConversationSideEffectNode
// 0x0000 (0x0058 - 0x0058)
class UConversationSideEffectNode final : public UConversationSubNode
{
public:
	void ClientCauseSideEffect(const struct FConversationContext& Context) const;
	void ServerCauseSideEffect(const struct FConversationContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationSideEffectNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationSideEffectNode")
	}
	static class UConversationSideEffectNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationSideEffectNode>();
	}
};
DUMPER7_ASSERTS_UConversationSideEffectNode;

}

