#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonUILegacy

#include "Basic.hpp"

#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonUILegacy_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// Class CommonUILegacy.CommonInputManagerLegacy
// 0x00E0 (0x0108 - 0x0028)
class UCommonInputManagerLegacy final : public UObject
{
public:
	uint8                                         Pad_28[0x80];                                      // 0x0028(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICommonActionHandlerInterface> CurrentlyHeldActionInputHandler;           // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UCommonActivatablePanelLegacy*>  ActivatablePanelStack;                             // 0x00B8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UCommonGlobalInputHandlerLegacy*        GlobalInputHandler;                                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x18];                                      // 0x00D0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOperation>                     Operations;                                        // 0x00E8(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8[0x10];                                      // 0x00F8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetAvailableInputActions(TArray<struct FCommonInputActionHandlerData>* AvailableInputActions);
	void PopActivatablePanel(class UCommonActivatablePanelLegacy* ActivatablePanel);
	void PushActivatablePanel(class UCommonActivatablePanelLegacy* ActivatablePanel, bool bIntroPanel, bool bOutroPanelBelow);
	void ResumeStartingOperationProcessing();
	void SetGlobalInputHandlerPriorityFilter(int32 InFilterPriority);
	bool StartListeningForExistingHeldAction(const struct FDataTableRowHandle& InputActionDataRow, const TDelegate<void()>& CompleteEvent, const TDelegate<void(float HeldPercent)>& ProgressEvent);
	bool StopListeningForExistingHeldAction(const struct FDataTableRowHandle& InputActionDataRow, const TDelegate<void()>& CompleteEvent, const TDelegate<void(float HeldPercent)>& ProgressEvent);
	void SuspendStartingOperationProcessing();

	int32 GetGlobalInputHandlerPriorityFilter() const;
	class UCommonActivatablePanelLegacy* GetTopPanel() const;
	bool IsInputSuspended() const;
	bool IsPanelOnStack(const class UCommonActivatablePanelLegacy* InPanel) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonInputManagerLegacy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonInputManagerLegacy")
	}
	static class UCommonInputManagerLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonInputManagerLegacy>();
	}
};
DUMPER7_ASSERTS_UCommonInputManagerLegacy;

// Class CommonUILegacy.CommonButtonLegacy
// 0x0050 (0x0F00 - 0x0EB0)
#pragma pack(push, 0x1)
class alignas(0x10) UCommonButtonLegacy : public UCommonButtonBase
{
public:
	TMulticastInlineDelegate<void(class UCommonButtonLegacy* Button, bool Selected)> OnSelectedChanged; // 0x0EA8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UCommonButtonLegacy* Button)> OnButtonClicked;               // 0x0EB8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UCommonButtonLegacy* Button)> OnButtonDoubleClicked;         // 0x0EC8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UCommonButtonLegacy* Button)> OnButtonHovered;               // 0x0ED8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UCommonButtonLegacy* Button)> OnButtonUnhovered;             // 0x0EE8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	void HandleOnButtonClicked(class UCommonButtonBase* Button);
	void HandleOnButtonDoubleClicked(class UCommonButtonBase* Button);
	void HandleOnButtonHovered(class UCommonButtonBase* Button);
	void HandleOnButtonUnhovered(class UCommonButtonBase* Button);
	void HandleOnSelectedChanged(class UCommonButtonBase* Button, bool InSelected);
	void SetTriggeredInputActionLegacy(const struct FDataTableRowHandle& InputActionRow, class UCommonActivatablePanelLegacy* OldPanel);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonButtonLegacy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonButtonLegacy")
	}
	static class UCommonButtonLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonButtonLegacy>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UCommonButtonLegacy;

// Class CommonUILegacy.CommonActivatablePanelLegacy
// 0x0138 (0x0468 - 0x0330)
class UCommonActivatablePanelLegacy : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_330[0x8];                                      // 0x0330(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UCommonActivatablePanelLegacy* Panel)> OnWidgetActivated;    // 0x0338(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UCommonActivatablePanelLegacy* Panel)> OnWidgetDeactivated;  // 0x0348(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bConsumeAllActions;                                // 0x0358(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExposeActionsExternally;                          // 0x0359(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldBypassStack;                                // 0x035A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_35B[0x10D];                                    // 0x035B(0x010D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddInputActionHandler(class UDataTable* DataTable, class FName RowName, TDelegate<void(bool* bPassThrough)> CommitedEvent);
	void AddInputActionHandlerWithPopup(class UDataTable* DataTable, class FName RowName, TDelegate<void(bool* bPassThrough)> CommitedEvent, class UCommonPopupMenuLegacy* PopupMenu);
	void AddInputActionHandlerWithProgress(class UDataTable* DataTable, class FName RowName, TDelegate<void(bool* bPassThrough)> CommitedEvent, TDelegate<void(float HeldPercent)> ProgressEvent);
	void AddInputActionHandlerWithProgressPopup(class UDataTable* DataTable, class FName RowName, TDelegate<void(bool* bPassThrough)> CommitedEvent, TDelegate<void(float HeldPercent)> ProgressEvent, class UCommonPopupMenuLegacy* PopupMenu);
	void AddInputActionNoHandler(class UDataTable* DataTable, class FName RowName);
	void BeginIntro();
	void BeginOutro();
	void EndIntro();
	void EndOutro();
	void OnAddedToActivationStack();
	void OnBeginIntro();
	void OnBeginOutro();
	void OnInputModeChanged(bool bUsingGamepad);
	void OnRemovedFromActivationStack();
	void OnTransitionedBySwitcher();
	void PopPanel();
	void RemoveAllInputActionHandlers();
	void RemoveInputActionHandler(const struct FDataTableRowHandle& InputActionRow);
	void SetActionHandlerState(const class UDataTable* DataTable, class FName RowName, EInputActionState State);
	void SetActionHandlerStateFromHandle(const struct FDataTableRowHandle& InputActionRow, EInputActionState State);
	void SetActionHandlerStateFromHandleWithDisabledCommitEvent(const struct FDataTableRowHandle& InputActionRow, EInputActionState State, TDelegate<void(bool* bPassThrough)> DisabledCommitEvent);
	void SetActionHandlerStateWithDisabledCommitEvent(class UDataTable* DataTable, class FName RowName, EInputActionState State, TDelegate<void(bool* bPassThrough)> DisabledCommitEvent);
	void SetInputActionHandler(const struct FDataTableRowHandle& InputActionRow, TDelegate<void(bool* bPassThrough)> CommitedEvent);
	void SetInputActionHandlerWithPopupMenu(const struct FDataTableRowHandle& InputActionRow, TDelegate<void(bool* bPassThrough)> CommitedEvent, class UCommonPopupMenuLegacy* PopupMenu);
	void SetInputActionHandlerWithProgress(const struct FDataTableRowHandle& InputActionRow, TDelegate<void(bool* bPassThrough)> CommitedEvent, TDelegate<void(float HeldPercent)> ProgressEvent);
	void SetInputActionHandlerWithProgressPopupMenu(const struct FDataTableRowHandle& InputActionRow, TDelegate<void(bool* bPassThrough)> CommitedEvent, TDelegate<void(float HeldPercent)> ProgressEvent, class UCommonPopupMenuLegacy* PopupMenu);

	bool GetInputActions(TArray<struct FCommonInputActionHandlerData>* InputActionDataRows) const;
	bool HasInputActionHandler(const struct FDataTableRowHandle& InputActionRow) const;
	bool IsInActivationStack() const;
	bool IsIntroed() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonActivatablePanelLegacy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonActivatablePanelLegacy")
	}
	static class UCommonActivatablePanelLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonActivatablePanelLegacy>();
	}
};
DUMPER7_ASSERTS_UCommonActivatablePanelLegacy;

// Class CommonUILegacy.CommonButtonGroupLegacy
// 0x00A0 (0x01B0 - 0x0110)
class UCommonButtonGroupLegacy : public UCommonButtonGroupBase
{
public:
	TMulticastInlineDelegate<void(class UCommonButtonLegacy* AssociatedButton, int32 ButtonIndex)> OnSelectedButtonChanged; // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_120[0x18];                                     // 0x0120(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UCommonButtonLegacy* AssociatedButton, int32 ButtonIndex)> OnHoveredButtonChanged; // 0x0138(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_148[0x18];                                     // 0x0148(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UCommonButtonLegacy* AssociatedButton, int32 ButtonIndex)> OnButtonClicked; // 0x0160(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_170[0x18];                                     // 0x0170(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UCommonButtonLegacy* AssociatedButton, int32 ButtonIndex)> OnButtonDoubleClicked; // 0x0188(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_198[0x18];                                     // 0x0198(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UCommonButtonGroupLegacy* CreateButtonGroup(class UObject* ContextObject, bool bInSelectionRequired);

	void HandleNativeOnButtonClicked(class UCommonButtonBase* BaseButton, int32 InSelectedButtonIndex);
	void HandleNativeOnButtonDoubleClicked(class UCommonButtonBase* BaseButton, int32 InSelectedButtonIndex);
	void HandleNativeOnHoveredButtonChanged(class UCommonButtonBase* BaseButton, int32 InSelectedButtonIndex);
	void HandleNativeOnSelectedButtonChanged(class UCommonButtonBase* BaseButton, int32 InSelectedButtonIndex);
	void HandleOnButtonClicked(class UCommonButtonBase* BaseButton, int32 InSelectedButtonIndex);
	void HandleOnButtonDoubleClicked(class UCommonButtonBase* BaseButton, int32 InSelectedButtonIndex);
	void HandleOnHoveredButtonChanged(class UCommonButtonBase* BaseButton, int32 InSelectedButtonIndex);
	void HandleOnSelectedButtonChanged(class UCommonButtonBase* BaseButton, int32 InSelectedButtonIndex);
	void OnButtonHovered(class UCommonButtonLegacy* BaseButton);
	void OnButtonUnhovered(class UCommonButtonLegacy* BaseButton);
	void OnHandleButtonClicked(class UCommonButtonLegacy* BaseButton);
	void OnHandleButtonDoubleClicked(class UCommonButtonLegacy* BaseButton);
	void OnSelectionStateChanged(class UCommonButtonLegacy* BaseButton, bool bIsSelected);

	class UCommonButtonLegacy* GetButtonAtIndex(int32 Index_0) const;
	class UCommonButtonLegacy* GetSelectedButton() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonButtonGroupLegacy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonButtonGroupLegacy")
	}
	static class UCommonButtonGroupLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonButtonGroupLegacy>();
	}
};
DUMPER7_ASSERTS_UCommonButtonGroupLegacy;

// Class CommonUILegacy.CommonButtonInternalLegacy
// 0x0000 (0x0580 - 0x0580)
class UCommonButtonInternalLegacy final : public UCommonButtonInternalBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonButtonInternalLegacy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonButtonInternalLegacy")
	}
	static class UCommonButtonInternalLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonButtonInternalLegacy>();
	}
};
DUMPER7_ASSERTS_UCommonButtonInternalLegacy;

// Class CommonUILegacy.CommonGlobalInputHandlerLegacy
// 0x0048 (0x0070 - 0x0028)
class UCommonGlobalInputHandlerLegacy final : public UObject
{
public:
	uint8                                         Pad_28[0x48];                                      // 0x0028(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonGlobalInputHandlerLegacy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonGlobalInputHandlerLegacy")
	}
	static class UCommonGlobalInputHandlerLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonGlobalInputHandlerLegacy>();
	}
};
DUMPER7_ASSERTS_UCommonGlobalInputHandlerLegacy;

// Class CommonUILegacy.CommonInputReflectorLegacy
// 0x0030 (0x02A0 - 0x0270)
class UCommonInputReflectorLegacy final : public UCommonUserWidget
{
public:
	TSubclassOf<class UCommonButtonLegacy>        ButtonType;                                        // 0x0270(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UCommonButtonLegacy*>            ActiveButtons;                                     // 0x0278(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UCommonButtonLegacy*>            InactiveButtons;                                   // 0x0288(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnButtonAdded(class UCommonButtonLegacy* AddedButton, const struct FCommonInputActionHandlerData& Data);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonInputReflectorLegacy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonInputReflectorLegacy")
	}
	static class UCommonInputReflectorLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonInputReflectorLegacy>();
	}
};
DUMPER7_ASSERTS_UCommonInputReflectorLegacy;

// Class CommonUILegacy.CommonPopupButtonLegacy
// 0x0010 (0x0F10 - 0x0F00)
#pragma pack(push, 0x1)
class alignas(0x10) UCommonPopupButtonLegacy : public UCommonButtonLegacy
{
public:
	class UMenuAnchor*                            PopupMenuAnchor;                                   // 0x0EF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonPopupMenuLegacy*                 PopupMenu;                                         // 0x0F00(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UUserWidget* GetMenuAnchorWidget();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonPopupButtonLegacy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonPopupButtonLegacy")
	}
	static class UCommonPopupButtonLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonPopupButtonLegacy>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UCommonPopupButtonLegacy;

// Class CommonUILegacy.CommonPopupMenuLegacy
// 0x0018 (0x0480 - 0x0468)
class UCommonPopupMenuLegacy : public UCommonActivatablePanelLegacy
{
public:
	bool                                          bUseInputStack;                                    // 0x0468(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_469[0x3];                                      // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UMenuAnchor>             OwningMenuAnchor;                                  // 0x046C(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UObject>                 ContextProvidingObject;                            // 0x0474(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandlePostDifferentContextProviderSet();
	void HandlePreDifferentContextProviderSet();
	void OnIsOpenChanged(bool IsOpen);
	void RequestClose();
	void SetContextProvider(const class UObject* ContextProvidingObject_0);
	void SetOwningMenuAnchor(const class UMenuAnchor* MenuAnchor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonPopupMenuLegacy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonPopupMenuLegacy")
	}
	static class UCommonPopupMenuLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonPopupMenuLegacy>();
	}
};
DUMPER7_ASSERTS_UCommonPopupMenuLegacy;

// Class CommonUILegacy.CommonTabListWidgetLegacy
// 0x0020 (0x0360 - 0x0340)
class UCommonTabListWidgetLegacy : public UCommonTabListWidgetBase
{
public:
	TMulticastInlineDelegate<void(class FName TabId, class UCommonButtonLegacy* TabButton)> OnTabButtonCreated; // 0x0340(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName TabId, class UCommonButtonLegacy* TabButton)> OnTabButtonRemoved; // 0x0350(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	class UCommonButtonLegacy* GetTabButtonByID(class FName TabNameID);
	void HandleOnTabButtonCreated(class FName TabId, class UCommonButtonBase* TabButton);
	void HandleOnTabButtonRemoved(class FName TabId, class UCommonButtonBase* TabButton);
	void HandleTabCreated(class FName TabNameID, class UCommonButtonLegacy* TabButton);
	void HandleTabRemoved(class FName TabNameID, class UCommonButtonLegacy* TabButton);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonTabListWidgetLegacy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonTabListWidgetLegacy")
	}
	static class UCommonTabListWidgetLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonTabListWidgetLegacy>();
	}
};
DUMPER7_ASSERTS_UCommonTabListWidgetLegacy;

// Class CommonUILegacy.CommonUIActionRouterLegacy
// 0x0008 (0x0110 - 0x0108)
class UCommonUIActionRouterLegacy final : public UCommonUIActionRouterBase
{
public:
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonUIActionRouterLegacy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonUIActionRouterLegacy")
	}
	static class UCommonUIActionRouterLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUIActionRouterLegacy>();
	}
};
DUMPER7_ASSERTS_UCommonUIActionRouterLegacy;

// Class CommonUILegacy.CommonUISubsystemLegacy
// 0x0030 (0x0070 - 0x0040)
class UCommonUISubsystemLegacy final : public UCommonUISubsystemBase
{
public:
	TMulticastInlineDelegate<void(bool bInputSuspended)> OnInputSuspensionChanged;                   // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UCommonInputManagerLegacy*              CommonInputManager;                                // 0x0050(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x18];                                      // 0x0058(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UCommonInputManagerLegacy* GetInputManager() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonUISubsystemLegacy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonUISubsystemLegacy")
	}
	static class UCommonUISubsystemLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUISubsystemLegacy>();
	}
};
DUMPER7_ASSERTS_UCommonUISubsystemLegacy;

// Class CommonUILegacy.CommonVisibilityWidgetLegacy
// 0x0010 (0x02C0 - 0x02B0)
class UCommonVisibilityWidgetLegacy final : public UCommonBorder
{
public:
	bool                                          bShowForGamepad;                                   // 0x02B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForMouseAndKeyboard;                          // 0x02B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForTouch;                                     // 0x02B2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForPC;                                        // 0x02B3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForMac;                                       // 0x02B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForPS4;                                       // 0x02B5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForPS5;                                       // 0x02B6(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForXBox;                                      // 0x02B7(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForXSX;                                       // 0x02B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForIOS;                                       // 0x02B9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForAndroid;                                   // 0x02BA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForErebus;                                    // 0x02BB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              VisibleType;                                       // 0x02BC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              HiddenType;                                        // 0x02BD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2BE[0x2];                                      // 0x02BE(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonVisibilityWidgetLegacy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonVisibilityWidgetLegacy")
	}
	static class UCommonVisibilityWidgetLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonVisibilityWidgetLegacy>();
	}
};
DUMPER7_ASSERTS_UCommonVisibilityWidgetLegacy;

// Class CommonUILegacy.CommonWidgetStackLegacy
// 0x0010 (0x0160 - 0x0150)
class UCommonWidgetStackLegacy final : public UCommonVisibilitySwitcher
{
public:
	TMulticastInlineDelegate<void(class UWidget* InActiveWidget, int32 InActiveWidgetIndex)> OnActiveWidgetChangedLegacyEvent; // 0x0150(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	void ActivateWidget();
	void DeactivateWidget();
	class UWidget* PopWidget();
	void PushWidget(class UWidget* InWidget);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonWidgetStackLegacy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonWidgetStackLegacy")
	}
	static class UCommonWidgetStackLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonWidgetStackLegacy>();
	}
};
DUMPER7_ASSERTS_UCommonWidgetStackLegacy;

// Class CommonUILegacy.CommonWidgetSwitcherLegacy
// 0x0028 (0x01B0 - 0x0188)
class UCommonWidgetSwitcherLegacy : public UCommonAnimatedSwitcher
{
public:
	TMulticastInlineDelegate<void(class UCommonActivatablePanelLegacy* DeactivatedWidget)> OnActiveWidgetDeactivated; // 0x0188(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UWidget* ActiveWidget, int32 ActiveWidgetIndex)> OnActiveWidgetChanged; // 0x0198(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A8[0x1];                                      // 0x01A8(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bWidgetActivationEnabled;                          // 0x01A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bOutroPanelBelow;                                  // 0x01AA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1AB[0x5];                                      // 0x01AB(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateWidget();
	void DeactivateWidget();
	void HandleActiveWidgetDeactivated(class UCommonActivatablePanelLegacy* DeactivatedPanel);
	void SetActiveWidget_Advanced(class UWidget* Widget, const bool AttemptActivationChange);
	void SetActiveWidgetIndex_Advanced(const int32 Index_0, const bool AttemptActivationChange);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonWidgetSwitcherLegacy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonWidgetSwitcherLegacy")
	}
	static class UCommonWidgetSwitcherLegacy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonWidgetSwitcherLegacy>();
	}
};
DUMPER7_ASSERTS_UCommonWidgetSwitcherLegacy;

}

