#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlRigSpline

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum ControlRigSpline.ESplineType
// NumValues: 0x0003
enum class ESplineType : uint8
{
	BSpline                                  = 0,
	Hermite                                  = 1,
	Max                                      = 2,
};

// ScriptStruct ControlRigSpline.ControlRigSplineImpl
// 0x0060 (0x0060 - 0x0000)
struct alignas(0x08) FControlRigSplineImpl final
{
public:
	uint8                                         Pad_0[0x60];                                       // 0x0000(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FControlRigSplineImpl;

// ScriptStruct ControlRigSpline.ControlRigSpline
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FControlRigSpline final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FControlRigSpline;

// ScriptStruct ControlRigSpline.RigUnit_ControlRigSplineBase
// 0x0000 (0x0008 - 0x0008)
struct FRigUnit_ControlRigSplineBase : public FRigUnit
{
};
DUMPER7_ASSERTS_FRigUnit_ControlRigSplineBase;

// ScriptStruct ControlRigSpline.RigUnit_ControlRigSplineFromPoints
// 0x0038 (0x0040 - 0x0008)
struct FRigUnit_ControlRigSplineFromPoints final : public FRigUnit_ControlRigSplineBase
{
public:
	TArray<struct FVector>                        Points;                                            // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	ESplineType                                   SplineMode;                                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SamplesPerSegment;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Compression;                                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Stretch;                                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FControlRigSpline                      Spline;                                            // 0x0028(0x0018)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_ControlRigSplineFromPoints;

// ScriptStruct ControlRigSpline.RigUnit_SetSplinePoints
// 0x0030 (0x0100 - 0x00D0)
struct FRigUnit_SetSplinePoints final : public FRigUnitMutable
{
public:
	TArray<struct FVector>                        Points;                                            // 0x00D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FControlRigSpline                      Spline;                                            // 0x00E0(0x0018)(NativeAccessSpecifierPublic)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigUnit_SetSplinePoints;

// ScriptStruct ControlRigSpline.RigUnit_PositionFromControlRigSpline
// 0x0028 (0x0030 - 0x0008)
struct FRigUnit_PositionFromControlRigSpline final : public FRigUnit_ControlRigSplineBase
{
public:
	struct FControlRigSpline                      Spline;                                            // 0x0008(0x0018)(NativeAccessSpecifierPublic)
	float                                         U;                                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_PositionFromControlRigSpline;

// ScriptStruct ControlRigSpline.RigUnit_TransformFromControlRigSpline
// 0x0068 (0x0070 - 0x0008)
struct FRigUnit_TransformFromControlRigSpline final : public FRigUnit_ControlRigSplineBase
{
public:
	struct FControlRigSpline                      Spline;                                            // 0x0008(0x0018)(NativeAccessSpecifierPublic)
	struct FVector                                UpVector;                                          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Roll;                                              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         U;                                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0040(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_TransformFromControlRigSpline;

// ScriptStruct ControlRigSpline.RigUnit_TangentFromControlRigSpline
// 0x0028 (0x0030 - 0x0008)
struct FRigUnit_TangentFromControlRigSpline final : public FRigUnit_ControlRigSplineBase
{
public:
	struct FControlRigSpline                      Spline;                                            // 0x0008(0x0018)(NativeAccessSpecifierPublic)
	float                                         U;                                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Tangent;                                           // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_TangentFromControlRigSpline;

// ScriptStruct ControlRigSpline.RigUnit_DrawControlRigSpline
// 0x0030 (0x0100 - 0x00D0)
struct FRigUnit_DrawControlRigSpline final : public FRigUnitMutable
{
public:
	struct FControlRigSpline                      Spline;                                            // 0x00D0(0x0018)(NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Thickness;                                         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Detail;                                            // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_DrawControlRigSpline;

// ScriptStruct ControlRigSpline.RigUnit_GetLengthControlRigSpline
// 0x0020 (0x0028 - 0x0008)
struct FRigUnit_GetLengthControlRigSpline final : public FRigUnit
{
public:
	struct FControlRigSpline                      Spline;                                            // 0x0008(0x0018)(NativeAccessSpecifierPublic)
	float                                         Length;                                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigUnit_GetLengthControlRigSpline;

// ScriptStruct ControlRigSpline.RigUnit_FitChainToSplineCurve
// 0x0180 (0x0250 - 0x00D0)
struct FRigUnit_FitChainToSplineCurve final : public FRigUnit_HighlevelBaseMutable
{
public:
	struct FRigElementKeyCollection               Items;                                             // 0x00D0(0x0010)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FControlRigSpline                      Spline;                                            // 0x00E0(0x0018)(NativeAccessSpecifierPublic)
	EControlRigCurveAlignment                     Alignment;                                         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Minimum;                                           // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Maximum;                                           // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplingPrecision;                                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PrimaryAxis;                                       // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SecondaryAxis;                                     // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PoleVectorPosition;                                // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_FitChainToCurve_Rotation> Rotations;                                      // 0x0130(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	EControlRigAnimEasingType                     RotationEaseType;                                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Weight;                                            // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPropagateToChildren;                              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_FitChainToCurve_DebugSettings DebugSettings;                                     // 0x0150(0x0060)(NoDestructor, NativeAccessSpecifierPublic)
	struct FRigUnit_FitChainToCurve_WorkData      WorkData;                                          // 0x01B0(0x0098)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_248[0x8];                                      // 0x0248(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigUnit_FitChainToSplineCurve;

// ScriptStruct ControlRigSpline.RigUnit_FitSplineCurveToChain
// 0x0030 (0x0100 - 0x00D0)
struct FRigUnit_FitSplineCurveToChain final : public FRigUnit_HighlevelBaseMutable
{
public:
	struct FRigElementKeyCollection               Items;                                             // 0x00D0(0x0010)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FControlRigSpline                      Spline;                                            // 0x00E0(0x0018)(NativeAccessSpecifierPublic)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRigUnit_FitSplineCurveToChain;

// ScriptStruct ControlRigSpline.RigUnit_ClosestParameterFromControlRigSpline
// 0x0028 (0x0030 - 0x0008)
struct FRigUnit_ClosestParameterFromControlRigSpline final : public FRigUnit_ControlRigSplineBase
{
public:
	struct FControlRigSpline                      Spline;                                            // 0x0008(0x0018)(NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         U;                                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRigUnit_ClosestParameterFromControlRigSpline;

}

