#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CraftingUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function CraftingUI.FortCraftingItemInfoWidget.OnItemRaritySet
// 0x0088 (0x0088 - 0x0000)
struct FortCraftingItemInfoWidget_OnItemRaritySet final
{
public:
	EFortRarity                                   Rarity;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    RarityItemData;                                    // 0x0008(0x0080)(ConstParm, Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCraftingItemInfoWidget_OnItemRaritySet;

// Function CraftingUI.AthenaCraftingQuickBarButton.OnCanCraftNowChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaCraftingQuickBarButton_OnCanCraftNowChanged final
{
public:
	bool                                          bCanCraftNow;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaCraftingQuickBarButton_OnCanCraftNowChanged;

// Function CraftingUI.AthenaCraftingQuickBarButton.OnIsCraftableItemChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaCraftingQuickBarButton_OnIsCraftableItemChanged final
{
public:
	bool                                          bIsCraftableItem;                                  // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaCraftingQuickBarButton_OnIsCraftableItemChanged;

// Function CraftingUI.AthenaEquippedItemCraftingIndicator.HandleWeaponEquipped
// 0x0010 (0x0010 - 0x0000)
struct AthenaEquippedItemCraftingIndicator_HandleWeaponEquipped final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            PrevWeapon;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaEquippedItemCraftingIndicator_HandleWeaponEquipped;

// Function CraftingUI.AthenaEquippedItemCraftingIndicator.OnCanCraftNowChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaEquippedItemCraftingIndicator_OnCanCraftNowChanged final
{
public:
	bool                                          bCanCraftNow;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaEquippedItemCraftingIndicator_OnCanCraftNowChanged;

// Function CraftingUI.AthenaEquippedItemCraftingIndicator.OnIsCraftableItemChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaEquippedItemCraftingIndicator_OnIsCraftableItemChanged final
{
public:
	bool                                          bIsCraftableItem;                                  // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaEquippedItemCraftingIndicator_OnIsCraftableItemChanged;

// Function CraftingUI.AthenaInventoryItemInfoCraftingIndicator.HandleInventoryItemSelected
// 0x0008 (0x0008 - 0x0000)
struct AthenaInventoryItemInfoCraftingIndicator_HandleInventoryItemSelected final
{
public:
	class UFortItem*                              SelectedItem;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaInventoryItemInfoCraftingIndicator_HandleInventoryItemSelected;

// Function CraftingUI.AthenaInventoryItemInfoCraftingIndicator.OnCanCraftNowChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaInventoryItemInfoCraftingIndicator_OnCanCraftNowChanged final
{
public:
	bool                                          bCanCraftNow;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaInventoryItemInfoCraftingIndicator_OnCanCraftNowChanged;

// Function CraftingUI.AthenaInventoryItemInfoCraftingIndicator.OnIsCraftableItemChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaInventoryItemInfoCraftingIndicator_OnIsCraftableItemChanged final
{
public:
	bool                                          bIsCraftableItem;                                  // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaInventoryItemInfoCraftingIndicator_OnIsCraftableItemChanged;

// Function CraftingUI.AthenaQuickBarSlotCraftingIndicator.HandleWeaponEquipped
// 0x0010 (0x0010 - 0x0000)
struct AthenaQuickBarSlotCraftingIndicator_HandleWeaponEquipped final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            PrevWeapon;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaQuickBarSlotCraftingIndicator_HandleWeaponEquipped;

// Function CraftingUI.AthenaQuickBarSlotCraftingIndicator.OnCanCraftNowChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaQuickBarSlotCraftingIndicator_OnCanCraftNowChanged final
{
public:
	bool                                          bCanCraftNow;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaQuickBarSlotCraftingIndicator_OnCanCraftNowChanged;

// Function CraftingUI.AthenaQuickBarSlotCraftingIndicator.OnIngredientChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaQuickBarSlotCraftingIndicator_OnIngredientChanged final
{
public:
	bool                                          bCanCraftNow;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaQuickBarSlotCraftingIndicator_OnIngredientChanged;

// Function CraftingUI.AthenaQuickBarSlotCraftingIndicator.OnIsCraftableItemChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaQuickBarSlotCraftingIndicator_OnIsCraftableItemChanged final
{
public:
	bool                                          bIsCraftableItem;                                  // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaQuickBarSlotCraftingIndicator_OnIsCraftableItemChanged;

// Function CraftingUI.FortCraftingIngredientWidget.OnIngredientWidgetUpdated
// 0x000C (0x000C - 0x0000)
struct FortCraftingIngredientWidget_OnIngredientWidgetUpdated final
{
public:
	int32                                         NumAvailable;                                      // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumRequired;                                       // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPrimaryIngredient;                              // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLastIngredient;                                 // 0x0009(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortCraftingIngredientWidget_OnIngredientWidgetUpdated;

// Function CraftingUI.FortCraftingTab.HandleInventoryItemSelected
// 0x0008 (0x0008 - 0x0000)
struct FortCraftingTab_HandleInventoryItemSelected final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCraftingTab_HandleInventoryItemSelected;

// Function CraftingUI.FortCraftingTab.OnFormulaListUpdated
// 0x0004 (0x0004 - 0x0000)
struct FortCraftingTab_OnFormulaListUpdated final
{
public:
	int32                                         NumFormulas;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCraftingTab_OnFormulaListUpdated;

// Function CraftingUI.FortPotContentsPopup.SetOwningCraftingObject
// 0x0008 (0x0008 - 0x0000)
struct FortPotContentsPopup_SetOwningCraftingObject final
{
public:
	class ACraftingObjectBGA*                     InCraftingObject;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPotContentsPopup_SetOwningCraftingObject;

}

