#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrewUI

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "CrewUI_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// Class CrewUI.CrewSeasonLaunchScreen
// 0x00F0 (0x0460 - 0x0370)
class UCrewSeasonLaunchScreen : public UCMSBackgroundWidget
{
public:
	uint8                                         Pad_370[0x38];                                     // 0x0370(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   ResolveIssueModalClass;                            // 0x03A8(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassSeasonHeading*               Heading_SeasonInfo;                                // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Description;                                  // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Claim;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ResolveIssue;                               // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_GiftBattlePass;                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_Disclaimer;                               // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_400[0x60];                                     // 0x0400(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrewSeasonLaunchScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrewSeasonLaunchScreen")
	}
	static class UCrewSeasonLaunchScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewSeasonLaunchScreen>();
	}
};
DUMPER7_ASSERTS_UCrewSeasonLaunchScreen;

// Class CrewUI.BattlePassCrewContentInterface
// 0x0000 (0x0000 - 0x0000)
class IBattlePassCrewContentInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattlePassCrewContentInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattlePassCrewContentInterface")
	}
	static class IBattlePassCrewContentInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IBattlePassCrewContentInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IBattlePassCrewContentInterface;

// Class CrewUI.BattlePassCrewPurchaseButton
// 0x0020 (0x0ED0 - 0x0EB0)
class UBattlePassCrewPurchaseButton : public UCommonButtonBase
{
public:
	EBattlePassPurchaseButtonCurrencyType         CurrencyType;                                      // 0x0EA8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EA9[0x7];                                      // 0x0EA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_Label;                                        // 0x0EB0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_SecondaryLabel;                               // 0x0EB8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_FinalCost;                                    // 0x0EC0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Container_SecondaryLabel;                          // 0x0EC8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnCurrencyUpdated();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattlePassCrewPurchaseButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattlePassCrewPurchaseButton")
	}
	static class UBattlePassCrewPurchaseButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassCrewPurchaseButton>();
	}
};
DUMPER7_ASSERTS_UBattlePassCrewPurchaseButton;

// Class CrewUI.BattlePassCrewPurchaseContainer
// 0x0078 (0x03A8 - 0x0330)
class UBattlePassCrewPurchaseContainer : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_330[0x20];                                     // 0x0330(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CrewUpsellTransitionDelayTime;                     // 0x0350(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_354[0xC];                                      // 0x0354(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidgetSwitcher*       Switcher_ContentContainer;                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassPurchaseScreen*              BattlePassPurchaseScreen;                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                       Intro;                                             // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                       QuickIntro;                                        // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                       CrewBenefitsIntro;                                 // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_388[0x20];                                     // 0x0388(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnContentStateUpdated(EBattlePassCrewContentState InState, bool bInScreenOpened);
	void OnTriggerIntroAnimation(bool bCanClaimRewards);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattlePassCrewPurchaseContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattlePassCrewPurchaseContainer")
	}
	static class UBattlePassCrewPurchaseContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassCrewPurchaseContainer>();
	}
};
DUMPER7_ASSERTS_UBattlePassCrewPurchaseContainer;

// Class CrewUI.BattlePassSeasonHeading
// 0x0008 (0x0278 - 0x0270)
class UBattlePassSeasonHeading : public UCommonUserWidget
{
public:
	class UCommonRichTextBlock*                   Text_Season;                                       // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattlePassSeasonHeading")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattlePassSeasonHeading")
	}
	static class UBattlePassSeasonHeading* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassSeasonHeading>();
	}
};
DUMPER7_ASSERTS_UBattlePassSeasonHeading;

// Class CrewUI.BattlePassPurchaseScreen
// 0x0100 (0x0470 - 0x0370)
class UBattlePassPurchaseScreen : public UCMSBackgroundWidget
{
public:
	uint8                                         Pad_370[0xA0];                                     // 0x0370(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonActivatableWidget>   PurchaseCompleteModal;                             // 0x0410(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ToCrew;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassCrewPurchaseButton*          Button_Purchase;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_MoreInfo;                                   // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_GiftBattlePass;                             // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassCrewPurchaseButton*          Button_ConfirmBase;                                // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassCrewPurchaseButton*          Button_ConfirmBundle;                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassSeasonHeading*               Heading_Primary;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassSeasonHeading*               Heading_Secondary;                                 // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_Disclaimer;                               // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Description;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonAnimatedSwitcher*                Switcher_PurchaseState;                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnPurchaseConfirmed();
	void OnPurchaseStateChanged(EBattlePassPurchaseState InCurrentState);
	void OnSetScreenInteractable(bool bInteractable);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattlePassPurchaseScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattlePassPurchaseScreen")
	}
	static class UBattlePassPurchaseScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassPurchaseScreen>();
	}
};
DUMPER7_ASSERTS_UBattlePassPurchaseScreen;

// Class CrewUI.CrewPurchaseScreen
// 0x01B0 (0x0520 - 0x0370)
class UCrewPurchaseScreen : public UCMSBackgroundWidget
{
public:
	uint8                                         Pad_370[0x88];                                     // 0x0370(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bManagementModeEnabled;                            // 0x03F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                FocusWidget;                                       // 0x0400(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroupBase*                 ButtonGroup_BenefitsTiles;                         // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   CancellationInfoModalClass;                        // 0x0410(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   LegalInfoModalClass;                               // 0x0438(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   ResolveIssueModalClass;                            // 0x0460(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   RejoinModalClass;                                  // 0x0488(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ToBattlePass;                               // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassCrewPurchaseButton*          Button_Purchase;                                   // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassCrewPurchaseButton*          Button_Rejoin;                                     // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_ResolvePayment;                             // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_WatchTrailer;                               // 0x04D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Terms;                                      // 0x04D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_CancellationInfo;                           // 0x04E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_RecurringRewards;                         // 0x04E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_LimitedTimeRewards;                       // 0x04F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCrewTileDetails*                       Details_CurrentCrewTile;                           // 0x04F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_LimitedTime;                                  // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_UserInformation;                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_UserInformation;                              // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_CrewDisclaimer;                               // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BeginProgress(const class FText& ProgressLabel);
	void EndProgress();
	void OnContainerTabVisibilityUpdated(const bool bTabsVisible, const float SpacingAdjustmentForTabs);
	void OnUpdatePurchaseButtonState(ECrewPurchaseButtonState ButtonState);
	void OnUpdateVBuckRefundVisibility(bool bVisible);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrewPurchaseScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrewPurchaseScreen")
	}
	static class UCrewPurchaseScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewPurchaseScreen>();
	}
};
DUMPER7_ASSERTS_UCrewPurchaseScreen;

// Class CrewUI.CrewRewardTile
// 0x0060 (0x0F10 - 0x0EB0)
class UCrewRewardTile : public UCommonButtonBase
{
public:
	uint8                                         Pad_EA8[0x40];                                     // 0x0EA8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TileImageStreamoutSeconds;                         // 0x0EE8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_EEC[0xC];                                      // 0x0EEC(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 Image_TileImage;                                   // 0x0EF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_TileLabel;                                    // 0x0F00(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F08[0x8];                                      // 0x0F08(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDownloadTileImageComplete(class UTexture2D* Texture);
	void OnStartingDownloadTileImage();
	void OnUpdateOwnedState(bool bOwned);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrewRewardTile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrewRewardTile")
	}
	static class UCrewRewardTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewRewardTile>();
	}
};
DUMPER7_ASSERTS_UCrewRewardTile;

// Class CrewUI.CrewTileDetails
// 0x0048 (0x02B8 - 0x0270)
class UCrewTileDetails : public UCommonUserWidget
{
public:
	uint8                                         Pad_270[0x28];                                     // 0x0270(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_Title;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_Description;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_Tags;                                     // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_MobileMoreInfo;                             // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrewTileDetails")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrewTileDetails")
	}
	static class UCrewTileDetails* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewTileDetails>();
	}
};
DUMPER7_ASSERTS_UCrewTileDetails;

// Class CrewUI.CrewTileDetailsTag
// 0x0008 (0x0278 - 0x0270)
class UCrewTileDetailsTag : public UCommonUserWidget
{
public:
	class UCommonRichTextBlock*                   Text_Label;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnTagSetup(ECrewDetailsTag RewardTag, bool bIsOwnedTag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrewTileDetailsTag")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrewTileDetailsTag")
	}
	static class UCrewTileDetailsTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewTileDetailsTag>();
	}
};
DUMPER7_ASSERTS_UCrewTileDetailsTag;

// Class CrewUI.CrewUIGameFeatureAction
// 0x0050 (0x0078 - 0x0028)
class UCrewUIGameFeatureAction final : public UFortUIGameFeatureAction
{
public:
	TSoftClassPtr<class UClass>                   BattlePassCrewContainerClass;                      // 0x0028(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   CrewContentContainerClass;                         // 0x0050(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrewUIGameFeatureAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrewUIGameFeatureAction")
	}
	static class UCrewUIGameFeatureAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrewUIGameFeatureAction>();
	}
};
DUMPER7_ASSERTS_UCrewUIGameFeatureAction;

}

