#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrewUI

#include "Basic.hpp"

#include "CrewUI_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function CrewUI.BattlePassCrewPurchaseContainer.OnContentStateUpdated
// 0x0002 (0x0002 - 0x0000)
struct BattlePassCrewPurchaseContainer_OnContentStateUpdated final
{
public:
	EBattlePassCrewContentState                   InState;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInScreenOpened;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BattlePassCrewPurchaseContainer_OnContentStateUpdated;

// Function CrewUI.BattlePassCrewPurchaseContainer.OnTriggerIntroAnimation
// 0x0001 (0x0001 - 0x0000)
struct BattlePassCrewPurchaseContainer_OnTriggerIntroAnimation final
{
public:
	bool                                          bCanClaimRewards;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BattlePassCrewPurchaseContainer_OnTriggerIntroAnimation;

// Function CrewUI.BattlePassPurchaseScreen.OnPurchaseStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BattlePassPurchaseScreen_OnPurchaseStateChanged final
{
public:
	EBattlePassPurchaseState                      InCurrentState;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BattlePassPurchaseScreen_OnPurchaseStateChanged;

// Function CrewUI.BattlePassPurchaseScreen.OnSetScreenInteractable
// 0x0001 (0x0001 - 0x0000)
struct BattlePassPurchaseScreen_OnSetScreenInteractable final
{
public:
	bool                                          bInteractable;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BattlePassPurchaseScreen_OnSetScreenInteractable;

// Function CrewUI.CrewPurchaseScreen.BeginProgress
// 0x0018 (0x0018 - 0x0000)
struct CrewPurchaseScreen_BeginProgress final
{
public:
	class FText                                   ProgressLabel;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrewPurchaseScreen_BeginProgress;

// Function CrewUI.CrewPurchaseScreen.OnContainerTabVisibilityUpdated
// 0x0008 (0x0008 - 0x0000)
struct CrewPurchaseScreen_OnContainerTabVisibilityUpdated final
{
public:
	bool                                          bTabsVisible;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpacingAdjustmentForTabs;                          // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrewPurchaseScreen_OnContainerTabVisibilityUpdated;

// Function CrewUI.CrewPurchaseScreen.OnUpdatePurchaseButtonState
// 0x0001 (0x0001 - 0x0000)
struct CrewPurchaseScreen_OnUpdatePurchaseButtonState final
{
public:
	ECrewPurchaseButtonState                      ButtonState;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrewPurchaseScreen_OnUpdatePurchaseButtonState;

// Function CrewUI.CrewPurchaseScreen.OnUpdateVBuckRefundVisibility
// 0x0001 (0x0001 - 0x0000)
struct CrewPurchaseScreen_OnUpdateVBuckRefundVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrewPurchaseScreen_OnUpdateVBuckRefundVisibility;

// Function CrewUI.CrewRewardTile.OnDownloadTileImageComplete
// 0x0008 (0x0008 - 0x0000)
struct CrewRewardTile_OnDownloadTileImageComplete final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrewRewardTile_OnDownloadTileImageComplete;

// Function CrewUI.CrewRewardTile.OnUpdateOwnedState
// 0x0001 (0x0001 - 0x0000)
struct CrewRewardTile_OnUpdateOwnedState final
{
public:
	bool                                          bOwned;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrewRewardTile_OnUpdateOwnedState;

// Function CrewUI.CrewTileDetailsTag.OnTagSetup
// 0x0002 (0x0002 - 0x0000)
struct CrewTileDetailsTag_OnTagSetup final
{
public:
	ECrewDetailsTag                               RewardTag;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOwnedTag;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrewTileDetailsTag_OnTagSetup;

}

