#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function DynamicUI.DynamicUIManager.AddScene
// 0x0010 (0x0010 - 0x0000)
struct DynamicUIManager_AddScene final
{
public:
	const class UDynamicUIScene*                  Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DynamicUIManager_AddScene;

// Function DynamicUI.DynamicUIManager.AddScenes
// 0x0018 (0x0018 - 0x0000)
struct DynamicUIManager_AddScenes final
{
public:
	TArray<class UDynamicUIScene*>                Scenes;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DynamicUIManager_AddScenes;

// Function DynamicUI.DynamicUIManager.RemoveScene
// 0x0010 (0x0010 - 0x0000)
struct DynamicUIManager_RemoveScene final
{
public:
	const class UDynamicUIScene*                  Scene;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DynamicUIManager_RemoveScene;

// Function DynamicUI.DynamicUIManager.RemoveScenes
// 0x0018 (0x0018 - 0x0000)
struct DynamicUIManager_RemoveScenes final
{
public:
	TArray<class UDynamicUIScene*>                Scenes;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	const class UObject*                          OptionalContext;                                   // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DynamicUIManager_RemoveScenes;

}

