#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortActivatableMovieWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortActivatableMovieWidget.FortActivatableMovieWidget_C
// 0x0028 (0x05D8 - 0x05B0)
class UFortActivatableMovieWidget_C final : public UFortActivatableMovieWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WhiteFade;                                         // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USafeZone*                              MainSafeZone;                                      // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x05D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_FortActivatableMovieWidget(int32 EntryPoint);
	void StartFadeFromWhite();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("FortActivatableMovieWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivatableMovieWidget_C")
	}
	static class UFortActivatableMovieWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivatableMovieWidget_C>();
	}
};
DUMPER7_ASSERTS_UFortActivatableMovieWidget_C;

}

