#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortCheckbox

#include "Basic.hpp"


namespace SDK::Params
{

// Function FortCheckbox.FortCheckbox_C.ExecuteUbergraph_FortCheckbox
// 0x0004 (0x0004 - 0x0000)
struct FortCheckbox_C_ExecuteUbergraph_FortCheckbox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FortCheckbox_C_ExecuteUbergraph_FortCheckbox;

// Function FortCheckbox.FortCheckbox_C.Refresh
// 0x0010 (0x0010 - 0x0000)
struct FortCheckbox_C_Refresh final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FortCheckbox_C_Refresh;

// Function FortCheckbox.FortCheckbox_C.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct FortCheckbox_C_SetSelected final
{
public:
	bool                                          NewSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FortCheckbox_C_SetSelected;

// Function FortCheckbox.FortCheckbox_C.ToggleCheckbox
// 0x0001 (0x0001 - 0x0000)
struct FortCheckbox_C_ToggleCheckbox final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FortCheckbox_C_ToggleCheckbox;

}

