#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "OnlineSubsystemMcp_structs.hpp"
#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "HermesPlaysetsUI_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonUILegacy_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "GameFeatures_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CommonInput_structs.hpp"
#include "CommonInput_classes.hpp"
#include "BlueprintContext_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "Hotfix_structs.hpp"
#include "SocialUMG_structs.hpp"
#include "SocialUMG_classes.hpp"
#include "InputCore_structs.hpp"
#include "McpProfileSys_structs.hpp"
#include "Party_structs.hpp"
#include "Slate_structs.hpp"
#include "AudioMixer_structs.hpp"
#include "LauncherSocialTypes_structs.hpp"


namespace SDK
{

// Class FortniteUI.AthenaFullScreenMapBase
// 0x0048 (0x04B0 - 0x0468)
class UAthenaFullScreenMapBase : public UCommonActivatablePanelLegacy
{
public:
	class UAthenaMapLayerContainer*               MapLayerContainer;                                 // 0x0468(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    ToggleMapMarkerRowHandle;                          // 0x0470(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UFortMarkerDetailsTable> SoftMarkerDetailsTable;                            // 0x0480(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bMapLayerContainerEnabled;                         // 0x04A8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ShowMapLayerContainer(const bool bShowing);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaFullScreenMapBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaFullScreenMapBase")
	}
	static class UAthenaFullScreenMapBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaFullScreenMapBase>();
	}
};
DUMPER7_ASSERTS_UAthenaFullScreenMapBase;

// Class FortniteUI.FortHUDElementWidget
// 0x0040 (0x02B0 - 0x0270)
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	uint8                                         Pad_270[0x8];                                      // 0x0270(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ElementTag;                                        // 0x0278(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  HUDElementTag;                                     // 0x0280(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	ESlateVisibility                              HiddenVisibility;                                  // 0x02A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTutorialHighlight*                     TutorialHighlight;                                 // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void AppendHUDElementTags(const struct FGameplayTagContainer& AdditionalTags);
	void HandleOnHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenHUDElementTags);
	void OnVisibilitySetEvent(ESlateVisibility InVisibility);

	bool HasAnyTags(const struct FGameplayTagContainer& InTags) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortHUDElementWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortHUDElementWidget")
	}
	static class UFortHUDElementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHUDElementWidget>();
	}
};
DUMPER7_ASSERTS_UFortHUDElementWidget;

// Class FortniteUI.FortActorIndicatorWidget
// 0x0038 (0x02E8 - 0x02B0)
class UFortActorIndicatorWidget : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_2B0[0x8];                                      // 0x02B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 IndicatedActor;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                    IndicatedActorComponent;                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                RelativeLocation;                                  // 0x02C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxDistance;                                       // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bClampOnScreen;                                    // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowClampToScreenArrow;                           // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseScreenSpacePosition;                           // 0x02DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2DB[0x1];                                      // 0x02DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ScreenSpaceRelativeOffset;                         // 0x02DC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ScreenPriority;                                    // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetIndicatedActor(class AActor* NewIndicatorActor);

	bool IsIndicatingActor(const class AActor* OtherActor) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActorIndicatorWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActorIndicatorWidget")
	}
	static class UFortActorIndicatorWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActorIndicatorWidget>();
	}
};
DUMPER7_ASSERTS_UFortActorIndicatorWidget;

// Class FortniteUI.FortBuildingInfoIndicatorWidget
// 0x0000 (0x02E8 - 0x02E8)
class UFortBuildingInfoIndicatorWidget final : public UFortActorIndicatorWidget
{
public:
	void SetKeyBindWidgetBoundAction(class UFortKeybindWidget* FortKeybindWidget, const class FName ActionName, const EFortBuildingInteraction InteractionType);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBuildingInfoIndicatorWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBuildingInfoIndicatorWidget")
	}
	static class UFortBuildingInfoIndicatorWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBuildingInfoIndicatorWidget>();
	}
};
DUMPER7_ASSERTS_UFortBuildingInfoIndicatorWidget;

// Class FortniteUI.FortVariantEditorWidgetBase
// 0x0080 (0x02F0 - 0x0270)
class UFortVariantEditorWidgetBase : public UCommonUserWidget
{
public:
	class UWidget*                                LogicalOuter;                                      // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_278[0x78];                                     // 0x0278(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortVariantEditorWidgetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortVariantEditorWidgetBase")
	}
	static class UFortVariantEditorWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVariantEditorWidgetBase>();
	}
};
DUMPER7_ASSERTS_UFortVariantEditorWidgetBase;

// Class FortniteUI.FortVariantTileSelector
// 0x0018 (0x0308 - 0x02F0)
class UFortVariantTileSelector : public UFortVariantEditorWidgetBase
{
public:
	class UCommonTileView*                        TileView_VariantOptions;                           // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_VariantName;                                  // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVariantObject*                         CurrentSelectedVariant;                            // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortVariantTileSelector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortVariantTileSelector")
	}
	static class UFortVariantTileSelector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVariantTileSelector>();
	}
};
DUMPER7_ASSERTS_UFortVariantTileSelector;

// Class FortniteUI.FortRadialSlot
// 0x0050 (0x0F50 - 0x0F00)
#pragma pack(push, 0x1)
class alignas(0x10) UFortRadialSlot : public UCommonButtonLegacy
{
public:
	uint8                                         Pad_EF8[0x10];                                     // 0x0EF8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonLazyImage*                       Image_Icon;                                        // 0x0F08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_Main;                                         // 0x0F10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                Overlay_EquippedItem;                              // 0x0F18(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UTexture2D>              LockedTexture;                                     // 0x0F20(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortRadialSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortRadialSlot")
	}
	static class UFortRadialSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortRadialSlot>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UFortRadialSlot;

// Class FortniteUI.FortRadialPickerEntry
// 0x0000 (0x0F50 - 0x0F50)
class UFortRadialPickerEntry : public UFortRadialSlot
{
public:
	void OnAvailabilityChanged(bool bIsAvailable);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortRadialPickerEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortRadialPickerEntry")
	}
	static class UFortRadialPickerEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortRadialPickerEntry>();
	}
};
DUMPER7_ASSERTS_UFortRadialPickerEntry;

// Class FortniteUI.AthenaBattlePassTracker
// 0x0100 (0x0370 - 0x0270)
class UAthenaBattlePassTracker final : public UCommonUserWidget
{
public:
	uint8                                         Pad_270[0x8];                                      // 0x0270(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAthenaPassPurchaseScreen>  PassPurchaseScreenClass;                           // 0x0278(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   OutfitsText;                                       // 0x0280(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   VBucksText;                                        // 0x0298(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   EmotesText;                                        // 0x02B0(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   MoreRewardsText;                                   // 0x02C8(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   BuyBattlePassTextFormat;                           // 0x02E0(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F8[0x40];                                     // 0x02F8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaPassPurchaseScreen*              PushedPurchaseScreen;                              // 0x0338(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_PaidItemsCollected;                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaBattlePassItemTracker*           BattlePassItemTracker_01;                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaBattlePassItemTracker*           BattlePassItemTracker_02;                          // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaBattlePassItemTracker*           BattlePassItemTracker_03;                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaBattlePassItemTracker*           BattlePassItemTracker_04;                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassScreenPurchaseButton*        Button_PurchaseBattlePass;                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandlePassPurchaseFlowComplete(bool bClosePresentationScreen);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaBattlePassTracker")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaBattlePassTracker")
	}
	static class UAthenaBattlePassTracker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBattlePassTracker>();
	}
};
DUMPER7_ASSERTS_UAthenaBattlePassTracker;

// Class FortniteUI.DonutChallengeEntryHeader
// 0x0010 (0x0F10 - 0x0F00)
class UDonutChallengeEntryHeader final : public UCommonButtonLegacy
{
public:
	class UCommonTextBlock*                       Text_Title;                                        // 0x0EF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeCountdownDisplay*       Timer_UnlockTimer;                                 // 0x0F00(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F08[0x8];                                      // 0x0F08(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BPUpdateTitle(int32 InWeek);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DonutChallengeEntryHeader")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DonutChallengeEntryHeader")
	}
	static class UDonutChallengeEntryHeader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDonutChallengeEntryHeader>();
	}
};
DUMPER7_ASSERTS_UDonutChallengeEntryHeader;

// Class FortniteUI.FortItemQuantityListBase
// 0x0090 (0x0300 - 0x0270)
class UFortItemQuantityListBase final : public UCommonUserWidget
{
public:
	EFortItemInspectionMode                       CurrentInspectMode;                                // 0x0270(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bListenToInventoryChanges;                         // 0x0271(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_272[0x6];                                      // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortItemQuantityListEntryBase> ListEntryWidgetType;                           // 0x0278(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_280[0x50];                                     // 0x0280(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        ItemObjectsToKeepAlive;                            // 0x02D0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E0[0x10];                                     // 0x02E0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortItemDefinition*>            FortItemDefinitions;                               // 0x02F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void AddListEntry(class UFortItemQuantityListEntryBase* ListEntry);
	TArray<class UFortItemDefinition*> GetItemDefinitions();
	void OnItemInspectModeChanged();
	void SetItemDefinitionsAndQuantities(const TArray<struct FFortItemQuantityPair>& ItemQuantityPairs, const bool ShouldResetWidgets);
	void SetItemInspectMode(EFortItemInspectionMode InspectMode);
	void SetItemInstancesAndQuantities(const TArray<struct FFortItemInstanceQuantityPair>& ItemQuantityPairs, const bool ShouldResetWidgets);
	void SetItemToCompareDefinitionsAndQuantities(const TArray<struct FFortItemQuantityPair>& ItemToCompareQuantityPairs);

	bool IsEmptyList() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortItemQuantityListBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortItemQuantityListBase")
	}
	static class UFortItemQuantityListBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemQuantityListBase>();
	}
};
DUMPER7_ASSERTS_UFortItemQuantityListBase;

// Class FortniteUI.AthenaSpatialScreen
// 0x0098 (0x03C8 - 0x0330)
class UAthenaSpatialScreen : public UCommonActivatableWidget
{
public:
	bool                                          bEnableSpatialInputPreprocessing;                  // 0x0330(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableAnalytics;                                  // 0x0331(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_332[0x2];                                      // 0x0332(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           OverrideScreenTag;                                 // 0x0334(0x0008)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonLegacy*                    Button_Back;                                       // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ScreenTag;                                         // 0x0348(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_CloseMobile;                                // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bNeedsBottomBar;                                   // 0x0358(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_359[0x6F];                                     // 0x0359(0x006F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddSpatialScreenSessionCounter(const class FString& Entry, int32 Count);
	void FireSpatialScreenAnalytic(const class FString& Interaction);
	void OnInputSuspensionChanged();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaSpatialScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaSpatialScreen")
	}
	static class UAthenaSpatialScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSpatialScreen>();
	}
};
DUMPER7_ASSERTS_UAthenaSpatialScreen;

// Class FortniteUI.AthenaSpatialItemPreviewScreen
// 0x0048 (0x0410 - 0x03C8)
class UAthenaSpatialItemPreviewScreen : public UAthenaSpatialScreen
{
public:
	class UFortItemView*                          ItemViewObject;                                    // 0x03C8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ItemPreviewActorTag;                               // 0x03D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D8[0x10];                                     // 0x03D8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    ItemPreviewRotateInputAction;                      // 0x03E8(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bEnableItemPreviewRotation;                        // 0x03F8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimationAsset*                        IdleAnimation;                                     // 0x0400(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLooping;                                          // 0x0408(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaSpatialItemPreviewScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaSpatialItemPreviewScreen")
	}
	static class UAthenaSpatialItemPreviewScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSpatialItemPreviewScreen>();
	}
};
DUMPER7_ASSERTS_UAthenaSpatialItemPreviewScreen;

// Class FortniteUI.AthenaSpatialCustomizationRoom
// 0x0058 (0x0468 - 0x0410)
class UAthenaSpatialCustomizationRoom final : public UAthenaSpatialItemPreviewScreen
{
public:
	class UAthenaSpatialCustomizationCategories*  Categories;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSpatialCustomizationSelection*   Selection;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_About;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSpatialCustomizationRoomData*    CustomizationRoomData;                             // 0x0428(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortGameStateComponent_EventLevel*     EventGameStateComponent;                           // 0x0430(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FMcpVariantChannelInfo>         CurrentVariantChannelStates;                       // 0x0438(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class UAthenaSpatialCustomizationSubscreenBase*> SubScreens;                              // 0x0448(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	ESpatialCustomizationRoomState                RoomState;                                         // 0x0458(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DelayedApplyColorHandle;                           // 0x0460(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnRoomStateChanged(ESpatialCustomizationRoomState CurrentRoomState, ESpatialCustomizationRoomState PreviousRoomState);
	void OnShowFirstTimeInfo();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaSpatialCustomizationRoom")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaSpatialCustomizationRoom")
	}
	static class UAthenaSpatialCustomizationRoom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSpatialCustomizationRoom>();
	}
};
DUMPER7_ASSERTS_UAthenaSpatialCustomizationRoom;

// Class FortniteUI.FortActivatablePanel
// 0x0038 (0x04A0 - 0x0468)
class UFortActivatablePanel : public UCommonActivatablePanelLegacy
{
public:
	uint8                                         Pad_468[0x8];                                      // 0x0468(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsPushedOnToContentPanelStack;                    // 0x0470(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAlreadyOnContentPanelStack;                     // 0x0471(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputPriority                                InputPriority;                                     // 0x0472(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsClosableByPlayerInput;                          // 0x0473(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPrimaryContentSetup                   PrimaryContentSetup;                               // 0x0474(0x0001)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_475[0x2B];                                     // 0x0475(0x002B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AsyncPlaySound2D(const class UObject* WorldContextObject, TSoftObjectPtr<class USoundBase> SoundToLoad, float VolumeMultiplier, float PitchMultiplier, float StartTime);
	void RestoreCenterWidget(class UWidget* FallbackWidget);
	void RestoreScrollWidget(class UWidget* FallbackWidget);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivatablePanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivatablePanel")
	}
	static class UFortActivatablePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivatablePanel>();
	}
};
DUMPER7_ASSERTS_UFortActivatablePanel;

// Class FortniteUI.AthenaGameOverDisplay
// 0x00E0 (0x0580 - 0x04A0)
class UAthenaGameOverDisplay final : public UFortActivatablePanel
{
public:
	TSubclassOf<class UFortMatchStatsScreen>      MatchStatsClass;                                   // 0x04A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A8[0x20];                                     // 0x04A8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    Input_ReturnToLobby;                               // 0x04C8(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    Input_NextTeammate;                                // 0x04D8(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    Input_PreviousTeammate;                            // 0x04E8(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    Input_NextPlayer;                                  // 0x04F8(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    Input_PreviousPlayer;                              // 0x0508(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    Input_ReportPlayer;                                // 0x0518(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    Input_ToggleBattleMap;                             // 0x0528(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    Input_ForceStartPostGame;                          // 0x0538(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UEliminatedOverlay*                     EliminatedOverlay;                                 // 0x0548(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonLegacy*                    Button_Highlights;                                 // 0x0550(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bAllowSpectateAllPlayers;                          // 0x0558(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void HandleToggledBattleMapLive(class ABattleMapPawnLive* NewSpectatorPawn);
	void HighlightCountChanged(int32 HighlightCount);
	void InGameMatchmakingComplete(bool bSuccess);
	void OnKillFeedUpdated();
	void OnPawnDied(const struct FFortPlayerDeathReport& DeathReport);
	void OnPlaceChanged();
	void OnPlayerLost(EEndOfMatchReason LostReason);
	void OnPlayerOrTeamWon();
	void OnRessurectingNowDelegate(bool bRessurectingNow);
	void OnSpecialActorListChanged();
	void OnSpectatorStreamingChanged(bool bSpectatorStreaming);
	void OnToggleFullscreenMap(bool bFullscreenMapVisible);
	void OnViewTargetChanged();
	void OnWinnerAnnounced(const class FString& Winner);
	void OnWinningScoreDetermined(int32 Score);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaGameOverDisplay")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaGameOverDisplay")
	}
	static class UAthenaGameOverDisplay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGameOverDisplay>();
	}
};
DUMPER7_ASSERTS_UAthenaGameOverDisplay;

// Class FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase
// 0x0010 (0x02C0 - 0x02B0)
class UAthenaBroadcastHUDMenuStatusLayerBase final : public UFortHUDElementWidget
{
public:
	TSubclassOf<class UAthenaBroadcastHUDMenuStatusBase> HUDMenuStatusWidgetClass;                   // 0x02B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddHUDMenuStatus(class UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget);
	void DeactivateHudMenuWidget();
	void RemoveHUDMenuStatus(class UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaBroadcastHUDMenuStatusLayerBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaBroadcastHUDMenuStatusLayerBase")
	}
	static class UAthenaBroadcastHUDMenuStatusLayerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBroadcastHUDMenuStatusLayerBase>();
	}
};
DUMPER7_ASSERTS_UAthenaBroadcastHUDMenuStatusLayerBase;

// Class FortniteUI.FortAthenaVehicleDashboardWidget
// 0x0090 (0x0340 - 0x02B0)
class UFortAthenaVehicleDashboardWidget : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_2B0[0xC];                                      // 0x02B0(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsWidgetShowing;                                  // 0x02BC(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     CurrentVehicleActor;                               // 0x02C0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrentSpeed;                                      // 0x02C8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TargetFuelPercent;                                 // 0x02CC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DisplayedFuelPercent;                              // 0x02D0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FillBlendSpeed;                                    // 0x02D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SpeedTextMaxInterpolationRate;                     // 0x02D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  WidgetTagsToHideWhenVisible;                       // 0x02E0(0x0020)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_300[0x4];                                      // 0x0300(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HUDTopSpeed;                                       // 0x0304(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EHorizontalAlignment                          MobileFuelGaugeHorizontalAlignment;                // 0x0308(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EVerticalAlignment                            MobileFuelGaugeVerticalAlignment;                  // 0x0309(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30A[0x2];                                      // 0x030A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                MobileFuelGaugePadding;                            // 0x030C(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonNumericTextBlock*                NumericText_Speed;                                 // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_Gauge;                                     // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ItemName;                                     // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAddedFuel(float NewFuelPercent);
	void OnBoostChargeFilled();
	void OnBoostFinished();
	void OnBoostStarted();
	void OnFuelValueChanged(float FuelPercentage, bool bIsLowOnFuel);
	void OnLowFuel();
	void OnOutOfFuel();
	void OnPlayerFacingNameUpdated();
	void OnRechargableBoostFilled();
	void OnRPMChanged(float NormalizedRPM);
	void OnUpdateBoostChargePercent(float BoostPercent);
	void OnUpdateRechargeableBoostPercent(float BoostPercent);
	void OnWidgetVisibilityChanged(bool bNewVisibility);
	void SetupVehicleFuelWidget(class AActor* NewVehicle, const bool bRequestShowWidget);
	void SetVehicleHasInfiniteFuel(bool bInfiniteFuel);
	void SetVehicleUsesRechargableBoost(bool bUsesRechargeableBoost);
	void ShowNoFuelMessage();
	void UpdateSpeedometer(float NormalizedSpeed);

	float GetHUDTopSpeed() const;
	class AFortAthenaVehicle* GetVehicle() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaVehicleDashboardWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaVehicleDashboardWidget")
	}
	static class UFortAthenaVehicleDashboardWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaVehicleDashboardWidget>();
	}
};
DUMPER7_ASSERTS_UFortAthenaVehicleDashboardWidget;

// Class FortniteUI.FortAthenaVehicleDashboardWidget_Ferret
// 0x0000 (0x0340 - 0x0340)
class UFortAthenaVehicleDashboardWidget_Ferret final : public UFortAthenaVehicleDashboardWidget
{
public:
	class AFortAthenaFerretVehicle* GetFerretVehicle() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaVehicleDashboardWidget_Ferret")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaVehicleDashboardWidget_Ferret")
	}
	static class UFortAthenaVehicleDashboardWidget_Ferret* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaVehicleDashboardWidget_Ferret>();
	}
};
DUMPER7_ASSERTS_UFortAthenaVehicleDashboardWidget_Ferret;

// Class FortniteUI.AthenaIGMPartyMemberWidget
// 0x0098 (0x0308 - 0x0270)
class UAthenaIGMPartyMemberWidget : public UCommonUserWidget
{
public:
	uint8                                         Pad_270[0x70];                                     // 0x0270(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsLocalPlayerSlot;                                // 0x02E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsInGameSlot;                                     // 0x02E1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSocialAvatarIcon*                  AvatarIconWidget;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USocialNameTextBlock*                   Text_SocialName;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortVoiceChatStatusIcon*               VoiceIcon_Status;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortPartyMember*                       CachedPartyMember;                                 // 0x0300(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_HandleExtensionWidgetCreated(class UUserWidget* Widget, EUIExtensionSlot SlotType);
	void OnIsPartyLeaderChanged(bool bIsPartyLeader);
	void OnNewLocation(EFortPartyMemberLocation NewLocation);
	void OnNewReadiness(EGameReadiness GameReadiness);
	void OnUserSet();
	void OnWidgetReset();

	bool GetIsInGameSlot() const;
	bool GetIsLocalPlayerSlot() const;
	bool IsEmptySlot() const;
	bool IsPlayingFortnite() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaIGMPartyMemberWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaIGMPartyMemberWidget")
	}
	static class UAthenaIGMPartyMemberWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaIGMPartyMemberWidget>();
	}
};
DUMPER7_ASSERTS_UAthenaIGMPartyMemberWidget;

// Class FortniteUI.FortGlobalSeasonResourceWidget
// 0x0000 (0x0270 - 0x0270)
class UFortGlobalSeasonResourceWidget : public UCommonUserWidget
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortGlobalSeasonResourceWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortGlobalSeasonResourceWidget")
	}
	static class UFortGlobalSeasonResourceWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGlobalSeasonResourceWidget>();
	}
};
DUMPER7_ASSERTS_UFortGlobalSeasonResourceWidget;

// Class FortniteUI.DeimosSurvivalWidgetBase
// 0x0068 (0x0318 - 0x02B0)
class UDeimosSurvivalWidgetBase final : public UFortHUDElementWidget
{
public:
	TArray<struct FSurvivalObjectiveText>         SurvivalStateDefaultText;                          // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           ObjectiveTag;                                      // 0x02C0(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C8[0x50];                                     // 0x02C8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnUpdateObjectiveIcon(const struct FSurvivalObjectiveIconData& ObjectiveIconData);
	void OnUpdateStateText(const class FText& StateText);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DeimosSurvivalWidgetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DeimosSurvivalWidgetBase")
	}
	static class UDeimosSurvivalWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeimosSurvivalWidgetBase>();
	}
};
DUMPER7_ASSERTS_UDeimosSurvivalWidgetBase;

// Class FortniteUI.AthenaBroadcastFollowedPlayerInfoBase
// 0x0028 (0x02D8 - 0x02B0)
class UAthenaBroadcastFollowedPlayerInfoBase final : public UFortHUDElementWidget
{
public:
	class UAthenaSpectatorPlayerWidgetBase*       PlayerWidget;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSpectatorHitPointBarBase*        HitPointBar_Health;                                // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSpectatorHitPointBarBase*        HitPointBar_Shield;                                // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSpectatorHitPointBarBase*        HitPointBar_Vehicle;                               // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D0[0x8];                                      // 0x02D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEliminatedStateChanged(class UAthenaRemotePlayerViewData* PlayerData, bool bIsEliminated);
	void OnFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatingPC, class AFortPlayerState* FollowedPlayerState);
	void OnPipModeChanged(bool bPipModeEnabled);
	void OnVehicleStateChanged(class AActor* NewVehicle, class AActor* OldVehicle);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaBroadcastFollowedPlayerInfoBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaBroadcastFollowedPlayerInfoBase")
	}
	static class UAthenaBroadcastFollowedPlayerInfoBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBroadcastFollowedPlayerInfoBase>();
	}
};
DUMPER7_ASSERTS_UAthenaBroadcastFollowedPlayerInfoBase;

// Class FortniteUI.FortMtxOfferData
// 0x0490 (0x04C0 - 0x0030)
class UFortMtxOfferData final : public UPrimaryDataAsset
{
public:
	class FText                                   DisplayName;                                       // 0x0030(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   ShortDisplayName;                                  // 0x0048(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   ShortDescription;                                  // 0x0060(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   SubTitleText;                                      // 0x0078(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   DisclaimerText;                                    // 0x0090(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FFortItemQuantityPair>          GrantOverride;                                     // 0x00A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            TileImage;                                         // 0x00C0(0x00B0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BadgeImage;                                        // 0x0170(0x00B0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateBrush                            DetailsImage;                                      // 0x0220(0x00B0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SimpleImage;                                       // 0x02D0(0x00B0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     DetailsBadge;                                      // 0x0380(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortMtxDetailsAttribute>       DetailsAttributes;                                 // 0x0388(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FFortMtxGradient                       Gradient;                                          // 0x0398(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           Background;                                        // 0x03B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C8[0x8];                                      // 0x03C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            BackgroundImage;                                   // 0x03D0(0x00B0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FLinearColor                           UpsellPrimaryColor;                                // 0x0480(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           UpsellSecondaryColor;                              // 0x0490(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           UpsellTextColor;                                   // 0x04A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseBaseColors;                                    // 0x04B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMtxOfferDisplaySize                      DisplaySize;                                       // 0x04B1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B2[0xE];                                      // 0x04B2(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMtxOfferData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMtxOfferData")
	}
	static class UFortMtxOfferData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMtxOfferData>();
	}
};
DUMPER7_ASSERTS_UFortMtxOfferData;

// Class FortniteUI.DonutChallengeScreen
// 0x0098 (0x0460 - 0x03C8)
class UDonutChallengeScreen final : public UAthenaSpatialScreen
{
public:
	uint8                                         Pad_3C8[0x18];                                     // 0x03C8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameStateComponent_EventLevel*     EventGameStateComponent;                           // 0x03E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSeasonItemDefinition*            SeasonData;                                        // 0x03E8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   CustomMouseCursorWidget;                           // 0x03F0(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UDonutChallengeEntryHeader> HeaderEntryClass;                                  // 0x0418(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UDonutChallengeEntry>       EntryClass;                                        // 0x0420(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortChallengeBundleItemDefinition*> DonutBundles;                                  // 0x0428(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class UFortChallengeBundleItemDefinition*     SkinUnlockBundle;                                  // 0x0438(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_AttractChallengeDescription;                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonLegacy*                    Button_BattlepassUpsell;                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonHierarchicalScrollBox*           ScrollBox_Challenges;                              // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_Challenges;                               // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ScrollToEndOfChallenges();
	void SetEntryFocus();
	void SetStyledCursorEnabled(bool bEnableStyledCursor);
	void ShowSkinUnlockMessage(bool bShowMessage, int32 InChallengeNum);
	void UpdateBPOwnedStateVisuals(bool bInOwnsBattlePass);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DonutChallengeScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DonutChallengeScreen")
	}
	static class UDonutChallengeScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDonutChallengeScreen>();
	}
};
DUMPER7_ASSERTS_UDonutChallengeScreen;

// Class FortniteUI.AthenaAwardAlertBase
// 0x0008 (0x0250 - 0x0248)
class UAthenaAwardAlertBase final : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                 PlayerVM;                                          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnAwardGranted(class UFortAwardItemDefinition* AwardDefinition);
	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);

public:
