#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteConversationUI

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteConversationUI_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteConversationRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayMessages_structs.hpp"


namespace SDK
{

// Class FortniteConversationUI.FortConversationOptionBrief
// 0x0000 (0x0270 - 0x0270)
class UFortConversationOptionBrief : public UCommonUserWidget
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortConversationOptionBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortConversationOptionBrief")
	}
	static class UFortConversationOptionBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationOptionBrief>();
	}
};
DUMPER7_ASSERTS_UFortConversationOptionBrief;

// Class FortniteConversationUI.FortConversationMarker
// 0x00B8 (0x03A0 - 0x02E8)
class UFortConversationMarker final : public UFortActorIndicatorWidget
{
public:
	uint8                                         Pad_2E8[0x38];                                     // 0x02E8(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InitialOffset;                                     // 0x0320(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                ManualOffset;                                      // 0x032C(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MessageBubbleDuration;                             // 0x0338(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LastTextBubbleDuration;                            // 0x033C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*              Switcher_States;                                   // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Overlay_PreviewState;                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_350[0x8];                                      // 0x0350(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortConversationMessageWidget*         ConversationMessage_Main;                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_360[0x8];                                      // 0x0360(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_ParticipantName;                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_370[0x8];                                      // 0x0370(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortKeybindWidget*                     Keybind_Nameplate;                                 // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 NPCIcon;                                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture2D*                             CustomDialogMarkerIndicatorIcon;                   // 0x0388(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture2D*                             DefaultDialogMarkerIndicatorIcon;                  // 0x0390(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_398[0x8];                                      // 0x0398(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCanInteract(bool bCanInteract);
	void OnConversationActorProximityChanged(EInteractionRange TargetInteractionRange, class UFortNonPlayerConversationParticipantComponent* ConversationComponent);
	void OnInteractionRangeChanged(EInteractionRange TargetInteractionRange);
	void OnMessageShownOverActor(class AActor* OverActor);
	void OnSetIndicatedActor(class AActor* NewIndicatorActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortConversationMarker")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortConversationMarker")
	}
	static class UFortConversationMarker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationMarker>();
	}
};
DUMPER7_ASSERTS_UFortConversationMarker;

// Class FortniteConversationUI.FortItemTransactionBrief
// 0x0018 (0x0288 - 0x0270)
class UFortItemTransactionBrief : public UFortConversationOptionBrief
{
public:
	uint8                                         Pad_270[0x8];                                      // 0x0270(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTransactionStrip*                  TransactionStrip_Main;                             // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItem*                              DisplayItem;                                       // 0x0280(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnTransactionInfoReceived(class UFortItem* Item);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortItemTransactionBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortItemTransactionBrief")
	}
	static class UFortItemTransactionBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemTransactionBrief>();
	}
};
DUMPER7_ASSERTS_UFortItemTransactionBrief;

// Class FortniteConversationUI.FortConversationMessageWidget
// 0x0000 (0x0248 - 0x0248)
class UFortConversationMessageWidget final : public UUserWidget
{
public:
	void OnMainMessageSet(const class FText& NPCName, const class FText& MessageBody);
	void OnMessageHidden();
	void OnMessageShown();
	void OnPreviewMessageSet(const class FText& PreviewText);
	void SetPreviewMessage(const class FText& MessageToSet);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortConversationMessageWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortConversationMessageWidget")
	}
	static class UFortConversationMessageWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationMessageWidget>();
	}
};
DUMPER7_ASSERTS_UFortConversationMessageWidget;

// Class FortniteConversationUI.FortApplyAbilityBrief
// 0x0020 (0x02A8 - 0x0288)
class UFortApplyAbilityBrief final : public UFortItemTransactionBrief
{
public:
	class FText                                   PurchaseServiceText;                               // 0x0288(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   Text_Display;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnAbleToPurchase();
	void OnUnableToPurchase(EPreventAbilityUseReason Reason);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortApplyAbilityBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortApplyAbilityBrief")
	}
	static class UFortApplyAbilityBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortApplyAbilityBrief>();
	}
};
DUMPER7_ASSERTS_UFortApplyAbilityBrief;

// Class FortniteConversationUI.FortBasicBrief
// 0x0000 (0x0270 - 0x0270)
class UFortBasicBrief final : public UFortConversationOptionBrief
{
public:
	void OnChoiceTextReceived(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBasicBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBasicBrief")
	}
	static class UFortBasicBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBasicBrief>();
	}
};
DUMPER7_ASSERTS_UFortBasicBrief;

// Class FortniteConversationUI.FortBasicItemBrief
// 0x0070 (0x02E0 - 0x0270)
class UFortBasicItemBrief final : public UFortConversationOptionBrief
{
public:
	uint8                                         Pad_270[0x8];                                      // 0x0270(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_TitleBar;                                     // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortTransactionStrip*                  TransactionStrip_Main;                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItem*                              DisplayItem;                                       // 0x0288(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FDataDrivenServiceBriefConfig> ServiceConfigs;                          // 0x0290(0x0050)(Edit, NativeAccessSpecifierPrivate)

public:
	void OnAbleToUse(const bool bShowWarningMessage);
	void OnItemInfoReceived(class UFortItem* Item, int32 StackSize);
	void OnUnableToUse(const class FText& Reason);
	void OnUpdateDescriptionText(const class FText& DescriptionText);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBasicItemBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBasicItemBrief")
	}
	static class UFortBasicItemBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBasicItemBrief>();
	}
};
DUMPER7_ASSERTS_UFortBasicItemBrief;

// Class FortniteConversationUI.FortBuyBrief
// 0x0000 (0x0288 - 0x0288)
class UFortBuyBrief final : public UFortItemTransactionBrief
{
public:
	void OnDisplayUnavailability(ECannotBuyReason CannotBuyReason);
	void OnPurchaseDataReceived(int32 StackSize, int32 RemainingForSale);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortBuyBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortBuyBrief")
	}
	static class UFortBuyBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortBuyBrief>();
	}
};
DUMPER7_ASSERTS_UFortBuyBrief;

// Class FortniteConversationUI.FortConversationOption
// 0x00C0 (0x1010 - 0x0F50)
class UFortConversationOption final : public UFortRadialPickerEntry
{
public:
	class USoundBase*                             OnOptionConfirmedSound;                            // 0x0F50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                             OnOptionHoveredSound;                              // 0x0F58(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonVisibilitySwitcher*              Switcher_DisplayAsset;                             // 0x0F60(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UObject>                 DefaultSoftTaskIcon;                               // 0x0F68(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USoundBase>              DefaultConfirmChoiceSound;                         // 0x0F90(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USoundBase>              DefaultHoverChoiceSound;                           // 0x0FB8(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_FE0[0x30];                                     // 0x0FE0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnOptionConfirmed();
	void OnSetupFromDisplayAsset(class UObject* DisplayAsset);
	void OnSetupFromItemDef(class UFortItem* Item);
	void OnSetupPivotFromRadialInformation(int32 NumElements, int32 ItemIndex);

	bool IsAvailable() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortConversationOption")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortConversationOption")
	}
	static class UFortConversationOption* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationOption>();
	}
};
DUMPER7_ASSERTS_UFortConversationOption;

// Class FortniteConversationUI.FortConversationOptionsPanel
// 0x0018 (0x0130 - 0x0118)
class UFortConversationOptionsPanel final : public UPanelWidget
{
public:
	uint8                                         Pad_118[0x10];                                     // 0x0118(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxRows;                                           // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MiddleColumnWidth;                                 // 0x012C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UPanelSlot* AddChildToDynamicPanel(class UWidget* Content);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortConversationOptionsPanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortConversationOptionsPanel")
	}
	static class UFortConversationOptionsPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationOptionsPanel>();
	}
};
DUMPER7_ASSERTS_UFortConversationOptionsPanel;

// Class FortniteConversationUI.FortConversationScreen
// 0x01D8 (0x0508 - 0x0330)
class UFortConversationScreen : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_330[0x10];                                     // 0x0330(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonVisibilitySwitcher*              Switcher_Details;                                  // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_348[0x38];                                     // 0x0348(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        ConversationInputComp;                             // 0x0380(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CurrentlySelectedIndex;                            // 0x0388(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bBlockOptionIntroAnimation;                        // 0x038C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RadialSelectionMaterialParameterName;              // 0x0390(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FGameplayTag>                   TagPriorities;                                     // 0x0398(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class FName                                   InteractActionNameKBM;                             // 0x03A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ADSInputAction;                                    // 0x03B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   InteractActionNameGamepad;                         // 0x03B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    ConfirmBinding;                                    // 0x03C0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    MakeSelectionBinding;                              // 0x03D0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    ADSMouseBinding;                                   // 0x03E0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    CancelActionBinding;                               // 0x03F0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    RightTriggerBinding;                               // 0x0400(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	TMap<class FString, TSoftClassPtr<class UClass>> DetailsNodeTypeToBrief;                         // 0x0410(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   ChatBrief;                                         // 0x0460(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DataDrivenBriefPrefix;                             // 0x0488(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   DataDrivenBrief;                                   // 0x0498(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSlottedRadialMenu*                 RadialMenu_DialogOptions;                          // 0x04C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_RadialHighlight;                             // 0x04C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortKeybindWidget*                     Keybind_Confirm;                                   // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBasicBrief*                        BasicBrief_Main;                                   // 0x04D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                               SizeBox_RadialMenu;                                // 0x04E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Overlay_Details;                                   // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                                Overlay_WheelContainer;                            // 0x04F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_Background;                                  // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_LoadingSpinner;                              // 0x0500(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void EndConversation();
	void OnConversationOptionUnavailable(class UFortRadialSlot* SelectedEntry);
	void OnConversationStarted();
	void OnItemSelected(int32 OriginalIndex);
	void OnOptionsPopulated();
	void OnSelectedItemAvailabilityChanged(bool bIsAvailable);
	bool ShouldBlockOptionIntroAnim();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortConversationScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortConversationScreen")
	}
	static class UFortConversationScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationScreen>();
	}
};
DUMPER7_ASSERTS_UFortConversationScreen;

// Class FortniteConversationUI.FortDataDrivenServiceBrief
// 0x0078 (0x02E8 - 0x0270)
class UFortDataDrivenServiceBrief final : public UFortConversationOptionBrief
{
public:
	uint8                                         Pad_270[0x8];                                      // 0x0270(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_TitleBar;                                     // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   RichText_Description;                              // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_StockRemaining;                               // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortTransactionStrip*                  TransactionStrip_Main;                             // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, struct FDataDrivenServiceBriefConfig> ServiceConfigs;                          // 0x0298(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	void OnAbleToPurchase();
	void OnTransactionInfoReceived(class UFortItem* Item);
	void OnUnableToPurchase(const class FText& Reason);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortDataDrivenServiceBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortDataDrivenServiceBrief")
	}
	static class UFortDataDrivenServiceBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDataDrivenServiceBrief>();
	}
};
DUMPER7_ASSERTS_UFortDataDrivenServiceBrief;

// Class FortniteConversationUI.FortDuelBrief
// 0x0028 (0x02B0 - 0x0288)
class UFortDuelBrief final : public UFortItemTransactionBrief
{
public:
	class FText                                   TextTemplate;                                      // 0x0288(0x0018)(Edit, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_Objective;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTileView*                        TileView;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void DisplayLootItems(const TArray<class UFortItem*>& Items);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortDuelBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortDuelBrief")
	}
	static class UFortDuelBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortDuelBrief>();
	}
};
DUMPER7_ASSERTS_UFortDuelBrief;

// Class FortniteConversationUI.FortHireBrief
// 0x0020 (0x02A8 - 0x0288)
class UFortHireBrief final : public UFortItemTransactionBrief
{
public:
	class FText                                   TextTemplate;                                      // 0x0288(0x0018)(Edit, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_Objective;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortHireBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortHireBrief")
	}
	static class UFortHireBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHireBrief>();
	}
};
DUMPER7_ASSERTS_UFortHireBrief;

// Class FortniteConversationUI.FortIntelBrief
// 0x0020 (0x02A8 - 0x0288)
class UFortIntelBrief final : public UFortItemTransactionBrief
{
public:
	class FText                                   TextTemplate;                                      // 0x0288(0x0018)(Edit, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_Objective;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortIntelBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortIntelBrief")
	}
	static class UFortIntelBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortIntelBrief>();
	}
};
DUMPER7_ASSERTS_UFortIntelBrief;

// Class FortniteConversationUI.FortItemFundBrief
// 0x00C8 (0x0338 - 0x0270)
class UFortItemFundBrief final : public UCommonUserWidget
{
public:
	uint8                                         Pad_270[0x8];                                      // 0x0270(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventMessageTag                       CurrentFundsChangedTag;                            // 0x0278(0x0008)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_280[0x38];                                     // 0x0280(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_TitleBar;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ProgressPercent;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ProgressCount;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSimpleMaterialProgressBar*         Progress_Funding;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         LazyImage_Icon;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortTransactionStrip*                  TransactionStrip_Main;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FDataDrivenServiceBriefConfig> ServiceConfigs;                          // 0x02E8(0x0050)(Edit, NativeAccessSpecifierPrivate)

public:
	void InitializeFromContext(const struct FConversationContext& ConversationContext);
	void OnProgressUpdated(const float CurrentFundingFraction);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortItemFundBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortItemFundBrief")
	}
	static class UFortItemFundBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemFundBrief>();
	}
};
DUMPER7_ASSERTS_UFortItemFundBrief;

// Class FortniteConversationUI.FortSingleItemFundBrief
// 0x0068 (0x02D8 - 0x0270)
class UFortSingleItemFundBrief : public UFortConversationOptionBrief
{
public:
	uint8                                         Pad_270[0x8];                                      // 0x0270(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemFundBrief*                     Item_Entry;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortNPCTextDisplay*                    NPCTextDisplay;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, struct FDataDrivenServiceBriefConfig> ServiceConfigs;                          // 0x0288(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortSingleItemFundBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortSingleItemFundBrief")
	}
	static class UFortSingleItemFundBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSingleItemFundBrief>();
	}
};
DUMPER7_ASSERTS_UFortSingleItemFundBrief;

// Class FortniteConversationUI.FortMultiItemFundBrief
// 0x0008 (0x02E0 - 0x02D8)
class UFortMultiItemFundBrief final : public UFortSingleItemFundBrief
{
public:
	class UFortItemFundBrief*                     Item_EntrySecondary;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void UpdateSelectedVisuals(int32 SelectedIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMultiItemFundBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMultiItemFundBrief")
	}
	static class UFortMultiItemFundBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMultiItemFundBrief>();
	}
};
DUMPER7_ASSERTS_UFortMultiItemFundBrief;

// Class FortniteConversationUI.FortNPCTextDisplay
// 0x0010 (0x0258 - 0x0248)
class UFortNPCTextDisplay final : public UUserWidget
{
public:
	class UCommonRichTextBlock*                   Text_Message;                                      // 0x0248(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         LazyImage_NPCImage;                                // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnTextUpdated();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortNPCTextDisplay")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortNPCTextDisplay")
	}
	static class UFortNPCTextDisplay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortNPCTextDisplay>();
	}
};
DUMPER7_ASSERTS_UFortNPCTextDisplay;

// Class FortniteConversationUI.FortQuestBrief
// 0x0050 (0x02C0 - 0x0270)
class UFortQuestBrief final : public UFortConversationOptionBrief
{
public:
	uint8                                         Pad_270[0x8];                                      // 0x0270(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ThisMatchOnlyQuestText;                            // 0x0278(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   Text_Objective;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_MoneyReward;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_XpReward;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ExpirationTime;                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonLazyImage*                       LazyImage_QuestProviderImage;                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_QuestProvider;                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnQuestExpirationTimeSet(const bool bDisplayExpirationTime);
	void OnQuestInformationRecieved(const class FText& Objective, const struct FFortRarityItemData& RarityData, const struct FGameplayTag& CategoryTag, int32 XPReward, int32 MoneyReward);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortQuestBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortQuestBrief")
	}
	static class UFortQuestBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQuestBrief>();
	}
};
DUMPER7_ASSERTS_UFortQuestBrief;

// Class FortniteConversationUI.FortShowFutureStormCircleBrief
// 0x0020 (0x02A8 - 0x0288)
class UFortShowFutureStormCircleBrief final : public UFortItemTransactionBrief
{
public:
	class FText                                   PurchaseServiceText;                               // 0x0288(0x0018)(Edit, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   Text_Display;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnAbleToPurchase();
	void OnUnableToPurchase(EPreventUseStormCircleServiceReason Reason);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortShowFutureStormCircleBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortShowFutureStormCircleBrief")
	}
	static class UFortShowFutureStormCircleBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortShowFutureStormCircleBrief>();
	}
};
DUMPER7_ASSERTS_UFortShowFutureStormCircleBrief;

// Class FortniteConversationUI.FortSingleOrMultiItemFundBrief
// 0x0060 (0x02D0 - 0x0270)
class UFortSingleOrMultiItemFundBrief final : public UFortConversationOptionBrief
{
public:
	uint8                                         Pad_270[0x8];                                      // 0x0270(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   SingleItemBrief;                                   // 0x0278(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UClass>                   MultiItemsBrief;                                   // 0x02A0(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOverlay*                               Overlay_Brief;                                     // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortSingleOrMultiItemFundBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortSingleOrMultiItemFundBrief")
	}
	static class UFortSingleOrMultiItemFundBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSingleOrMultiItemFundBrief>();
	}
};
DUMPER7_ASSERTS_UFortSingleOrMultiItemFundBrief;

// Class FortniteConversationUI.FortTransactionStrip
// 0x0020 (0x0268 - 0x0248)
class UFortTransactionStrip final : public UUserWidget
{
public:
	class UCommonTextBlock*                       Text_CostDescription;                              // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortWorldItemDefinition*               ResourceCurrency;                                  // 0x0250(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_258[0x10];                                     // 0x0258(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOnItemCountChanged(TScriptInterface<class IFortInventoryOwnerInterface> InventoryOwner, class UFortItemDefinition* Definition, int32 Delta);
	void OnSetTransactionCostVisibility(const bool bVisible);
	void OnTransactionInfoReceived(const struct FFortServiceTransactionInfo& TransactionInfo);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortTransactionStrip")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortTransactionStrip")
	}
	static class UFortTransactionStrip* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTransactionStrip>();
	}
};
DUMPER7_ASSERTS_UFortTransactionStrip;

// Class FortniteConversationUI.FortUpgradeBrief
// 0x0000 (0x0288 - 0x0288)
class UFortUpgradeBrief final : public UFortItemTransactionBrief
{
public:
	void OnUnableToUpgrade(EFortWeaponUpgradeInteractionResult CannotUpgradeCause);
	void OnUpgradeInfoReceived(class UFortItem* CurrentWeapon);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortUpgradeBrief")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortUpgradeBrief")
	}
	static class UFortUpgradeBrief* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUpgradeBrief>();
	}
};
DUMPER7_ASSERTS_UFortUpgradeBrief;

// Class FortniteConversationUI.MobileConversationScreen
// 0x0020 (0x0528 - 0x0508)
class UMobileConversationScreen final : public UFortConversationScreen
{
public:
	class UButton*                                MobileButtonConfirm;                               // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                                MobileButtonTouchInformation;                      // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_518[0x8];                                      // 0x0518(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonVisibilitySwitcher*              Switcher_CenteredDetails;                          // 0x0520(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnHandleConfirmClicked();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MobileConversationScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MobileConversationScreen")
	}
	static class UMobileConversationScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMobileConversationScreen>();
	}
};
DUMPER7_ASSERTS_UMobileConversationScreen;

}

