#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fortnite_Base_M_Lateral_Head_Export_Skeleton_AnimBP1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Fortnite_Base_M_Lateral_Head_Export_Skeleton_AnimBP1.Fortnite_Base_M_Lateral_Head_Export_Skeleton_AnimBP1_C.AnimBlueprintGeneratedConstantData
// 0x016F (0x0170 - 0x0001)
struct Fortnite_Base_M_Lateral_Head_Export_Skeleton_AnimBP1::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ArrayProperty_139;                                 // 0x0008(0x0010)()
	TArray<float>                                 ArrayProperty_140;                                 // 0x0018(0x0010)()
	TArray<int32>                                 ArrayProperty_141;                                 // 0x0028(0x0010)()
	bool                                          BoolProperty_142;                                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_143;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          StructProperty_144;                                // 0x0040(0x002C)(NoDestructor)
	float                                         FloatProperty_145;                                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ObjectProperty_146;                                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimSyncMethod                               EnumProperty_147;                                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                ByteProperty_148;                                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          ObjectProperty_149;                                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            ObjectProperty_150;                                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          BoolProperty_151;                                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             EnumProperty_152;                                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      EnumProperty_153;                                  // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ArrayProperty_154;                                 // 0x0098(0x0010)()
	struct FAnimNodeFunctionRef                   StructProperty_155;                                // 0x00A8(0x0020)(NoDestructor)
	class FName                                   NameProperty_156;                                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_157;                                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00D8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0158(0x0018)()
};
DUMPER7_ASSERTS_Fortnite_Base_M_Lateral_Head_Export_Skeleton_AnimBP1__FAnimBlueprintGeneratedConstantData;

// ScriptStruct Fortnite_Base_M_Lateral_Head_Export_Skeleton_AnimBP1.Fortnite_Base_M_Lateral_Head_Export_Skeleton_AnimBP1_C.AnimBlueprintGeneratedMutableData
// 0x0004 (0x0005 - 0x0001)
struct Fortnite_Base_M_Lateral_Head_Export_Skeleton_AnimBP1::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          BoolProperty;                                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ByteProperty_0;                                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ByteProperty_1;                                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_2;                                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Fortnite_Base_M_Lateral_Head_Export_Skeleton_AnimBP1__FAnimBlueprintGeneratedMutableData;

}

