#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FreshCheeseRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum FreshCheeseRuntime.EFriendChestResult
// NumValues: 0x0006
enum class EFriendChestResult : uint8
{
	Ignored                                  = 0,
	Partial                                  = 1,
	Abandoned                                = 2,
	Opened                                   = 3,
	SpawnFailure                             = 4,
	EFriendChestResult_MAX                   = 5,
};

// ScriptStruct FreshCheeseRuntime.FriendChestRoundPacing
// 0x0010 (0x0010 - 0x0000)
struct FFriendChestRoundPacing final
{
public:
	TArray<int32>                                 NumTargetsPerRound;                                // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFriendChestRoundPacing;

// ScriptStruct FreshCheeseRuntime.FriendChestPlayerActivationPair
// 0x0010 (0x0010 - 0x0000)
struct FFriendChestPlayerActivationPair final
{
public:
	class AFortPlayerPawnAthena*                  Player;                                            // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimerHandle                           ActivationTimer;                                   // 0x0008(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFriendChestPlayerActivationPair;

// ScriptStruct FreshCheeseRuntime.FriendChestAnalyticsLootRoll
// 0x0048 (0x0048 - 0x0000)
struct alignas(0x08) FFriendChestAnalyticsLootRoll final
{
public:
	uint8                                         Pad_0[0x48];                                       // 0x0000(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFriendChestAnalyticsLootRoll;

// ScriptStruct FreshCheeseRuntime.FriendChestAnalyticsParticipant
// 0x0068 (0x0068 - 0x0000)
struct FFriendChestAnalyticsParticipant final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 AccountId;                                         // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                SpawnCoordinates;                                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_24[0x24];                                      // 0x0024(0x0024)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFriendChestAnalyticsLootRoll>  InstancedLoot;                                     // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FFriendChestAnalyticsLootRoll>  FailedLoot;                                        // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FFriendChestAnalyticsParticipant;

}

