#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Galileo_Lobster_Melee_Mantis

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GA_Melee_Mantis_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Galileo_Lobster_Melee_Mantis.GA_Galileo_Lobster_Melee_Mantis_C
// 0x00B0 (0x0C08 - 0x0B58)
class UGA_Galileo_Lobster_Melee_Mantis_C final : public UGA_Melee_Mantis_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Galileo_Lobster_Melee_Mantis_C;  // 0x0B58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           T_MeleeAbility;                                    // 0x0B60(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_GCMeleeClash;                                    // 0x0B68(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          StaggerMelee;                                      // 0x0B70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B71[0x7];                                      // 0x0B71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         EnableStagger;                                     // 0x0B78(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ImpulseXY;                                         // 0x0BA0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         ImpulseZ;                                          // 0x0BC8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           T_StaggerEvent;                                    // 0x0BF0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_StaggerEnemy;                                   // 0x0BF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        Fort_Player_Pawn;                                  // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Added_257119E44AAC9BD082F95A9F3201447E();
	void BP_OnMantisTechniqueHit(const struct FGameplayAbilityTargetDataHandle& TargetDataHandle, const struct FGameplayTag& ApplicationTag);
	void EventReceived_3D9CCD6F49D4ABCB0E35DB855ADE0B29(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_Galileo_Lobster_Melee_Mantis(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Galileo_Lobster_Melee_Mantis_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Galileo_Lobster_Melee_Mantis_C")
	}
	static class UGA_Galileo_Lobster_Melee_Mantis_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Galileo_Lobster_Melee_Mantis_C>();
	}
};
DUMPER7_ASSERTS_UGA_Galileo_Lobster_Melee_Mantis_C;

}

