#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameFeatures

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameFeatures_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GameFeatures.GameFeatureAction
// 0x0000 (0x0028 - 0x0028)
class UGameFeatureAction : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureAction")
	}
	static class UGameFeatureAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction>();
	}
};
DUMPER7_ASSERTS_UGameFeatureAction;

// Class GameFeatures.GameFeatureAction_AddCheats
// 0x0028 (0x0050 - 0x0028)
class UGameFeatureAction_AddCheats final : public UGameFeatureAction
{
public:
	TArray<TSubclassOf<class UCheatManagerExtension>> CheatManagers;                                 // 0x0028(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class UCheatManagerExtension>> SpawnedCheatManagers;                       // 0x0040(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureAction_AddCheats")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureAction_AddCheats")
	}
	static class UGameFeatureAction_AddCheats* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddCheats>();
	}
};
DUMPER7_ASSERTS_UGameFeatureAction_AddCheats;

// Class GameFeatures.GameFeatureAction_AddComponents
// 0x0028 (0x0050 - 0x0028)
class UGameFeatureAction_AddComponents final : public UGameFeatureAction
{
public:
	TArray<struct FGameFeatureComponentEntry>     ComponentList;                                     // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureAction_AddComponents")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureAction_AddComponents")
	}
	static class UGameFeatureAction_AddComponents* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_AddComponents>();
	}
};
DUMPER7_ASSERTS_UGameFeatureAction_AddComponents;

// Class GameFeatures.GameFeatureAction_DataRegistry
// 0x0010 (0x0038 - 0x0028)
class UGameFeatureAction_DataRegistry final : public UGameFeatureAction
{
public:
	TArray<TSoftObjectPtr<class UDataRegistry>>   RegistriesToAdd;                                   // 0x0028(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureAction_DataRegistry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureAction_DataRegistry")
	}
	static class UGameFeatureAction_DataRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_DataRegistry>();
	}
};
DUMPER7_ASSERTS_UGameFeatureAction_DataRegistry;

// Class GameFeatures.GameFeatureAction_DataRegistrySource
// 0x0010 (0x0038 - 0x0028)
class UGameFeatureAction_DataRegistrySource final : public UGameFeatureAction
{
public:
	TArray<struct FDataRegistrySourceToAdd>       SourcesToAdd;                                      // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureAction_DataRegistrySource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureAction_DataRegistrySource")
	}
	static class UGameFeatureAction_DataRegistrySource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureAction_DataRegistrySource>();
	}
};
DUMPER7_ASSERTS_UGameFeatureAction_DataRegistrySource;

// Class GameFeatures.GameFeatureData
// 0x0020 (0x0050 - 0x0030)
class UGameFeatureData : public UPrimaryDataAsset
{
public:
	TArray<class UGameFeatureAction*>             Actions;                                           // 0x0030(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FPrimaryAssetTypeInfo>          PrimaryAssetTypesToScan;                           // 0x0040(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureData")
	}
	static class UGameFeatureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeatureData>();
	}
};
DUMPER7_ASSERTS_UGameFeatureData;

// Class GameFeatures.GameFeaturePluginStateMachine
// 0x0198 (0x01C0 - 0x0028)
class UGameFeaturePluginStateMachine final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameFeaturePluginStateMachineProperties StateProperties;                                 // 0x0048(0x00A0)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0xD8];                                      // 0x00E8(0x00D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeaturePluginStateMachine")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeaturePluginStateMachine")
	}
	static class UGameFeaturePluginStateMachine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeaturePluginStateMachine>();
	}
};
DUMPER7_ASSERTS_UGameFeaturePluginStateMachine;

// Class GameFeatures.GameFeaturesProjectPolicies
// 0x0000 (0x0028 - 0x0028)
class UGameFeaturesProjectPolicies : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeaturesProjectPolicies")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeaturesProjectPolicies")
	}
	static class UGameFeaturesProjectPolicies* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeaturesProjectPolicies>();
	}
};
DUMPER7_ASSERTS_UGameFeaturesProjectPolicies;

// Class GameFeatures.DefaultGameFeaturesProjectPolicies
// 0x0000 (0x0028 - 0x0028)
class UDefaultGameFeaturesProjectPolicies final : public UGameFeaturesProjectPolicies
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DefaultGameFeaturesProjectPolicies")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DefaultGameFeaturesProjectPolicies")
	}
	static class UDefaultGameFeaturesProjectPolicies* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultGameFeaturesProjectPolicies>();
	}
};
DUMPER7_ASSERTS_UDefaultGameFeaturesProjectPolicies;

// Class GameFeatures.GameFeaturesSubsystem
// 0x00C0 (0x00F0 - 0x0030)
class UGameFeaturesSubsystem final : public UEngineSubsystem
{
public:
	TMap<class FString, class UGameFeaturePluginStateMachine*> GameFeaturePluginStateMachines;       // 0x0030(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_80[0x50];                                      // 0x0080(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        Observers;                                         // 0x00D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UGameFeaturesProjectPolicies*           GameSpecificPolicies;                              // 0x00E0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeaturesSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeaturesSubsystem")
	}
	static class UGameFeaturesSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeaturesSubsystem>();
	}
};
DUMPER7_ASSERTS_UGameFeaturesSubsystem;

// Class GameFeatures.GameFeaturesSubsystemSettings
// 0x0050 (0x0088 - 0x0038)
class UGameFeaturesSubsystemSettings final : public UDeveloperSettings
{
public:
	struct FSoftClassPath                         GameFeaturesManagerClassName;                      // 0x0038(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         DisabledPlugins;                                   // 0x0050(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         AdditionalPluginMetadataKeys;                      // 0x0060(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	class FString                                 BuiltInGameFeaturePluginsFolder;                   // 0x0070(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameFeatureData>           DefaultGameFeatureDataClass;                       // 0x0080(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeaturesSubsystemSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeaturesSubsystemSettings")
	}
	static class UGameFeaturesSubsystemSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFeaturesSubsystemSettings>();
	}
};
DUMPER7_ASSERTS_UGameFeaturesSubsystemSettings;

// Class GameFeatures.GameFeatureStateChangeObserver
// 0x0000 (0x0000 - 0x0000)
class IGameFeatureStateChangeObserver final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFeatureStateChangeObserver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFeatureStateChangeObserver")
	}
	static class IGameFeatureStateChangeObserver* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGameFeatureStateChangeObserver>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGameFeatureStateChangeObserver;

}

