#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GiftingUI

#include "Basic.hpp"

#include "GiftingUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function GiftingUI.AthenaGiftingConfirmationScreen.HandleGiftSent
// 0x0028 (0x0028 - 0x0000)
struct AthenaGiftingConfirmationScreen_HandleGiftSent final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         IneligibleAccounts;                                // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         ErrorCodes;                                        // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaGiftingConfirmationScreen_HandleGiftSent;

// Function GiftingUI.AthenaGiftingConfirmationScreen.HandleTokenOfferPurchaseComplete
// 0x0018 (0x0018 - 0x0000)
struct AthenaGiftingConfirmationScreen_HandleTokenOfferPurchaseComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPurchasedItemInfo>             PurchasedItems;                                    // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaGiftingConfirmationScreen_HandleTokenOfferPurchaseComplete;

// Function GiftingUI.AthenaGiftingConfirmationScreen.OnPresentationModeChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaGiftingConfirmationScreen_OnPresentationModeChanged final
{
public:
	EGiftingPresentationMode                      NewMode;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaGiftingConfirmationScreen_OnPresentationModeChanged;

// Function GiftingUI.AthenaGiftingErrorsPanel.UpdateGiftEligibility
// 0x0001 (0x0001 - 0x0000)
struct AthenaGiftingErrorsPanel_UpdateGiftEligibility final
{
public:
	bool                                          bStillGiftable;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaGiftingErrorsPanel_UpdateGiftEligibility;

// Function GiftingUI.AthenaGiftingPriceWidget.SetPresentationMode
// 0x0001 (0x0001 - 0x0000)
struct AthenaGiftingPriceWidget_SetPresentationMode final
{
public:
	EGiftingPricePresentationMode                 Mode;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaGiftingPriceWidget_SetPresentationMode;

// Function GiftingUI.AthenaGiftingScreen.OnFilterChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaGiftingScreen_OnFilterChanged final
{
public:
	EFilterType                                   FilterType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaGiftingScreen_OnFilterChanged;

// Function GiftingUI.AthenaGiftingScreen.OnPartyListUpdated
// 0x0001 (0x0001 - 0x0000)
struct AthenaGiftingScreen_OnPartyListUpdated final
{
public:
	bool                                          bEmpty;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaGiftingScreen_OnPartyListUpdated;

// Function GiftingUI.AthenaGiftingScreen.OnPresentationModeChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaGiftingScreen_OnPresentationModeChanged final
{
public:
	EGiftingScreenPresentationMode                Mode;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaGiftingScreen_OnPresentationModeChanged;

// Function GiftingUI.AthenaGiftingScreen.OnSetupFilterTabButton
// 0x0010 (0x0010 - 0x0000)
struct AthenaGiftingScreen_OnSetupFilterTabButton final
{
public:
	class UCommonButtonLegacy*                    Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFilterType                                   FilterType;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AthenaGiftingScreen_OnSetupFilterTabButton;

// Function GiftingUI.AthenaGiftingScreen.OnShowSearchWarningText
// 0x0001 (0x0001 - 0x0000)
struct AthenaGiftingScreen_OnShowSearchWarningText final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaGiftingScreen_OnShowSearchWarningText;

// Function GiftingUI.FortGiftingSocialUserListEntry.BP_OnHighlightedStateChanged
// 0x0002 (0x0002 - 0x0000)
struct FortGiftingSocialUserListEntry_BP_OnHighlightedStateChanged final
{
public:
	bool                                          bInIsHighlighted;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayAnimation;                                    // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortGiftingSocialUserListEntry_BP_OnHighlightedStateChanged;

// Function GiftingUI.FortGiftingSocialUserListEntry.SetPresentationMode
// 0x0001 (0x0001 - 0x0000)
struct FortGiftingSocialUserListEntry_SetPresentationMode final
{
public:
	ERecipientPresentationMode                    Mode;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortGiftingSocialUserListEntry_SetPresentationMode;

// Function GiftingUI.FortGiftingUserSearchWidget.HandleSearchFriendsTextChanged
// 0x0018 (0x0018 - 0x0000)
struct FortGiftingUserSearchWidget_HandleSearchFriendsTextChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortGiftingUserSearchWidget_HandleSearchFriendsTextChanged;

// Function GiftingUI.FortGiftingUserSearchWidget.HandleSearchFriendsTextEntered
// 0x0020 (0x0020 - 0x0000)
struct FortGiftingUserSearchWidget_HandleSearchFriendsTextEntered final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortGiftingUserSearchWidget_HandleSearchFriendsTextEntered;

// Function GiftingUI.FortGiftingUserSearchWidget.OnSearchCommit
// 0x0001 (0x0001 - 0x0000)
struct FortGiftingUserSearchWidget_OnSearchCommit final
{
public:
	bool                                          bSearchStringShort;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortGiftingUserSearchWidget_OnSearchCommit;

}

