#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HermesPlaysetsUI

#include "Basic.hpp"

#include "HermesPlaysetsUI_structs.hpp"


namespace SDK::Params
{

// Function HermesPlaysetsUI.DownloadEntryScreen.HandleDownloadLinkCodeChanged
// 0x0018 (0x0018 - 0x0000)
struct DownloadEntryScreen_HandleDownloadLinkCodeChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadEntryScreen_HandleDownloadLinkCodeChanged;

// Function HermesPlaysetsUI.DownloadOnDemandDirector.CanAddProject
// 0x0001 (0x0001 - 0x0000)
struct DownloadOnDemandDirector_CanAddProject final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadOnDemandDirector_CanAddProject;

// Function HermesPlaysetsUI.DownloadOnDemandDirector.CanRemoveProject
// 0x0001 (0x0001 - 0x0000)
struct DownloadOnDemandDirector_CanRemoveProject final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadOnDemandDirector_CanRemoveProject;

// Function HermesPlaysetsUI.DownloadOnDemandDirector.HandlePlaysetDownloadedSuccess
// 0x0001 (0x0001 - 0x0000)
struct DownloadOnDemandDirector_HandlePlaysetDownloadedSuccess final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadOnDemandDirector_HandlePlaysetDownloadedSuccess;

// Function HermesPlaysetsUI.DownloadOnDemandDirector.HermesPlaysetDownloadedOnServer
// 0x0028 (0x0028 - 0x0000)
struct DownloadOnDemandDirector_HermesPlaysetDownloadedOnServer final
{
public:
	class FString                                 InLinkCode;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ErrorMessage;                                      // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadOnDemandDirector_HermesPlaysetDownloadedOnServer;

// Function HermesPlaysetsUI.DownloadOnDemandDirector.HermesPlaysetLinkCodeResolved
// 0x0028 (0x0028 - 0x0000)
struct DownloadOnDemandDirector_HermesPlaysetLinkCodeResolved final
{
public:
	class FString                                 InLinkCode;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InProjectId;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DownloadOnDemandDirector_HermesPlaysetLinkCodeResolved;

// Function HermesPlaysetsUI.DownloadOnDemandDirector.IsUsingDynamicHUDForUI
// 0x0001 (0x0001 - 0x0000)
struct DownloadOnDemandDirector_IsUsingDynamicHUDForUI final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadOnDemandDirector_IsUsingDynamicHUDForUI;

// Function HermesPlaysetsUI.DownloadOnDemandDirector.LinkCodeMetaDataLoaded
// 0x0030 (0x0030 - 0x0000)
struct DownloadOnDemandDirector_LinkCodeMetaDataLoaded final
{
public:
	class FString                                 InLinkCode;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InProjectId;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InTitleString;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadOnDemandDirector_LinkCodeMetaDataLoaded;

// Function HermesPlaysetsUI.DownloadOnDemandDirector.LinkCodeMetaDataPreviewTextureLoaded
// 0x0008 (0x0008 - 0x0000)
struct DownloadOnDemandDirector_LinkCodeMetaDataPreviewTextureLoaded final
{
public:
	class UTexture2DDynamic*                      InPreviewTexture;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadOnDemandDirector_LinkCodeMetaDataPreviewTextureLoaded;

// Function HermesPlaysetsUI.DownloadOnDemandDirector.LoadLinkCodeMetaData
// 0x0028 (0x0028 - 0x0000)
struct DownloadOnDemandDirector_LoadLinkCodeMetaData final
{
public:
	class FString                                 InLinkMnemonic;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InLinkVersion;                                     // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerAthena*            InFortPlayerControllerAthena;                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DownloadOnDemandDirector_LoadLinkCodeMetaData;

// Function HermesPlaysetsUI.DownloadOnDemandDirector.OnLinkPreviewImageDownloaded
// 0x0010 (0x0010 - 0x0000)
struct DownloadOnDemandDirector_OnLinkPreviewImageDownloaded final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2DDynamic*                      InPreviewTexture;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadOnDemandDirector_OnLinkPreviewImageDownloaded;

// Function HermesPlaysetsUI.DownloadOnDemandDirector.OnNewLinkCodeChanged
// 0x0010 (0x0010 - 0x0000)
struct DownloadOnDemandDirector_OnNewLinkCodeChanged final
{
public:
	TArray<class FString>                         UpdatedLinkCodes;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadOnDemandDirector_OnNewLinkCodeChanged;

// Function HermesPlaysetsUI.DownloadOnDemandDirector.RequestLinkCodePreviewFromCode
// 0x0020 (0x0020 - 0x0000)
struct DownloadOnDemandDirector_RequestLinkCodePreviewFromCode final
{
public:
	class FString                                 InCode;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerControllerAthena*            InFortPlayerControllerAthena;                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DownloadOnDemandDirector_RequestLinkCodePreviewFromCode;

// Function HermesPlaysetsUI.DownloadOnDemandDirector.RequestPlaysetFromCode
// 0x0040 (0x0040 - 0x0000)
struct DownloadOnDemandDirector_RequestPlaysetFromCode final
{
public:
	class FString                                 InCode;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InProjectId;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InTitleName;                                       // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerControllerAthena*            InFortPlayerControllerAthena;                      // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DownloadOnDemandDirector_RequestPlaysetFromCode;

// Function HermesPlaysetsUI.DownloadOnDemandDirector.ShowDownloadOnDemandError
// 0x0028 (0x0028 - 0x0000)
struct DownloadOnDemandDirector_ShowDownloadOnDemandError final
{
public:
	EDownloadOnDemandErrorMessage                 DownloadOnDemandErrorMessage;                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InLinkCode;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ErrorMessage;                                      // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadOnDemandDirector_ShowDownloadOnDemandError;

// Function HermesPlaysetsUI.DownloadOnDemandDirector.ShowDownloadOnDemandModal
// 0x0010 (0x0010 - 0x0000)
struct DownloadOnDemandDirector_ShowDownloadOnDemandModal final
{
public:
	class UCommonActivatableWidget*               ParentWidget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonActivatableWidget*               ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadOnDemandDirector_ShowDownloadOnDemandModal;

// Function HermesPlaysetsUI.DownloadOnDemandDirector.ShowErrorMessageModal
// 0x0010 (0x0010 - 0x0000)
struct DownloadOnDemandDirector_ShowErrorMessageModal final
{
public:
	class UCommonActivatableWidget*               ParentWidget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonActivatableWidget*               ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadOnDemandDirector_ShowErrorMessageModal;

// Function HermesPlaysetsUI.DownloadOnDemandDirector.CanAddLinkCode
// 0x0018 (0x0018 - 0x0000)
struct DownloadOnDemandDirector_CanAddLinkCode final
{
public:
	class FString                                 InLinkCode;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DownloadOnDemandDirector_CanAddLinkCode;

}

