#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LagerRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "LagerRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function LagerRuntime.FortAthenaLivingWorldPointProviderInterface.GetPointProviderLocation
// 0x000C (0x000C - 0x0000)
struct FortAthenaLivingWorldPointProviderInterface_GetPointProviderLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldPointProviderInterface_GetPointProviderLocation;

// Function LagerRuntime.FortAthenaLivingWorldPointProviderInterface.OnSpawnedActor
// 0x0018 (0x0018 - 0x0000)
struct FortAthenaLivingWorldPointProviderInterface_OnSpawnedActor final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PositionFromProvider;                              // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaLivingWorldPointProviderInterface_OnSpawnedActor;

// Function LagerRuntime.FortAthenaLivingWorldPointProviderInterface.OnSpawnedActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldPointProviderInterface_OnSpawnedActorDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldPointProviderInterface_OnSpawnedActorDestroyed;

// Function LagerRuntime.FortAthenaLivingWorldPointProviderInterface.GetFiltersTags
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaLivingWorldPointProviderInterface_GetFiltersTags final
{
public:
	struct FGameplayTagContainer                  FilterTags;                                        // 0x0000(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldPointProviderInterface_GetFiltersTags;

// Function LagerRuntime.FortAthenaLivingWorldPointProviderInterface.GetValidLocation
// 0x0050 (0x0050 - 0x0000)
struct FortAthenaLivingWorldPointProviderInterface_GetValidLocation final
{
public:
	struct FFortAthenaLivingWorldPointProviderFilterRules PointFilter;                               // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                OutPosition;                                       // 0x0030(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               OutRotation;                                       // 0x003C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaLivingWorldPointProviderInterface_GetValidLocation;

// Function LagerRuntime.FortAthenaLivingWorldPointProviderInterface.IsEnabled
// 0x0038 (0x0038 - 0x0000)
struct FortAthenaLivingWorldPointProviderInterface_IsEnabled final
{
public:
	struct FFortAthenaLivingWorldPointProviderFilterRules PointFilter;                               // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaLivingWorldPointProviderInterface_IsEnabled;

// Function LagerRuntime.FortAthenaLivingWorldEncounterInstance.GetTotalActorCount
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaLivingWorldEncounterInstance_GetTotalActorCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldEncounterInstance_GetTotalActorCount;

// Function LagerRuntime.FortAthenaLivingWorldManager.LivingWorldManagerRegisterPointProvider
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldManager_LivingWorldManagerRegisterPointProvider final
{
public:
	class AActor*                                 PointProvider;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_LivingWorldManagerRegisterPointProvider;

// Function LagerRuntime.FortAthenaLivingWorldManager.LivingWorldManagerUnregisterPointProvider
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldManager_LivingWorldManagerUnregisterPointProvider final
{
public:
	class AActor*                                 PointProvider;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_LivingWorldManagerUnregisterPointProvider;

// Function LagerRuntime.FortAthenaLivingWorldManager.EndEncounter
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldManager_EndEncounter final
{
public:
	class UFortAthenaLivingWorldEncounterInstance* EncounterInstance;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_EndEncounter;

// Function LagerRuntime.FortAthenaLivingWorldManager.LivingWorldManagerProviderDebugActor
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaLivingWorldManager_LivingWorldManagerProviderDebugActor final
{
public:
	int32                                         ProviderIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_LivingWorldManagerProviderDebugActor;

// Function LagerRuntime.FortAthenaLivingWorldManager.OnActorSpawned
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaLivingWorldManager_OnActorSpawned final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RequestID;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_OnActorSpawned;

// Function LagerRuntime.FortAthenaLivingWorldManager.OnCurrentPlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaLivingWorldManager_OnCurrentPlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_OnCurrentPlaylistLoaded;

// Function LagerRuntime.FortAthenaLivingWorldManager.OnPatrolPathAdded
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldManager_OnPatrolPathAdded final
{
public:
	class AFortAthenaPatrolPath*                  PatrolPath;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_OnPatrolPathAdded;

// Function LagerRuntime.FortAthenaLivingWorldManager.OnRep_DebugDensityMinimapIndicator
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldManager_OnRep_DebugDensityMinimapIndicator final
{
public:
	class UFortAthenaLivingWorldDebugDensityMiniMapIndicator* OldMapIndicator;                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_OnRep_DebugDensityMinimapIndicator;

// Function LagerRuntime.FortAthenaLivingWorldManager.OnSpawnedActorDestroy
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldManager_OnSpawnedActorDestroy final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_OnSpawnedActorDestroy;

// Function LagerRuntime.FortAthenaLivingWorldManager.OnUnmanagedDensityReservoirActorDestroy
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldManager_OnUnmanagedDensityReservoirActorDestroy final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_OnUnmanagedDensityReservoirActorDestroy;

// Function LagerRuntime.FortAthenaLivingWorldManager.OnWorldFinishedInitialization
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaLivingWorldManager_OnWorldFinishedInitialization final
{
public:
	struct FGameplayTagContainer                  ContextTags;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_OnWorldFinishedInitialization;

// Function LagerRuntime.FortAthenaLivingWorldManager.QueryEventBudget
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaLivingWorldManager_QueryEventBudget final
{
public:
	struct FDataTableRowHandle                    EventEntry;                                        // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	const class AActor*                           SpawnLocation;                                     // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_QueryEventBudget;

// Function LagerRuntime.FortAthenaLivingWorldManager.StartEncounter
// 0x0048 (0x0048 - 0x0000)
struct FortAthenaLivingWorldManager_StartEncounter final
{
public:
	TSoftObjectPtr<class UFortAthenaLivingWorldEncounter> EncounterType;                             // 0x0000(0x0028)(ConstParm, Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> EncounterPointProviders; // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, UObjectWrapper, NativeAccessSpecifierPublic)
	class AActor*                                 ActorDensityReservoir;                             // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAthenaLivingWorldEncounterInstance* ReturnValue;                                      // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_StartEncounter;

// Function LagerRuntime.FortAthenaLivingWorldManager.TrySpawnEvent
// 0x0060 (0x0060 - 0x0000)
struct FortAthenaLivingWorldManager_TrySpawnEvent final
{
public:
	struct FDataTableRowHandle                    EventEntry;                                        // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             SpawnLocation;                                     // 0x0010(0x0030)(ConstParm, Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const TArray<class AActor*>& SpawnedActors, bool bSuccess)> OnRequestFinished;    // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_TrySpawnEvent;

// Function LagerRuntime.FortAthenaLivingWorldPointProvidersEnabler.OnCurrentPlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaLivingWorldPointProvidersEnabler_OnCurrentPlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldPointProvidersEnabler_OnCurrentPlaylistLoaded;

// Function LagerRuntime.FortAthenaLivingWorldPointProvidersEnabler.RemoveClosestPointProvidersToPoint
// 0x0014 (0x0014 - 0x0000)
struct FortAthenaLivingWorldPointProvidersEnabler_RemoveClosestPointProvidersToPoint final
{
public:
	struct FVector                                Point;                                             // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumDistance;                                   // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointsToDisable;                                   // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldPointProvidersEnabler_RemoveClosestPointProvidersToPoint;

// Function LagerRuntime.FortAthenaLivingWorldPointProvidersEnabler.DoesStartEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaLivingWorldPointProvidersEnabler_DoesStartEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldPointProvidersEnabler_DoesStartEnabled;

// Function LagerRuntime.FortAthenaLivingWorldPointProvidersEnabler.GetEnabledLinkedPointProviders
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaLivingWorldPointProvidersEnabler_GetEnabledLinkedPointProviders final
{
public:
	TArray<TScriptInterface<class IFortAthenaLivingWorldPointProviderInterface>> ReturnValue;        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldPointProvidersEnabler_GetEnabledLinkedPointProviders;

// Function LagerRuntime.FortAthenaLivingWorldPointProvidersEnabler.GetEnablerTags
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaLivingWorldPointProvidersEnabler_GetEnablerTags final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldPointProvidersEnabler_GetEnablerTags;

// Function LagerRuntime.FortAthenaLivingWorldPointProvidersEnabler.HasCompletedEvaluation
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaLivingWorldPointProvidersEnabler_HasCompletedEvaluation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldPointProvidersEnabler_HasCompletedEvaluation;

// Function LagerRuntime.FortAthenaLivingWorldSpawnActionBlueprint.K2_OnAllActorSpawned
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaLivingWorldSpawnActionBlueprint_K2_OnAllActorSpawned final
{
public:
	TArray<class AActor*>                         SpawnedActor;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldSpawnActionBlueprint_K2_OnAllActorSpawned;

// Function LagerRuntime.FortAthenaLivingWorldVolume.OnCurrentPlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaLivingWorldVolume_OnCurrentPlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldVolume_OnCurrentPlaylistLoaded;

// Function LagerRuntime.FortAthenaLivingWorldVolume.OnWorldFinishedInitialization
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaLivingWorldVolume_OnWorldFinishedInitialization final
{
public:
	struct FGameplayTagContainer                  ContextTags;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldVolume_OnWorldFinishedInitialization;

// Function LagerRuntime.FortAthenaLivingWorldVolume.SetEQSQuery
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldVolume_SetEQSQuery final
{
public:
	class UEnvQuery*                              Query;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldVolume_SetEQSQuery;

// Function LagerRuntime.FortAthenaLivingWorldVolume.SetEQSQueryConfigParam
// 0x000C (0x000C - 0x0000)
struct FortAthenaLivingWorldVolume_SetEQSQueryConfigParam final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldVolume_SetEQSQueryConfigParam;

// Function LagerRuntime.FortAthenaLivingWorldVolume.SetFiltersTags
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaLivingWorldVolume_SetFiltersTags final
{
public:
	struct FGameplayTagContainer                  TagContainer;                                      // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldVolume_SetFiltersTags;

// Function LagerRuntime.FortAthenaLivingWorldVolume.DoesStartEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaLivingWorldVolume_DoesStartEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldVolume_DoesStartEnabled;

// Function LagerRuntime.FortAthenaLivingWorldVolume.IsPointProviderEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaLivingWorldVolume_IsPointProviderEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldVolume_IsPointProviderEnabled;

// Function LagerRuntime.FortAthenaPatrolPathPointProvider.OnCurrentPlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaPatrolPathPointProvider_OnCurrentPlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaPatrolPathPointProvider_OnCurrentPlaylistLoaded;

// Function LagerRuntime.FortAthenaPointAroundPlayerProvider.OnCurrentPlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaPointAroundPlayerProvider_OnCurrentPlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaPointAroundPlayerProvider_OnCurrentPlaylistLoaded;

// Function LagerRuntime.FortCheatManager_LivingWorldManager.LivingWorldManagerSpawn
// 0x0010 (0x0010 - 0x0000)
struct FortCheatManager_LivingWorldManager_LivingWorldManagerSpawn final
{
public:
	class FString                                 EventDataName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_LivingWorldManager_LivingWorldManagerSpawn;

// Function LagerRuntime.FortCheatManager_LivingWorldManager.LivingWorldManagerSpawnAtLocation
// 0x0028 (0x0028 - 0x0000)
struct FortCheatManager_LivingWorldManager_LivingWorldManagerSpawnAtLocation final
{
public:
	class FString                                 EventDataName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_LivingWorldManager_LivingWorldManagerSpawnAtLocation;

// Function LagerRuntime.FortCheatManager_LivingWorldManager.LivingWorldManagerTeleportTo
// 0x0010 (0x0010 - 0x0000)
struct FortCheatManager_LivingWorldManager_LivingWorldManagerTeleportTo final
{
public:
	class FString                                 EventDataName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_LivingWorldManager_LivingWorldManagerTeleportTo;

// Function LagerRuntime.FortCheatManager_LivingWorldManager.LivingWorldManagerTeleportToSpawnPosition
// 0x0010 (0x0010 - 0x0000)
struct FortCheatManager_LivingWorldManager_LivingWorldManagerTeleportToSpawnPosition final
{
public:
	class FString                                 EventDataName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_LivingWorldManager_LivingWorldManagerTeleportToSpawnPosition;

}

