#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaderboardListViewWrapper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LeaderboardListViewWrapper.LeaderboardListViewWrapper_C
// 0x0210 (0x0550 - 0x0340)
class ULeaderboardListViewWrapper_C final : public UFortLeaderboardListViewWrapper
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEventsSimpleButton_C*                  Button_Filter;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventsSimpleButton_C*                  Button_Position;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_OptionsBarBG;                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            CommonWidgetSwitcher_FliterOptions;                // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEventLeaderboardPlayerPerformance_C*   EventLeaderboardPlayerPerformance;                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortTournamentDisplayInfo             DisplayInfo;                                       // 0x0380(0x01D0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_LeaderboardListViewWrapper(int32 EntryPoint);
	void OnLeaderboardDisplayTypeChanged(ELeaderboardDisplayType NewDisplayType);
	void Set_Display_Info(const struct FFortTournamentDisplayInfo& DisplayInfo_0);
	void Set_Event(const class FString& EventId, const class FString& EventWindowId);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("LeaderboardListViewWrapper_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LeaderboardListViewWrapper_C")
	}
	static class ULeaderboardListViewWrapper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaderboardListViewWrapper_C>();
	}
};
DUMPER7_ASSERTS_ULeaderboardListViewWrapper_C;

}

