#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Parallel_Comic_Shoulders_CtrlRig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "RigVM_classes.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass M_MED_Parallel_Comic_Shoulders_CtrlRig.M_MED_Parallel_Comic_Shoulders_CtrlRig_C
// 0x0030 (0x04B0 - 0x0480)
class UM_MED_Parallel_Comic_Shoulders_CtrlRig_C final : public UControlRig
{
public:
	uint8                                         Pad_478[0x8];                                      // 0x0478(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  upper_arm_r_rel_quat;                              // 0x0480(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FQuat                                  upper_arm_l_rel_quat;                              // 0x0490(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         upper_arm_twists;                                  // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_arms_crossed;                                   // 0x04A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("M_MED_Parallel_Comic_Shoulders_CtrlRig_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"M_MED_Parallel_Comic_Shoulders_CtrlRig_C")
	}
	static class UM_MED_Parallel_Comic_Shoulders_CtrlRig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Parallel_Comic_Shoulders_CtrlRig_C>();
	}
};
DUMPER7_ASSERTS_UM_MED_Parallel_Comic_Shoulders_CtrlRig_C;

// RigVMMemoryStorageGeneratorClass M_MED_Parallel_Comic_Shoulders_CtrlRig.RigVMMemory_Literal
// 0x01D8 (0x0200 - 0x0028)
class M_MED_Parallel_Comic_Shoulders_CtrlRig::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	class FName                                   RigUnit_SetBoneRotation_1_1_1_1_2_Bone__Const;     // 0x0028(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigUnit_GetBoneTransform_1_1_1_1_2_Bone__Const;    // 0x0030(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBoneGetterSetterMode                         RigUnit_GetBoneTransform_1_1_1_1_2_Space__Const;   // 0x0038(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MathQuaternionSwingTwist_1_1_1_1_2_TwistAxis__Const; // 0x003C(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathFloatMul_3_1_1_1_1_2_B__Const;                 // 0x0048(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBoneGetterSetterMode                         RigUnit_SetBoneRotation_1_1_1_1_2_Space__Const;    // 0x004C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigUnit_SetBoneRotation_1_1_1_1_2_Weight__Const;   // 0x0050(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         RigUnit_SetBoneRotation_1_1_1_1_2_bPropagateToChildren__Const : 1; // 0x0054(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RigUnit_SetBoneRotation_1_1_1_1_Bone__Const;       // 0x0058(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBoneGetterSetterMode                         RigUnit_SetBoneRotation_1_1_1_1_Space__Const;      // 0x0060(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RigUnit_SetBoneRotation_1_1_1_1_2_1_Bone__Const;   // 0x0064(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigUnit_GetBoneTransform_1_1_1_1_2_1_Bone__Const;  // 0x006C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBoneGetterSetterMode                         RigUnit_SetBoneRotation_1_1_1_1_2_1_Space__Const;  // 0x0074(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RigUnit_SetBoneRotation_1_1_1_Bone__Const;         // 0x0078(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBoneGetterSetterMode                         RigUnit_SetBoneRotation_1_1_1_Space__Const;        // 0x0080(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ModifyTransforms_5_1_1_1_ItemToModify__Const;   // 0x0088(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         GetTransform_5_1_1_Item__Const;                    // 0x0098(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EControlRigRotationOrder                      MathQuaternionToEuler_4_1_1_2_1_1_RotationOrder__Const; // 0x00A4(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MathVectorAdd_1_1_2_1_1_B__Const;                  // 0x00A8(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ModifyTransforms_5_1_1_1_WeightMinimum__Const;     // 0x00B4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EControlRigModifyBoneMode                     ModifyTransforms_5_1_1_1_Mode__Const;              // 0x00B8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ModifyTransforms_5_2_ItemToModify__Const;       // 0x00C0(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         GetTransform_4_1_Item__Const;                      // 0x00D0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathVectorAdd_3_2_1_B__Const;                      // 0x00DC(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         GetTransform_6_2_2_Item__Const;                    // 0x00E8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         GetTransform_6_2_2_bInitial__Const : 1;            // 0x00F4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MathFloatRemap_4_1_2_1_1_SourceMaximum__Const;     // 0x00F8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ModifyTransforms_5_1_1_ItemToModify__Const;     // 0x0100(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ModifyTransforms_5_ItemToModify__Const;         // 0x0110(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         GetTransform_4_Item__Const;                        // 0x0120(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         GetTransform_6_2_1_1_Item__Const;                  // 0x012C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ModifyTransforms_5_1_ItemToModify__Const;       // 0x0138(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         GetTransform_5_Item__Const;                        // 0x0148(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathVectorAdd_1_1_2_B__Const;                      // 0x0154(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ModifyTransforms_5_1_2_2_ItemToModify__Const;   // 0x0160(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         GetTransform_5_2_2_Item__Const;                    // 0x0170(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathVectorAdd_2_B__Const;                          // 0x017C(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         GetTransform_5_2_3_1_Item__Const;                  // 0x0188(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathFloatRemap_2_SourceMinimum__Const;             // 0x0194(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathFloatRemap_2_SourceMaximum__Const;             // 0x0198(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ModifyTransforms_5_1_2_1_1_ItemToModify__Const; // 0x01A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                MathVectorAdd_1_1_B__Const;                        // 0x01B0(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathFloatRemap_1_1_SourceMinimum__Const;           // 0x01BC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathFloatRemap_1_1_SourceMaximum__Const;           // 0x01C0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ModifyTransforms_5_1_2_ItemToModify__Const;     // 0x01C8(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         GetTransform_5_2_Item__Const;                      // 0x01D8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         GetTransform_5_2_3_Item__Const;                    // 0x01E4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ModifyTransforms_5_1_2_1_ItemToModify__Const;   // 0x01F0(0x0010)(Edit, EditConst, NonTransactional)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL_FULLNAME("RigVMMemoryStorageGeneratorClass M_MED_Parallel_Comic_Shoulders_CtrlRig.RigVMMemory_Literal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RigVMMemory_Literal")
	}
	static class M_MED_Parallel_Comic_Shoulders_CtrlRig::URigVMMemory_Literal* GetDefaultObj()
	{
		return GetDefaultObjImpl<M_MED_Parallel_Comic_Shoulders_CtrlRig::URigVMMemory_Literal>();
	}
};
DUMPER7_ASSERTS_M_MED_Parallel_Comic_Shoulders_CtrlRig__URigVMMemory_Literal;

// RigVMMemoryStorageGeneratorClass M_MED_Parallel_Comic_Shoulders_CtrlRig.RigVMMemory_Work
// 0x0C98 (0x0CC0 - 0x0028)
class M_MED_Parallel_Comic_Shoulders_CtrlRig::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FControlRigExecuteContext              ExecuteContext_;                                   // 0x0030(0x00C0)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionFromAxisAndAngle_1_1_1_1_2_Result;   // 0x00F0(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathQuaternionToAxisAndAngle_1_1_1_1_2_Axis;       // 0x0100(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionSwingTwist_1_1_1_1_2_Twist;          // 0x0110(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FTransform                             RigUnit_GetBoneTransform_1_1_1_1_2_Transform;      // 0x0120(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetBoneTransform_1_1_1_1_2_CachedBone;     // 0x0150(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionSwingTwist_1_1_1_1_2_Input;          // 0x0160(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FQuat                                  MathQuaternionSwingTwist_1_1_1_1_2_Swing;          // 0x0170(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         MathQuaternionToAxisAndAngle_1_1_1_1_2_Angle;      // 0x0180(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathFloatMul_3_1_1_1_1_2_Result;                   // 0x0184(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigUnit_SetBoneRotation_1_1_1_1_2_CachedBone;      // 0x0188(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_198[0x8];                                      // 0x0198(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromAxisAndAngle_1_1_1_1_Result;     // 0x01A0(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathQuaternionToAxisAndAngle_1_1_1_1_Axis;         // 0x01B0(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionSwingTwist_1_1_1_1_Twist;            // 0x01C0(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FTransform                             RigUnit_GetBoneTransform_1_1_1_1_Transform;        // 0x01D0(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetBoneTransform_1_1_1_1_CachedBone;       // 0x0200(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionSwingTwist_1_1_1_1_Input;            // 0x0210(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FQuat                                  MathQuaternionSwingTwist_1_1_1_1_Swing;            // 0x0220(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         MathQuaternionToAxisAndAngle_1_1_1_1_Angle;        // 0x0230(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathFloatMul_3_1_1_1_1_Result;                     // 0x0234(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigUnit_SetBoneRotation_1_1_1_1_CachedBone;        // 0x0238(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_248[0x8];                                      // 0x0248(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromAxisAndAngle_1_1_1_1_2_1_Result; // 0x0250(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathQuaternionToAxisAndAngle_1_1_1_1_2_1_Axis;     // 0x0260(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionSwingTwist_1_1_1_1_2_1_Twist;        // 0x0270(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FTransform                             RigUnit_GetBoneTransform_1_1_1_1_2_1_Transform;    // 0x0280(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetBoneTransform_1_1_1_1_2_1_CachedBone;   // 0x02B0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionSwingTwist_1_1_1_1_2_1_Input;        // 0x02C0(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FQuat                                  MathQuaternionSwingTwist_1_1_1_1_2_1_Swing;        // 0x02D0(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         MathQuaternionToAxisAndAngle_1_1_1_1_2_1_Angle;    // 0x02E0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathFloatMul_3_1_1_1_1_2_1_Result;                 // 0x02E4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigUnit_SetBoneRotation_1_1_1_1_2_1_CachedBone;    // 0x02E8(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_2F8[0x8];                                      // 0x02F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromAxisAndAngle_1_1_1_Result;       // 0x0300(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathQuaternionToAxisAndAngle_1_1_1_Axis;           // 0x0310(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionSwingTwist_1_1_1_Twist;              // 0x0320(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FTransform                             RigUnit_GetBoneTransform_1_1_1_Transform;          // 0x0330(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetBoneTransform_1_1_1_CachedBone;         // 0x0360(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionSwingTwist_1_1_1_Input;              // 0x0370(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FQuat                                  MathQuaternionSwingTwist_1_1_1_Swing;              // 0x0380(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         MathQuaternionToAxisAndAngle_1_1_1_Angle;          // 0x0390(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathFloatMul_3_1_1_1_Result;                       // 0x0394(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigUnit_SetBoneRotation_1_1_1_CachedBone;          // 0x0398(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromEuler_1_4_1_1_2_1_1_Result;      // 0x03B0(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_1_1_2_1_1_Result;                    // 0x03C0(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_1_1_2_1_1_Result;          // 0x03CC(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D8[0x8];                                      // 0x03D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             GetTransform_5_1_1_Transform;                      // 0x03E0(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              GetTransform_5_1_1_CachedIndex;                    // 0x0410(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_1_1_2_1_1_Value;           // 0x0420(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ModifyTransforms_5_1_1_1_ItemToModify__IO;      // 0x0430(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> ModifyTransforms_5_1_1_1_WorkData;             // 0x0440(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionFromEuler_4_1_2_1_Result;            // 0x0450(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_3_2_1_Result;                        // 0x0460(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_3_2_1_Result;              // 0x046C(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_478[0x8];                                      // 0x0478(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             GetTransform_4_1_Transform;                        // 0x0480(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              GetTransform_4_1_CachedIndex;                      // 0x04B0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_3_2_1_Value;               // 0x04C0(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ModifyTransforms_5_2_ItemToModify__IO;          // 0x04D0(0x0010)(Edit, EditConst, NonTransactional)
	float                                         MathFloatRemap_4_1_2_1_1_Result;                   // 0x04E0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_1_Result;                    // 0x04E4(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  MathQuaternionSwingTwist_3_1_Swing;                // 0x04F0(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FTransform                             MathTransformMakeRelative_3_1_2_Local;             // 0x0500(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FTransform                             GetTransform_6_2_2_Transform;                      // 0x0530(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              GetTransform_6_2_2_CachedIndex;                    // 0x0560(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             GetTransform_6_1_1_2_Transform;                    // 0x0570(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              GetTransform_6_1_1_2_CachedIndex;                  // 0x05A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionSwingTwist_3_1_Input;                // 0x05B0(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FQuat                                  MathQuaternionSwingTwist_3_1_Twist;                // 0x05C0(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         MathFloatRemap_4_1_2_1_1_Value;                    // 0x05D0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D4[0x4];                                      // 0x05D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_WorkData> ModifyTransforms_5_2_WorkData;                 // 0x05D8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> ModifyTransforms_5_1_1_WorkData;               // 0x05E8(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_5F8[0x8];                                      // 0x05F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromEuler_4_1_2_Result;              // 0x0600(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_3_2_Result;                          // 0x0610(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_3_2_Result;                // 0x061C(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_628[0x8];                                      // 0x0628(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             GetTransform_4_Transform;                          // 0x0630(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              GetTransform_4_CachedIndex;                        // 0x0660(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_3_2_Value;                 // 0x0670(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ModifyTransforms_5_ItemToModify__IO;            // 0x0680(0x0010)(Edit, EditConst, NonTransactional)
	float                                         MathFloatRemap_4_1_2_1_Result;                     // 0x0690(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_Result;                      // 0x0694(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  MathQuaternionSwingTwist_3_Swing;                  // 0x06A0(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FTransform                             MathTransformMakeRelative_3_1_1_1_Local;           // 0x06B0(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FTransform                             GetTransform_6_2_1_1_Transform;                    // 0x06E0(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              GetTransform_6_2_1_1_CachedIndex;                  // 0x0710(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             GetTransform_6_1_1_1_1_Transform;                  // 0x0720(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              GetTransform_6_1_1_1_1_CachedIndex;                // 0x0750(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionSwingTwist_3_Input;                  // 0x0760(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FQuat                                  MathQuaternionSwingTwist_3_Twist;                  // 0x0770(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         MathFloatRemap_4_1_2_1_Value;                      // 0x0780(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_784[0x4];                                      // 0x0784(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_WorkData> ModifyTransforms_5_WorkData;                   // 0x0788(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_798[0x8];                                      // 0x0798(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromEuler_1_4_1_1_2_Result;          // 0x07A0(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_1_1_2_Result;                        // 0x07B0(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_1_1_2_Result;              // 0x07BC(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C8[0x8];                                      // 0x07C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             GetTransform_5_Transform;                          // 0x07D0(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              GetTransform_5_CachedIndex;                        // 0x0800(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_1_1_2_Value;               // 0x0810(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ModifyTransforms_5_1_ItemToModify__IO;          // 0x0820(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyTransforms_WorkData> ModifyTransforms_5_1_WorkData;                 // 0x0830(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionFromEuler_2_Result;                  // 0x0840(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_2_Result;                            // 0x0850(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_2_2_Result;                  // 0x085C(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_868[0x8];                                      // 0x0868(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             GetTransform_5_2_2_Transform;                      // 0x0870(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              GetTransform_5_2_2_CachedIndex;                    // 0x08A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_2_2_Value;                   // 0x08B0(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ModifyTransforms_5_1_2_2_ItemToModify__IO;      // 0x08C0(0x0010)(Edit, EditConst, NonTransactional)
	float                                         MathFloatRemap_2_Result;                           // 0x08D0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_3_1_Result;                  // 0x08D4(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             MathTransformMakeRelative_3_2_1_Local;             // 0x08E0(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FTransform                             GetTransform_5_2_3_1_Transform;                    // 0x0910(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              GetTransform_5_2_3_1_CachedIndex;                  // 0x0940(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             GetTransform_6_1_2_1_Transform;                    // 0x0950(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              GetTransform_6_1_2_1_CachedIndex;                  // 0x0980(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_3_1_Value;                   // 0x0990(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         MathFloatRemap_2_Value;                            // 0x09A0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A4[0x4];                                      // 0x09A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_WorkData> ModifyTransforms_5_1_2_2_WorkData;             // 0x09A8(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_9B8[0x8];                                      // 0x09B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromEuler_1_1_Result;                // 0x09C0(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_1_1_Result;                          // 0x09D0(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_2_1_1_Result;                // 0x09DC(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E8[0x8];                                      // 0x09E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             GetTransform_5_2_1_1_Transform;                    // 0x09F0(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              GetTransform_5_2_1_1_CachedIndex;                  // 0x0A20(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_2_1_1_Value;                 // 0x0A30(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ModifyTransforms_5_1_2_1_1_ItemToModify__IO;    // 0x0A40(0x0010)(Edit, EditConst, NonTransactional)
	float                                         MathFloatRemap_1_1_Result;                         // 0x0A50(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A54[0x4];                                      // 0x0A54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_WorkData> ModifyTransforms_5_1_2_1_1_WorkData;           // 0x0A58(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_A68[0x8];                                      // 0x0A68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromEuler_Result;                    // 0x0A70(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_Result;                              // 0x0A80(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_2_Result;                    // 0x0A8C(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A98[0x8];                                      // 0x0A98(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             GetTransform_5_2_Transform;                        // 0x0AA0(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              GetTransform_5_2_CachedIndex;                      // 0x0AD0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_2_Value;                     // 0x0AE0(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ModifyTransforms_5_1_2_ItemToModify__IO;        // 0x0AF0(0x0010)(Edit, EditConst, NonTransactional)
	float                                         MathFloatRemap_Result;                             // 0x0B00(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_3_Result;                    // 0x0B04(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  MathQuaternionSwingTwist_2_Swing;                  // 0x0B10(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FTransform                             MathTransformMakeRelative_3_2_Local;               // 0x0B20(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FTransform                             GetTransform_5_2_3_Transform;                      // 0x0B50(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              GetTransform_5_2_3_CachedIndex;                    // 0x0B80(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             GetTransform_6_1_2_Transform;                      // 0x0B90(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              GetTransform_6_1_2_CachedIndex;                    // 0x0BC0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionSwingTwist_2_Input;                  // 0x0BD0(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FQuat                                  MathQuaternionSwingTwist_2_Twist;                  // 0x0BE0(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         MathFloatRemap_Value;                              // 0x0BF0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF4[0x4];                                      // 0x0BF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_WorkData> ModifyTransforms_5_1_2_WorkData;               // 0x0BF8(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_C08[0x8];                                      // 0x0C08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromEuler_1_Result;                  // 0x0C10(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_1_Result;                            // 0x0C20(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_2_1_Result;                  // 0x0C2C(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C38[0x8];                                      // 0x0C38(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             GetTransform_5_2_1_Transform;                      // 0x0C40(0x0030)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              GetTransform_5_2_1_CachedIndex;                    // 0x0C70(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_2_1_Value;                   // 0x0C80(0x0010)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyTransforms_PerItem> ModifyTransforms_5_1_2_1_ItemToModify__IO;      // 0x0C90(0x0010)(Edit, EditConst, NonTransactional)
	float                                         MathFloatRemap_1_Result;                           // 0x0CA0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA4[0x4];                                      // 0x0CA4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyTransforms_WorkData> ModifyTransforms_5_1_2_1_WorkData;             // 0x0CA8(0x0010)(Edit, EditConst, NonTransactional)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL_FULLNAME("RigVMMemoryStorageGeneratorClass M_MED_Parallel_Comic_Shoulders_CtrlRig.RigVMMemory_Work")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RigVMMemory_Work")
	}
	static class M_MED_Parallel_Comic_Shoulders_CtrlRig::URigVMMemory_Work* GetDefaultObj()
	{
		return GetDefaultObjImpl<M_MED_Parallel_Comic_Shoulders_CtrlRig::URigVMMemory_Work>();
	}
};
DUMPER7_ASSERTS_M_MED_Parallel_Comic_Shoulders_CtrlRig__URigVMMemory_Work;

}

