#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MadmanRuntime

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "PhosphorusRuntime_classes.hpp"


namespace SDK
{

// Class MadmanRuntime.FortPoiVolume_Madman
// 0x0008 (0x02B8 - 0x02B0)
class AFortPoiVolume_Madman final : public AFortPoiVolume
{
public:
	float                                         StartingSpawnYawAngle;                             // 0x02B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPoiVolume_Madman")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPoiVolume_Madman")
	}
	static class AFortPoiVolume_Madman* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortPoiVolume_Madman>();
	}
};
DUMPER7_ASSERTS_AFortPoiVolume_Madman;

// Class MadmanRuntime.FortAthenaMutator_Madman
// 0x0010 (0x06E0 - 0x06D0)
class AFortAthenaMutator_Madman final : public AFortAthenaMutator_TDM
{
public:
	uint8                                         Pad_6D0[0x10];                                     // 0x06D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaMutator_Madman")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaMutator_Madman")
	}
	static class AFortAthenaMutator_Madman* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_Madman>();
	}
};
DUMPER7_ASSERTS_AFortAthenaMutator_Madman;

// Class MadmanRuntime.FortAthenaMutator_Madman_PlayerSpawnPod
// 0x00F8 (0x0900 - 0x0808)
class AFortAthenaMutator_Madman_PlayerSpawnPod final : public AFortAthenaMutator_PlayerSpawnPod
{
public:
	uint8                                         Pad_808[0x8];                                      // 0x0808(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         InnerLandRadiusPercent;                            // 0x0810(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         OuterLandRadiusPercent;                            // 0x0838(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         TeamLandWedgePercentUsed;                          // 0x0860(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SpawnCampingNumberOfSpawnLocationsToEvaluate;      // 0x0888(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_8B0[0x28];                                     // 0x08B0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaMutator_SpawnCampingDetection* SpawnCampingDetectionMutator;                    // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8E0[0x20];                                     // 0x08E0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnGamePhaseChanged(EAthenaGamePhase NewPhase);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaMutator_Madman_PlayerSpawnPod")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaMutator_Madman_PlayerSpawnPod")
	}
	static class AFortAthenaMutator_Madman_PlayerSpawnPod* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_Madman_PlayerSpawnPod>();
	}
};
DUMPER7_ASSERTS_AFortAthenaMutator_Madman_PlayerSpawnPod;

// Class MadmanRuntime.SpawnCampingDetection_PawnComponent
// 0x0018 (0x00C8 - 0x00B0)
class USpawnCampingDetection_PawnComponent final : public UFortPawnComponent
{
public:
	uint8                                         Pad_B0[0x10];                                      // 0x00B0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaMutator_SpawnCampingDetection* OwningMutator;                                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnDamaged(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnCampingDetection_PawnComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnCampingDetection_PawnComponent")
	}
	static class USpawnCampingDetection_PawnComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnCampingDetection_PawnComponent>();
	}
};
DUMPER7_ASSERTS_USpawnCampingDetection_PawnComponent;

// Class MadmanRuntime.SpawnCampingDetectionConsumer
// 0x0000 (0x0000 - 0x0000)
class ISpawnCampingDetectionConsumer final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnCampingDetectionConsumer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnCampingDetectionConsumer")
	}
	static class ISpawnCampingDetectionConsumer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISpawnCampingDetectionConsumer>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ISpawnCampingDetectionConsumer;

// Class MadmanRuntime.FortCheatManager_SpawnCampingDetection
// 0x0000 (0x0038 - 0x0038)
class UFortCheatManager_SpawnCampingDetection final : public UFortCheatManager_Coupled
{
public:
	void SpawnCampingDetectionSetEnabled(const bool bInEnable);
	void SpawnCampingDetectionTriggerPawnWasSpawnCampDamaged();
	void SpawnCampingDetectionTriggerSpawnCamp(const uint8 TeamId, const int32 SpawnCampType);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortCheatManager_SpawnCampingDetection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortCheatManager_SpawnCampingDetection")
	}
	static class UFortCheatManager_SpawnCampingDetection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_SpawnCampingDetection>();
	}
};
DUMPER7_ASSERTS_UFortCheatManager_SpawnCampingDetection;

// Class MadmanRuntime.SynchronizedTeleportPlayerComponent_Madman
// 0x0010 (0x0118 - 0x0108)
class USynchronizedTeleportPlayerComponent_Madman final : public USynchronizedTeleportPlayerComponent
{
public:
	class USoundMix*                              FirstLoadingScreenSoundMix;                        // 0x0108(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SynchronizedTeleportPlayerComponent_Madman")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SynchronizedTeleportPlayerComponent_Madman")
	}
	static class USynchronizedTeleportPlayerComponent_Madman* GetDefaultObj()
	{
		return GetDefaultObjImpl<USynchronizedTeleportPlayerComponent_Madman>();
	}
};
DUMPER7_ASSERTS_USynchronizedTeleportPlayerComponent_Madman;

// Class MadmanRuntime.FortAthenaMutator_SpawnCampingDetection
// 0x02A8 (0x0570 - 0x02C8)
class AFortAthenaMutator_SpawnCampingDetection final : public AFortAthenaMutator
{
public:
	uint8                                         Pad_2C8[0x31];                                     // 0x02C8(0x0031)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bOnSpawnCampingDetectedAutomaticallySuggestSpawnLocation; // 0x02F9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2FA[0x6];                                      // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class USpawnCampingDetection_PawnComponent> PawnComponentClass;                      // 0x0300(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SpawnCampDamageTrackingDuration;                   // 0x0308(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SpawnCampDamageTrackingDamageThreshold;            // 0x0330(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SpawnCampDamageTrackingAffectedPlayersThreshold;   // 0x0358(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SpawnCampDamageTrackingAffectedPlayersDuration;    // 0x0380(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         EnemyProximityDistance;                            // 0x03A8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bEnableSpawnCampDetectionViaEnemyProximity;        // 0x03D0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NumberOfRespawnsTilEnemyProximityReevaluation;     // 0x03F8(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinPercentOfNearbyEnemiesToTriggerSpawnLocationReevaluation; // 0x0420(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinNumberOfNearbyEnemiesToTriggerSpawnLocationReevaluation; // 0x0448(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinTimeBetweenSpawnCampSuggestions;                // 0x0470(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bApplySpawnCampSuggestionCooldownOnRejectedSuggestions; // 0x0498(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C0[0x50];                                     // 0x04C0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                SpawnCampingDetectionConsumerObject;               // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_518[0x58];                                     // 0x0518(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearLastSpawnLocationSuggestionTime();

	bool AreSpawnLocationSuggestionsOnCooldown() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaMutator_SpawnCampingDetection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaMutator_SpawnCampingDetection")
	}
	static class AFortAthenaMutator_SpawnCampingDetection* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_SpawnCampingDetection>();
	}
};
DUMPER7_ASSERTS_AFortAthenaMutator_SpawnCampingDetection;

}

