#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MadmanRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function MadmanRuntime.FortAthenaMutator_Madman_PlayerSpawnPod.OnGamePhaseChanged
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Madman_PlayerSpawnPod_OnGamePhaseChanged final
{
public:
	EAthenaGamePhase                              NewPhase;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Madman_PlayerSpawnPod_OnGamePhaseChanged;

// Function MadmanRuntime.SpawnCampingDetection_PawnComponent.OnDamaged
// 0x0050 (0x0050 - 0x0000)
struct SpawnCampingDetection_PawnComponent_OnDamaged final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SpawnCampingDetection_PawnComponent_OnDamaged;

// Function MadmanRuntime.FortCheatManager_SpawnCampingDetection.SpawnCampingDetectionSetEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortCheatManager_SpawnCampingDetection_SpawnCampingDetectionSetEnabled final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_SpawnCampingDetection_SpawnCampingDetectionSetEnabled;

// Function MadmanRuntime.FortCheatManager_SpawnCampingDetection.SpawnCampingDetectionTriggerSpawnCamp
// 0x0008 (0x0008 - 0x0000)
struct FortCheatManager_SpawnCampingDetection_SpawnCampingDetectionTriggerSpawnCamp final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpawnCampType;                                     // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_SpawnCampingDetection_SpawnCampingDetectionTriggerSpawnCamp;

// Function MadmanRuntime.FortAthenaMutator_SpawnCampingDetection.AreSpawnLocationSuggestionsOnCooldown
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_SpawnCampingDetection_AreSpawnLocationSuggestionsOnCooldown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_SpawnCampingDetection_AreSpawnLocationSuggestionsOnCooldown;

}

