#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MilitaryBase_Door_01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Parent_BuildingWall_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MilitaryBase_Door_01.MilitaryBase_Door_01_C
// 0x0090 (0x0E88 - 0x0DF8)
class AMilitaryBase_Door_01_C final : public AParent_BuildingWall_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0DF8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          DoorSlideOverlapVolume;                            // 0x0E00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DoorStaticMesh1;                                   // 0x0E08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_EmissiveColorLerp_75727DFA4F9CA24A009D23ADC967876F; // 0x0E10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_SlideAnimation_75727DFA4F9CA24A009D23ADC967876F; // 0x0E14(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_75727DFA4F9CA24A009D23ADC967876F; // 0x0E18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E19[0x7];                                      // 0x0E19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0E20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumberOfPawnsWithinVolume;                         // 0x0E28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoorOpen;                                          // 0x0E2C(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2D[0x3];                                      // 0x0E2D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DoorMID;                                           // 0x0E30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultDoorEmissiveValue;                          // 0x0E38(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ActiveDoorEmissiveValue;                           // 0x0E48(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     DoorBaseMaterial;                                  // 0x0E58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Door_Source_Materials;                             // 0x0E60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SlidingDoorClose_Sound;                            // 0x0E68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SlidingDoorOpen_Sound;                             // 0x0E70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnDoorOpened;                                      // 0x0E78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__DoorSlideOverlapVolume_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void Close(class AController* ControllerInstigator);
	void CloseDoor();
	void ExecuteUbergraph_MilitaryBase_Door_01(int32 EntryPoint);
	TArray<class UPrimitiveComponent*> GetComponentToLock();
	void GetDoorMID();
	void OnLocked();
	void OnRep_DoorOpen();
	void OnUnLocked();
	void Open(class AController* ControllerInstigator);
	void OpenDoor();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void UserConstructionScript();

	bool IsOpen() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MilitaryBase_Door_01_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MilitaryBase_Door_01_C")
	}
	static class AMilitaryBase_Door_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMilitaryBase_Door_01_C>();
	}
};
DUMPER7_ASSERTS_AMilitaryBase_Door_01_C;

}

