#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MoleUI

#include "Basic.hpp"

#include "MoleGameRuntime_structs.hpp"
#include "MoleGameRuntime_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonUI_classes.hpp"
#include "InputCore_structs.hpp"
#include "CommonUILegacy_structs.hpp"
#include "MoleUI_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ModularGameplay_classes.hpp"
#include "GameplayMessages_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "DynamicUI_classes.hpp"


namespace SDK
{

// Class MoleUI.MoleEnemyAbilityItem
// 0x0158 (0x0180 - 0x0028)
class UMoleEnemyAbilityItem final : public UObject
{
public:
	uint8                                         Pad_28[0xE8];                                      // 0x0028(0x00E8)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMoleAbilityUIData                     EnemyAbilityUIData;                                // 0x0110(0x0058)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         Pad_168[0x18];                                     // 0x0168(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetIndex() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleEnemyAbilityItem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleEnemyAbilityItem")
	}
	static class UMoleEnemyAbilityItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleEnemyAbilityItem>();
	}
};
DUMPER7_ASSERTS_UMoleEnemyAbilityItem;

// Class MoleUI.FortMobileButtonBehaviorComponent_MoleRoleVisibility
// 0x0050 (0x0080 - 0x0030)
class UFortMobileButtonBehaviorComponent_MoleRoleVisibility final : public UFortMobileButtonBehaviorComponent_Visibility
{
public:
	TMap<EMoleRole, ESlateVisibility>             RoleVisibility;                                    // 0x0030(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMobileButtonBehaviorComponent_MoleRoleVisibility")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMobileButtonBehaviorComponent_MoleRoleVisibility")
	}
	static class UFortMobileButtonBehaviorComponent_MoleRoleVisibility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileButtonBehaviorComponent_MoleRoleVisibility>();
	}
};
DUMPER7_ASSERTS_UFortMobileButtonBehaviorComponent_MoleRoleVisibility;

// Class MoleUI.MoleActiveTaskContextBarHUDWidget
// 0x0008 (0x0250 - 0x0248)
class UMoleActiveTaskContextBarHUDWidget final : public UUserWidget
{
public:
	class UMolePlayerTaskManagementComponent*     CachedOwningTaskComponent;                         // 0x0248(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleActiveTaskContextBarHUDWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleActiveTaskContextBarHUDWidget")
	}
	static class UMoleActiveTaskContextBarHUDWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleActiveTaskContextBarHUDWidget>();
	}
};
DUMPER7_ASSERTS_UMoleActiveTaskContextBarHUDWidget;

// Class MoleUI.MoleVoteTally
// 0x0028 (0x0270 - 0x0248)
class UMoleVoteTally final : public UUserWidget
{
public:
	TArray<class APlayerState*>                   VoteList;                                          // 0x0248(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_258[0x10];                                     // 0x0258(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTileView*                        TileView_Votes;                                    // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnVoteTallyStarted(bool bIsSkipTally);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleVoteTally")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleVoteTally")
	}
	static class UMoleVoteTally* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleVoteTally>();
	}
};
DUMPER7_ASSERTS_UMoleVoteTally;

// Class MoleUI.MoleAssignedTaskContainerWidget
// 0x0010 (0x0258 - 0x0248)
class UMoleAssignedTaskContainerWidget final : public UUserWidget
{
public:
	class UDynamicEntryBox*                       TaskWidgetEntryBox;                                // 0x0248(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMolePlayerTaskManagementComponent*     CachedOwningTaskComponent;                         // 0x0250(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnActiveTasksChanged(bool bFrameDefer);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleAssignedTaskContainerWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleAssignedTaskContainerWidget")
	}
	static class UMoleAssignedTaskContainerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleAssignedTaskContainerWidget>();
	}
};
DUMPER7_ASSERTS_UMoleAssignedTaskContainerWidget;

// Class MoleUI.MoleControllerBinding
// 0x0020 (0x0268 - 0x0248)
class UMoleControllerBinding final : public UUserWidget
{
public:
	struct FKey                                   RepresentedKey;                                    // 0x0248(0x0018)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortKeybindWidget*                     KeyBind_RepresentedAction;                         // 0x0260(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnBindingInfoSet(const class FText& BindingLabel, bool bIsSaboteurBinding);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleControllerBinding")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleControllerBinding")
	}
	static class UMoleControllerBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleControllerBinding>();
	}
};
DUMPER7_ASSERTS_UMoleControllerBinding;

// Class MoleUI.MoleQuickChatPlayersWidget
// 0x0080 (0x03B0 - 0x0330)
class UMoleQuickChatPlayersWidget final : public UCommonActivatableWidget
{
public:
	bool                                          bIsSkipButtonEnabled;                              // 0x0330(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlay*                               Overlay_Players;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Skip;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_348[0x48];                                     // 0x0348(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        PlayersInputComponent;                             // 0x0390(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UMoleQuickChatPlayerEntry*>      PlayerButtons;                                     // 0x0398(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnFilterChanged();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleQuickChatPlayersWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleQuickChatPlayersWidget")
	}
	static class UMoleQuickChatPlayersWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatPlayersWidget>();
	}
};
DUMPER7_ASSERTS_UMoleQuickChatPlayersWidget;

// Class MoleUI.MoleControllerBindingsScreen
// 0x0058 (0x03C0 - 0x0368)
class UMoleControllerBindingsScreen final : public UFortOptionsTab
{
public:
	TMap<ECommonGamepadType, TSoftObjectPtr<class UObject>> ControllerImages;                        // 0x0368(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UCommonLazyImage*                       Image_Controller;                                  // 0x03B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleControllerBindingsScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleControllerBindingsScreen")
	}
	static class UMoleControllerBindingsScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleControllerBindingsScreen>();
	}
};
DUMPER7_ASSERTS_UMoleControllerBindingsScreen;

// Class MoleUI.MoleEnemyAbilityContainer
// 0x0018 (0x0260 - 0x0248)
class UMoleEnemyAbilityContainer final : public UUserWidget
{
public:
	class UDataTable*                             AbilityUIDataTable;                                // 0x0248(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonListView*                        Listview_EnemyTasks;                               // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMoleEnemyAbilityWidgetComponent*       OwnerWidgetComponent;                              // 0x0258(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnVisibilityChangeRequested(bool bNewVisibility);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleEnemyAbilityContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleEnemyAbilityContainer")
	}
	static class UMoleEnemyAbilityContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleEnemyAbilityContainer>();
	}
};
DUMPER7_ASSERTS_UMoleEnemyAbilityContainer;

// Class MoleUI.MoleEnemyAbilityEntry
// 0x0020 (0x0ED0 - 0x0EB0)
class UMoleEnemyAbilityEntry final : public UCommonButtonBase
{
public:
	uint8                                         Pad_EA8[0x18];                                     // 0x0EA8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsInteractable;                                   // 0x0EC0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EC1[0x7];                                      // 0x0EC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMoleEnemyAbilityOverlay*               Overlay_EnemyAbilities;                            // 0x0EC8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnAbilityDataReceived(class UMoleEnemyAbilityItem* Data);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleEnemyAbilityEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleEnemyAbilityEntry")
	}
	static class UMoleEnemyAbilityEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleEnemyAbilityEntry>();
	}
};
DUMPER7_ASSERTS_UMoleEnemyAbilityEntry;

// Class MoleUI.MoleQuickChatRadialSlot
// 0x0040 (0x0F90 - 0x0F50)
class UMoleQuickChatRadialSlot : public UFortRadialSlot
{
public:
	struct FLinearColor                           CategoryColor;                                     // 0x0F48(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>              CategoryImage;                                     // 0x0F58(0x0028)(BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   RichText_Main;                                     // 0x0F80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F88[0x8];                                      // 0x0F88(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnUpdated();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleQuickChatRadialSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleQuickChatRadialSlot")
	}
	static class UMoleQuickChatRadialSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatRadialSlot>();
	}
};
DUMPER7_ASSERTS_UMoleQuickChatRadialSlot;

// Class MoleUI.MoleQuickChatCategorySlot
// 0x0000 (0x0F90 - 0x0F90)
class UMoleQuickChatCategorySlot final : public UMoleQuickChatRadialSlot
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleQuickChatCategorySlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleQuickChatCategorySlot")
	}
	static class UMoleQuickChatCategorySlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatCategorySlot>();
	}
};
DUMPER7_ASSERTS_UMoleQuickChatCategorySlot;

// Class MoleUI.MoleEnemyAbilityOverlay
// 0x0020 (0x0268 - 0x0248)
class UMoleEnemyAbilityOverlay final : public UUserWidget
{
public:
	uint8                                         Pad_248[0x10];                                     // 0x0248(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UMoleEnemyAbilityItem*                  EnemyAbilityItem;                                  // 0x0258(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_260[0x8];                                      // 0x0260(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAbilityDataReceived(const struct FMoleAbilityUIData& InAbilityUIData);
	void OnCooldownFinished();
	void OnCooldownStarted(int32 TimeLeft);
	void OnCooldownUpdated(int32 TimeLeft);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleEnemyAbilityOverlay")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleEnemyAbilityOverlay")
	}
	static class UMoleEnemyAbilityOverlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleEnemyAbilityOverlay>();
	}
};
DUMPER7_ASSERTS_UMoleEnemyAbilityOverlay;

// Class MoleUI.MoleEnemyAbilityWidgetComponent
// 0x0040 (0x05E0 - 0x05A0)
class UMoleEnemyAbilityWidgetComponent final : public UWidgetComponent
{
public:
	class UInputComponent*                        EnemyMenuInputComponent;                           // 0x05A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputComponent*                        InternalBindingsInputComponent;                    // 0x05A8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                WidgetRelativeLocation;                            // 0x05B0(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                WidgetRelativeScale;                               // 0x05BC(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               WidgetRelativeRotation;                            // 0x05C8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D4[0xC];                                      // 0x05D4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool AreSabotageShortcutsEnabled();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleEnemyAbilityWidgetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleEnemyAbilityWidgetComponent")
	}
	static class UMoleEnemyAbilityWidgetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleEnemyAbilityWidgetComponent>();
	}
};
DUMPER7_ASSERTS_UMoleEnemyAbilityWidgetComponent;

// Class MoleUI.MoleLocationWidget
// 0x0008 (0x0250 - 0x0248)
class UMoleLocationWidget final : public UUserWidget
{
public:
	class UFortControllerComponent_MapDiscoverability* DiscoverabilityComponent;                     // 0x0248(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnVisited(const class FText& LocalizedLocationName, bool bIsNamedLocation);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleLocationWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleLocationWidget")
	}
	static class UMoleLocationWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleLocationWidget>();
	}
};
DUMPER7_ASSERTS_UMoleLocationWidget;

// Class MoleUI.MoleQuickChatWidgetProxy
// 0x0050 (0x0298 - 0x0248)
class UMoleQuickChatWidgetProxy final : public UUserWidget
{
public:
	TSubclassOf<class UMoleQuickChatUIComponent>  QuickChatUIComponentClass;                         // 0x0248(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   ActiveClass;                                       // 0x0250(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_278[0x20];                                     // 0x0278(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEnter();
	void OnQuickChatClosed();
	void OnQuickChatOpened();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleQuickChatWidgetProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleQuickChatWidgetProxy")
	}
	static class UMoleQuickChatWidgetProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatWidgetProxy>();
	}
};
DUMPER7_ASSERTS_UMoleQuickChatWidgetProxy;

// Class MoleUI.MoleMinimap
// 0x00D0 (0x01D0 - 0x0100)
class UMoleMinimap final : public UWidget
{
public:
	struct FSlateBrush                            MolePlayerIcon;                                    // 0x0100(0x00B0)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                              DesiredSize;                                       // 0x01B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                MapCenterOffset;                                   // 0x01B8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          ShowMapBackground;                                 // 0x01C4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ZoomLevel;                                         // 0x01C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinimapIndicatorZoomLevel;                         // 0x01CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleMinimap")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleMinimap")
	}
	static class UMoleMinimap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleMinimap>();
	}
};
DUMPER7_ASSERTS_UMoleMinimap;

// Class MoleUI.MoleMobileLoaderWidget
// 0x0020 (0x0268 - 0x0248)
class UMoleMobileLoaderWidget final : public UUserWidget
{
public:
	uint8                                         Pad_248[0x20];                                     // 0x0248(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleMobileLoaderWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleMobileLoaderWidget")
	}
	static class UMoleMobileLoaderWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleMobileLoaderWidget>();
	}
};
DUMPER7_ASSERTS_UMoleMobileLoaderWidget;

// Class MoleUI.MoleNameplate
// 0x0008 (0x0250 - 0x0248)
class UMoleNameplate final : public UUserWidget
{
public:
	class UFortVoiceChatStatusIcon*               VoiceIcon_Status;                                  // 0x0248(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetupNameplateFor(class APlayerState* OwningPlayer);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleNameplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleNameplate")
	}
	static class UMoleNameplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleNameplate>();
	}
};
DUMPER7_ASSERTS_UMoleNameplate;

// Class MoleUI.MoleQuickChatActionSlot
// 0x0000 (0x0F90 - 0x0F90)
class UMoleQuickChatActionSlot final : public UMoleQuickChatRadialSlot
{
public:
	void OnIsAvailableChanged(const bool bIsAvailable);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleQuickChatActionSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleQuickChatActionSlot")
	}
	static class UMoleQuickChatActionSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatActionSlot>();
	}
};
DUMPER7_ASSERTS_UMoleQuickChatActionSlot;

// Class MoleUI.MolePostGameScreen
// 0x0048 (0x0290 - 0x0248)
class UMolePostGameScreen final : public UUserWidget
{
public:
	class UInputComponent*                        PostGameInputComponent;                            // 0x0248(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMoleHoldBinding                       BackToMenuBinding;                                 // 0x0250(0x0020)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         MobileAutoGoBackToMenuTime;                        // 0x0270(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_274[0x14];                                     // 0x0274(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaAccoladeListWidget*              Listview_Accolades;                                // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnXPCalculated(int32 XPValue);
	void StartMobileAutoGoBackToMenu();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MolePostGameScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MolePostGameScreen")
	}
	static class UMolePostGameScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMolePostGameScreen>();
	}
};
DUMPER7_ASSERTS_UMolePostGameScreen;

// Class MoleUI.MolePrimaryActiveTaskHUDWidget
// 0x0010 (0x0258 - 0x0248)
class UMolePrimaryActiveTaskHUDWidget final : public UUserWidget
{
public:
	class UMolePlayerTaskManagementComponent*     CachedOwningTaskComponent;                         // 0x0248(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMoleTaskHUDWidget*                     MoleTaskHUDWidget;                                 // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MolePrimaryActiveTaskHUDWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MolePrimaryActiveTaskHUDWidget")
	}
	static class UMolePrimaryActiveTaskHUDWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMolePrimaryActiveTaskHUDWidget>();
	}
};
DUMPER7_ASSERTS_UMolePrimaryActiveTaskHUDWidget;

// Class MoleUI.MoleQuickChatLogWidget
// 0x0050 (0x0380 - 0x0330)
class UMoleQuickChatLogWidget final : public UCommonActivatableWidget
{
public:
	class FText                                   SelfMessageLogTitle;                               // 0x0330(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   SelectedTokenFormat;                               // 0x0348(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class UListView*                              ListView_MessageLog;                               // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UMoleQuickChatMessageItem*>      MessageLog;                                        // 0x0368(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_378[0x8];                                      // 0x0378(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnFirstMessageReceived();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleQuickChatLogWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleQuickChatLogWidget")
	}
	static class UMoleQuickChatLogWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatLogWidget>();
	}
};
DUMPER7_ASSERTS_UMoleQuickChatLogWidget;

// Class MoleUI.MoleQuickChatMap
// 0x0060 (0x0390 - 0x0330)
class UMoleQuickChatMap final : public UCommonActivatableWidget
{
public:
	class UMoleQuickChatMapEntry*                 DefaultRoomWidgetToFocus;                          // 0x0330(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                           Panel_Locations;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_SkipLocation;                               // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_348[0x48];                                     // 0x0348(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleQuickChatMap")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleQuickChatMap")
	}
	static class UMoleQuickChatMap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatMap>();
	}
};
DUMPER7_ASSERTS_UMoleQuickChatMap;

// Class MoleUI.MoleQuickChatMapEntry
// 0x0040 (0x0EF0 - 0x0EB0)
class UMoleQuickChatMapEntry final : public UCommonButtonBase
{
public:
	struct FGameplayTag                           LocationTag;                                       // 0x0EA8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EB0[0x38];                                     // 0x0EB0(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBox*                         HBox_HerePin;                                      // 0x0EE8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnMapDataRetrieved(const struct FMoleLocationData& LocationData);
	void ResetCosmetics();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleQuickChatMapEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleQuickChatMapEntry")
	}
	static class UMoleQuickChatMapEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatMapEntry>();
	}
};
DUMPER7_ASSERTS_UMoleQuickChatMapEntry;

// Class MoleUI.MoleQuickChatPlayerEntry
// 0x0050 (0x0F00 - 0x0EB0)
class UMoleQuickChatPlayerEntry final : public UCommonButtonBase
{
public:
	class FName                                   PlayerPortraitColorAMaterialParameterName;         // 0x0EA8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PlayerPortraitColorBMaterialParameterName;         // 0x0EB0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsOnLowerRow;                                     // 0x0EB8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EB9[0x7];                                      // 0x0EB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           PlayerState;                                       // 0x0EC0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 PlayerName;                                        // 0x0EC8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsLocalPlayer;                                    // 0x0ED8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsGhost;                                          // 0x0ED9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsFilteredOut;                                    // 0x0EDA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EDB[0x5];                                      // 0x0EDB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonLazyImage*                       LazyImage_PlayerPortrait;                          // 0x0EE0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                               Size_Ghost;                                        // 0x0EE8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_PlayerNumber;                                 // 0x0EF0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_EF8[0x8];                                      // 0x0EF8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDataChanged();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleQuickChatPlayerEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleQuickChatPlayerEntry")
	}
	static class UMoleQuickChatPlayerEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatPlayerEntry>();
	}
};
DUMPER7_ASSERTS_UMoleQuickChatPlayerEntry;

// Class MoleUI.MoleQuickChatMessageItem
// 0x0040 (0x0068 - 0x0028)
class UMoleQuickChatMessageItem final : public UObject
{
public:
	uint8                                         Pad_28[0x38];                                      // 0x0028(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           PlayerState;                                       // 0x0060(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleQuickChatMessageItem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleQuickChatMessageItem")
	}
	static class UMoleQuickChatMessageItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatMessageItem>();
	}
};
DUMPER7_ASSERTS_UMoleQuickChatMessageItem;

// Class MoleUI.MoleQuickChatMessageEntry
// 0x0030 (0x0278 - 0x0248)
class UMoleQuickChatMessageEntry final : public UUserWidget
{
public:
	uint8                                         Pad_248[0x8];                                      // 0x0248(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class URichTextBlock*                         Text_Sender;                                       // 0x0250(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URichTextBlock*                         Text_Message;                                      // 0x0258(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFromSelf;                                       // 0x0260(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFromPreviousSender;                             // 0x0261(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           PlayerState;                                       // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItemDefinition*                    PlayerItemDefinition;                              // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void OnDataChanged();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleQuickChatMessageEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleQuickChatMessageEntry")
	}
	static class UMoleQuickChatMessageEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatMessageEntry>();
	}
};
DUMPER7_ASSERTS_UMoleQuickChatMessageEntry;

// Class MoleUI.MoleQuickChatUIComponent
// 0x00B8 (0x0168 - 0x00B0)
class UMoleQuickChatUIComponent final : public UPlayerStateComponent
{
public:
	TSoftObjectPtr<class UDataTable>              MessagesTable;                                     // 0x00B0(0x0028)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FMoleQuickChatMessageInfo, float> MessageSpamMap;                                    // 0x00D8(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FMoleQuickChatMessageSummary           MessagesSummary;                                   // 0x0128(0x0018)(Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FMoleQuickChatRawMessage>       MessageLog;                                        // 0x0140(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	float                                         MinimumTimeBetweenSameMessageSend;                 // 0x0150(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             LoadedMessagesTable;                               // 0x0158(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_160[0x8];                                      // 0x0160(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleQuickChatUIComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleQuickChatUIComponent")
	}
	static class UMoleQuickChatUIComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatUIComponent>();
	}
};
DUMPER7_ASSERTS_UMoleQuickChatUIComponent;

// Class MoleUI.MoleQuickChatWidget
// 0x0220 (0x0550 - 0x0330)
class UMoleQuickChatWidget final : public UCommonActivatableWidget
{
public:
	class FText                                   LeftBracketToken;                                  // 0x0330(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   RightBracketToken;                                 // 0x0348(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   AddPlayerToken;                                    // 0x0360(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   AddPlayerOptionalToken;                            // 0x0378(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   AddPlayerTitleToken;                               // 0x0390(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   AddGhostToken;                                     // 0x03A8(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   AddGhostOptionalToken;                             // 0x03C0(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   AddGhostTitleToken;                                // 0x03D8(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   AddLocationToken;                                  // 0x03F0(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   AddLocationOptionalToken;                          // 0x0408(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   AddLocationTitleToken;                             // 0x0420(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   SelectedTokenFormat;                               // 0x0438(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UMoleQuickChatRadialSlot>   CategoryWidgetClass;                               // 0x0450(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UMoleQuickChatRadialSlot>   ActionWidgetClass;                                 // 0x0458(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FMoleBlockedInput>              InputActionsToBlock;                               // 0x0460(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FMoleHoldBinding                       BackBinding;                                       // 0x0470(0x0020)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UOverlay*                               Overlay_Selections;                                // 0x0490(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*              Switcher_SelectionMethods;                         // 0x0498(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_Radial;                                    // 0x04A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_Players;                                   // 0x04A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_Map;                                       // 0x04B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMoleSlottedRadialMenu*                 Radial_Selections;                                 // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMoleQuickChatPlayersWidget*            MolePlayers_PlayerSelection;                       // 0x04C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMoleQuickChatMap*                      MoleMap_LocationSelection;                         // 0x04C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                               SizeBox_HotkeyBar;                                 // 0x04D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               Overlay_FullscreenContainer;                       // 0x04D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4E0[0x58];                                     // 0x04E0(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        QuickChatInputComponent;                           // 0x0538(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_540[0x10];                                     // 0x0540(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAvailable();
	void OnItemClicked();
	void OnMessageFailedToSend();
	void OnPreviewChanged(const class FText& Message);

	bool AreAcceptAndBackInverted() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleQuickChatWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleQuickChatWidget")
	}
	static class UMoleQuickChatWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleQuickChatWidget>();
	}
};
DUMPER7_ASSERTS_UMoleQuickChatWidget;

// Class MoleUI.MoleRoleColor
// 0x0090 (0x02B0 - 0x0220)
class AMoleRoleColor final : public AActor
{
public:
	struct FEventMessageTag                       PeelyPartyTag;                                     // 0x0220(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                TraceEndPointOffset;                               // 0x0228(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECollisionChannel                             TraceChannel;                                      // 0x0234(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_235[0x6B];                                     // 0x0235(0x006B)(Fixing Size After Last Property [ Dumper-7 ])
	class UDecalComponent*                        DecalComponent;                                    // 0x02A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Hide();
	void OnSetColor(const struct FLinearColor& Color);
	void SetColor(const struct FLinearColor& Color);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleRoleColor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleRoleColor")
	}
	static class AMoleRoleColor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMoleRoleColor>();
	}
};
DUMPER7_ASSERTS_AMoleRoleColor;

// Class MoleUI.MoleSaboteurBarEntry
// 0x0060 (0x02A8 - 0x0248)
class UMoleSaboteurBarEntry final : public UUserWidget
{
public:
	class FText                                   Name_0;                                            // 0x0248(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FName                                   TriggeringInputAction;                             // 0x0260(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  AbilitiesToTrack;                                  // 0x0268(0x0020)(Edit, NativeAccessSpecifierPrivate)
	bool                                          bTrackLowestCooldown;                              // 0x0288(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayAbilitySpec>           AbilitySpecsToTrack;                               // 0x0290(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UMoleTimer*                             Timer_EntryVisuals;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleSaboteurBarEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleSaboteurBarEntry")
	}
	static class UMoleSaboteurBarEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleSaboteurBarEntry>();
	}
};
DUMPER7_ASSERTS_UMoleSaboteurBarEntry;

// Class MoleUI.MoleSlottedRadialMenu
// 0x0020 (0x0370 - 0x0350)
class UMoleSlottedRadialMenu final : public UFortSlottedRadialMenu
{
public:
	class FName                                   PointerRotationMaterialParameterName;              // 0x0350(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AngleChangedEpsilon;                               // 0x0358(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 Image_Pointer;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCategorySelected(const class UFortRadialSlot* SelectedSlot, const TArray<struct FMoleQuickChatActionData>& Actions, const struct FLinearColor& CategoryColor, const TSoftObjectPtr<class UTexture2D>& CategoryImage);
	void OnRadialEntriesChanged(const bool bIsActions, const int32 NumEntries, const float Degrees);
	void OnRadialEntrySelected(int32 Index_0, class UUserWidget* SelectedEntry);
	void OnResetNavigation();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleSlottedRadialMenu")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleSlottedRadialMenu")
	}
	static class UMoleSlottedRadialMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleSlottedRadialMenu>();
	}
};
DUMPER7_ASSERTS_UMoleSlottedRadialMenu;

// Class MoleUI.MoleSubobjectiveIndicatorWidget
// 0x0010 (0x02F8 - 0x02E8)
class UMoleSubobjectiveIndicatorWidget final : public UFortActorIndicatorWidget
{
public:
	float                                         MaximumRelativeHeightBeforeOffset;                 // 0x02E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CollisionRelativeHeightOffset;                     // 0x02EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bIsScreenClamped : 1;                              // 0x02F0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnScreenClampChanged(bool bScreenClamped);
	void OnSetUsageMode(bool bUseGoalIndicatorMode);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleSubobjectiveIndicatorWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleSubobjectiveIndicatorWidget")
	}
	static class UMoleSubobjectiveIndicatorWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleSubobjectiveIndicatorWidget>();
	}
};
DUMPER7_ASSERTS_UMoleSubobjectiveIndicatorWidget;

// Class MoleUI.MoleTaskHUDWidget
// 0x0038 (0x0280 - 0x0248)
class UMoleTaskHUDWidget final : public UUserWidget
{
public:
	class UDynamicEntryBox*                       ObjectiveEntryBox;                                 // 0x0248(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUserWidget*                            TaskProgress;                                      // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMolePlayerTaskManagementComponent*     CachedOwningTaskComponent;                         // 0x0258(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMoleTaskDataAsset*                     CachedTaskDataAsset;                               // 0x0260(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMoleActiveTaskStateHandle             CachedTaskHandle;                                  // 0x0268(0x0004)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_26C[0xC];                                      // 0x026C(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bAttemptShowActiveObjectives : 1;                  // 0x0278(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRepresentedLogicPhaseChange();
	void OnRepresentedTaskChanged(const class UMoleTaskDataAsset* PreviousTaskAsset, const struct FMoleActiveTaskStateHandle& PreviousHandle);
	void RequestCompactMode();
	void SetAttemptShowActiveObjectives(bool bAttemptShow);
	void SetTaskAsset(class UMoleTaskDataAsset* TaskAsset);
	void SetTaskHandle(const struct FMoleActiveTaskStateHandle& TaskHandle);

	const class UMoleTaskDataAsset* GetTaskAsset() const;
	class FText GetTaskTitle() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleTaskHUDWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleTaskHUDWidget")
	}
	static class UMoleTaskHUDWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskHUDWidget>();
	}
};
DUMPER7_ASSERTS_UMoleTaskHUDWidget;

// Class MoleUI.MoleTaskObjectiveHUDWidget
// 0x0008 (0x0250 - 0x0248)
class UMoleTaskObjectiveHUDWidget final : public UUserWidget
{
public:
	uint8                                         Pad_248[0x8];                                      // 0x0248(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRepresentedObjectiveChanged();
	void OnRepresentedObjectiveCurrentValueChanged(float NewCurrentValue);
	void OnRepresentedObjectiveTargetValueChanged(float NewTargetValue);

	struct FMoleTaskObjectiveUIInfo GetTaskObjectiveInfo() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleTaskObjectiveHUDWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleTaskObjectiveHUDWidget")
	}
	static class UMoleTaskObjectiveHUDWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskObjectiveHUDWidget>();
	}
};
DUMPER7_ASSERTS_UMoleTaskObjectiveHUDWidget;

// Class MoleUI.MoleTimer
// 0x0010 (0x0258 - 0x0248)
class UMoleTimer final : public UUserWidget
{
public:
	uint8                                         Pad_248[0x10];                                     // 0x0248(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearTimer();
	void OnTimerCleared();
	void OnTimerFinished();
	void OnTimerStarted(int32 TimeLeft);
	void OnTimerUpdated(int32 TimeLeft);
	void StartTimer(float InServerFinishTime);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleTimer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleTimer")
	}
	static class UMoleTimer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTimer>();
	}
};
DUMPER7_ASSERTS_UMoleTimer;

// Class MoleUI.MoleUIAssetManagerComponent
// 0x0000 (0x00E8 - 0x00E8)
class UMoleUIAssetManagerComponent final : public UMoleAssetManagerComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleUIAssetManagerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleUIAssetManagerComponent")
	}
	static class UMoleUIAssetManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleUIAssetManagerComponent>();
	}
};
DUMPER7_ASSERTS_UMoleUIAssetManagerComponent;

// Class MoleUI.MoleUIDirector
// 0x00C8 (0x02F8 - 0x0230)
class AMoleUIDirector final : public ADynamicUIDirectorBase
{
public:
	TArray<class UDynamicUIScene*>                LobbyStateScenes;                                  // 0x0230(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UDynamicUIScene*>                VotingStateScenes;                                 // 0x0240(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UDynamicUIScene*>                QuickChatScenes;                                   // 0x0250(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UDynamicUIScene*                        AllyScene;                                         // 0x0260(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
