#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MoleGameRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "MoleGameRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayMessages_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MoleGameRuntime.MoleTaskLogicSubobject.OnAssociatedTaskActorsAdded
// 0x0010 (0x0010 - 0x0000)
struct MoleTaskLogicSubobject_OnAssociatedTaskActorsAdded final
{
public:
	TArray<class AActor*>                         InNewlyAddedTaskActors;                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicSubobject_OnAssociatedTaskActorsAdded;

// Function MoleGameRuntime.MoleTaskLogicSubobject.OnAssociatedTaskActorsPendingRemoval
// 0x0010 (0x0010 - 0x0000)
struct MoleTaskLogicSubobject_OnAssociatedTaskActorsPendingRemoval final
{
public:
	TArray<class AActor*>                         InPendingRemovalTaskActors;                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicSubobject_OnAssociatedTaskActorsPendingRemoval;

// Function MoleGameRuntime.MoleTaskLogicSubobject.OnOwningTaskBecomePrimaryActiveTask
// 0x0001 (0x0001 - 0x0000)
struct MoleTaskLogicSubobject_OnOwningTaskBecomePrimaryActiveTask final
{
public:
	bool                                          bIsActivePhase;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicSubobject_OnOwningTaskBecomePrimaryActiveTask;

// Function MoleGameRuntime.MoleTaskLogicSubobject.OnOwningTaskNoLongerPrimaryActiveTask
// 0x0001 (0x0001 - 0x0000)
struct MoleTaskLogicSubobject_OnOwningTaskNoLongerPrimaryActiveTask final
{
public:
	bool                                          bIsActivePhase;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicSubobject_OnOwningTaskNoLongerPrimaryActiveTask;

// Function MoleGameRuntime.MoleTaskLogicSubobject.OnTaskExternalInterruption
// 0x0001 (0x0001 - 0x0000)
struct MoleTaskLogicSubobject_OnTaskExternalInterruption final
{
public:
	EMoleTaskInterruptionType                     InterruptionType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicSubobject_OnTaskExternalInterruption;

// Function MoleGameRuntime.MoleTaskLogicSubobject.GetAssociatedTaskActors
// 0x0010 (0x0010 - 0x0000)
struct MoleTaskLogicSubobject_GetAssociatedTaskActors final
{
public:
	TArray<class AActor*>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicSubobject_GetAssociatedTaskActors;

// Function MoleGameRuntime.MoleTaskLogicSubobject.GetOwnerRole
// 0x0001 (0x0001 - 0x0000)
struct MoleTaskLogicSubobject_GetOwnerRole final
{
public:
	ENetRole                                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicSubobject_GetOwnerRole;

// Function MoleGameRuntime.MoleTaskLogicSubobject.GetOwningController
// 0x0008 (0x0008 - 0x0000)
struct MoleTaskLogicSubobject_GetOwningController final
{
public:
	class AController*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicSubobject_GetOwningController;

// Function MoleGameRuntime.MoleTaskLogicSubobject.GetOwningPlayerTaskComponent
// 0x0008 (0x0008 - 0x0000)
struct MoleTaskLogicSubobject_GetOwningPlayerTaskComponent final
{
public:
	class UMolePlayerTaskManagementComponent*     ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicSubobject_GetOwningPlayerTaskComponent;

// Function MoleGameRuntime.MoleTaskLogicObjective.ApplyCurrentValueDelta
// 0x0004 (0x0004 - 0x0000)
struct MoleTaskLogicObjective_ApplyCurrentValueDelta final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicObjective_ApplyCurrentValueDelta;

// Function MoleGameRuntime.MoleTaskLogicObjective.CaptureInitialValue
// 0x0004 (0x0004 - 0x0000)
struct MoleTaskLogicObjective_CaptureInitialValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicObjective_CaptureInitialValue;

// Function MoleGameRuntime.MoleTaskLogicObjective.CaptureTargetValue
// 0x0004 (0x0004 - 0x0000)
struct MoleTaskLogicObjective_CaptureTargetValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicObjective_CaptureTargetValue;

// Function MoleGameRuntime.MoleTaskLogicObjective.ServerSuggestObjectiveStatus
// 0x0001 (0x0001 - 0x0000)
struct MoleTaskLogicObjective_ServerSuggestObjectiveStatus final
{
public:
	EMoleTaskObjectiveStatus                      InNewSuggestedStatus;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicObjective_ServerSuggestObjectiveStatus;

// Function MoleGameRuntime.MoleTaskLogicObjective.SetObjectiveStatus
// 0x0001 (0x0001 - 0x0000)
struct MoleTaskLogicObjective_SetObjectiveStatus final
{
public:
	EMoleTaskObjectiveStatus                      InNewStatus;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicObjective_SetObjectiveStatus;

// Function MoleGameRuntime.MoleTaskLogicObjective.GetCapturedInitialValue
// 0x0004 (0x0004 - 0x0000)
struct MoleTaskLogicObjective_GetCapturedInitialValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicObjective_GetCapturedInitialValue;

// Function MoleGameRuntime.MoleTaskLogicObjective.GetCapturedTargetValue
// 0x0004 (0x0004 - 0x0000)
struct MoleTaskLogicObjective_GetCapturedTargetValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicObjective_GetCapturedTargetValue;

// Function MoleGameRuntime.MoleTaskLogicObjective.GetCurrentValue
// 0x0004 (0x0004 - 0x0000)
struct MoleTaskLogicObjective_GetCurrentValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicObjective_GetCurrentValue;

// Function MoleGameRuntime.MoleTaskLogicObjective.GetObjectiveStatus
// 0x0001 (0x0001 - 0x0000)
struct MoleTaskLogicObjective_GetObjectiveStatus final
{
public:
	EMoleTaskObjectiveStatus                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicObjective_GetObjectiveStatus;

// Function MoleGameRuntime.MoleTaskLogicObjective.GetObjectiveText
// 0x0018 (0x0018 - 0x0000)
struct MoleTaskLogicObjective_GetObjectiveText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicObjective_GetObjectiveText;

// Function MoleGameRuntime.MoleEliminationAbility.ValidatePotentialEliminationTarget
// 0x0010 (0x0010 - 0x0000)
struct MoleEliminationAbility_ValidatePotentialEliminationTarget final
{
public:
	class AFortPlayerPawn*                        PotentialTargetPawn;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleEliminationAbility_ValidatePotentialEliminationTarget;

// Function MoleGameRuntime.FortCinematicComponent.FadeFromBlackscreen
// 0x0004 (0x0004 - 0x0000)
struct FortCinematicComponent_FadeFromBlackscreen final
{
public:
	float                                         InFadeTime;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCinematicComponent_FadeFromBlackscreen;

// Function MoleGameRuntime.FortCinematicComponent.FadeToBlackscreen
// 0x0008 (0x0008 - 0x0000)
struct FortCinematicComponent_FadeToBlackscreen final
{
public:
	float                                         InFadeTime;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInHold;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortCinematicComponent_FadeToBlackscreen;

// Function MoleGameRuntime.FortCinematicComponent.IsCinematicStateActive
// 0x000C (0x000C - 0x0000)
struct FortCinematicComponent_IsCinematicStateActive final
{
public:
	struct FGameplayTag                           StateTag;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortCinematicComponent_IsCinematicStateActive;

// Function MoleGameRuntime.FortCinematicComponent.PushCinematicState
// 0x0048 (0x0048 - 0x0000)
struct FortCinematicComponent_PushCinematicState final
{
public:
	struct FFortCinematicState                    InState;                                           // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCinematicComponent_PushCinematicState;

// Function MoleGameRuntime.FortCinematicComponent.RemoveCinematicState
// 0x0008 (0x0008 - 0x0000)
struct FortCinematicComponent_RemoveCinematicState final
{
public:
	struct FGameplayTag                           StateId;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCinematicComponent_RemoveCinematicState;

// Function MoleGameRuntime.MoleAFKComponent.HasEverBeenAFK
// 0x0010 (0x0010 - 0x0000)
struct MoleAFKComponent_HasEverBeenAFK final
{
public:
	const class AFortPlayerController*            FortPC;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleAFKComponent_HasEverBeenAFK;

// Function MoleGameRuntime.MoleAFKComponent.HasEverBeenAFKForTooLong
// 0x0010 (0x0010 - 0x0000)
struct MoleAFKComponent_HasEverBeenAFKForTooLong final
{
public:
	const class AFortPlayerController*            FortPC;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleAFKComponent_HasEverBeenAFKForTooLong;

// Function MoleGameRuntime.MoleAFKComponent.IsControllerAFK
// 0x0010 (0x0010 - 0x0000)
struct MoleAFKComponent_IsControllerAFK final
{
public:
	class AFortPlayerController*                  FortPC;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleAFKComponent_IsControllerAFK;

// Function MoleGameRuntime.MoleAFKComponent.IsPlayerAFK
// 0x0010 (0x0010 - 0x0000)
struct MoleAFKComponent_IsPlayerAFK final
{
public:
	const class APlayerState*                     Player;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleAFKComponent_IsPlayerAFK;

// Function MoleGameRuntime.MoleAFKComponent.OnPlayerEnteredPOI
// 0x0010 (0x0010 - 0x0000)
struct MoleAFKComponent_OnPlayerEnteredPOI final
{
public:
	class AActor*                                 OverlapingVolume;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 EnteringActor;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleAFKComponent_OnPlayerEnteredPOI;

// Function MoleGameRuntime.MoleAFKComponent.OnPlayerLeftPOI
// 0x0010 (0x0010 - 0x0000)
struct MoleAFKComponent_OnPlayerLeftPOI final
{
public:
	class AActor*                                 OverlapingVolume;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 EnteringActor;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleAFKComponent_OnPlayerLeftPOI;

// Function MoleGameRuntime.MoleCheatManager.GoToStateGameover
// 0x0008 (0x0008 - 0x0000)
struct MoleCheatManager_GoToStateGameover final
{
public:
	struct FGameplayTag                           InTag;                                             // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleCheatManager_GoToStateGameover;

// Function MoleGameRuntime.MoleCheatManager.GrantTask
// 0x0010 (0x0010 - 0x0000)
struct MoleCheatManager_GrantTask final
{
public:
	class FString                                 TaskAssetName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleCheatManager_GrantTask;

// Function MoleGameRuntime.MoleCheatManager.SpawnMoleBots
// 0x0004 (0x0004 - 0x0000)
struct MoleCheatManager_SpawnMoleBots final
{
public:
	int32                                         NumBotsToSpawn;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleCheatManager_SpawnMoleBots;

// Function MoleGameRuntime.MoleTaskLogicObjective_DamageActors.OnBuildingActorDamaged
// 0x0050 (0x0050 - 0x0000)
struct MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleTaskLogicObjective_DamageActors_OnBuildingActorDamaged;

// Function MoleGameRuntime.MoleTaskLogicObjective_DamageActors.OnPawnDamaged
// 0x0050 (0x0050 - 0x0000)
struct MoleTaskLogicObjective_DamageActors_OnPawnDamaged final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleTaskLogicObjective_DamageActors_OnPawnDamaged;

// Function MoleGameRuntime.MoleTaskLogicObjective_DestroyActors.OnBuildingActorDied
// 0x0050 (0x0050 - 0x0000)
struct MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleTaskLogicObjective_DestroyActors_OnBuildingActorDied;

// Function MoleGameRuntime.MoleTaskLogicObjective_DestroyActors.OnGenericActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct MoleTaskLogicObjective_DestroyActors_OnGenericActorDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLogicObjective_DestroyActors_OnGenericActorDestroyed;

// Function MoleGameRuntime.MoleTaskLogicObjective_DestroyActors.OnPawnDied
// 0x0050 (0x0050 - 0x0000)
struct MoleTaskLogicObjective_DestroyActors_OnPawnDied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleTaskLogicObjective_DestroyActors_OnPawnDied;

// Function MoleGameRuntime.MoleGameplayAbility_Voting.OnVotingTargetChanged
// 0x0008 (0x0008 - 0x0000)
struct MoleGameplayAbility_Voting_OnVotingTargetChanged final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleGameplayAbility_Voting_OnVotingTargetChanged;

// Function MoleGameRuntime.MoleGhostMannequin.OnRepresentedPlayerSet
// 0x0008 (0x0008 - 0x0000)
struct MoleGhostMannequin_OnRepresentedPlayerSet final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleGhostMannequin_OnRepresentedPlayerSet;

// Function MoleGameRuntime.MoleGhostMannequin.GetRepresentedPlayer
// 0x0008 (0x0008 - 0x0000)
struct MoleGhostMannequin_GetRepresentedPlayer final
{
public:
	class APlayerState*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleGhostMannequin_GetRepresentedPlayer;

// Function MoleGameRuntime.MoleImpostorBiasComponent.IsImpostorBiasEnabled
// 0x0001 (0x0001 - 0x0000)
struct MoleImpostorBiasComponent_IsImpostorBiasEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleImpostorBiasComponent_IsImpostorBiasEnabled;

// Function MoleGameRuntime.MoleImpostorBiasComponent.SetRolePreference
// 0x0010 (0x0010 - 0x0000)
struct MoleImpostorBiasComponent_SetRolePreference final
{
public:
	class AFortPlayerController*                  FortPC;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoleRole                                     InRolePreference;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleImpostorBiasComponent_SetRolePreference;

// Function MoleGameRuntime.MolePawnComponent.HandlePawnCustomizationComplete
// 0x0008 (0x0008 - 0x0000)
struct MolePawnComponent_HandlePawnCustomizationComplete final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MolePawnComponent_HandlePawnCustomizationComplete;

// Function MoleGameRuntime.MolePlayerStateComponent.BlueprintSetIsPlayerGhost
// 0x0010 (0x0010 - 0x0000)
struct MolePlayerStateComponent_BlueprintSetIsPlayerGhost final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPlayerGhost;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MolePlayerStateComponent_BlueprintSetIsPlayerGhost;

// Function MoleGameRuntime.MolePlayerStateComponent.GetMolePlayerCosmeticData
// 0x0028 (0x0028 - 0x0000)
struct MolePlayerStateComponent_GetMolePlayerCosmeticData final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMolePlayerCosmeticData                OutPlayerCosmeticData;                             // 0x0008(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MolePlayerStateComponent_GetMolePlayerCosmeticData;

// Function MoleGameRuntime.MolePlayerStateComponent.GetMolePlayerItemDefinition
// 0x0010 (0x0010 - 0x0000)
struct MolePlayerStateComponent_GetMolePlayerItemDefinition final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortItemDefinition*              ReturnValue;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MolePlayerStateComponent_GetMolePlayerItemDefinition;

// Function MoleGameRuntime.MolePlayerStateComponent.GetMoleRole
// 0x0010 (0x0010 - 0x0000)
struct MolePlayerStateComponent_GetMoleRole final
{
public:
	class AController*                            User;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoleRole                                     ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MolePlayerStateComponent_GetMoleRole;

// Function MoleGameRuntime.MolePlayerStateComponent.IsMoleEliminated
// 0x0010 (0x0010 - 0x0000)
struct MolePlayerStateComponent_IsMoleEliminated final
{
public:
	const class APlayerState*                     PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MolePlayerStateComponent_IsMoleEliminated;

// Function MoleGameRuntime.MolePlayerStateComponent.IsMoleEnemy
// 0x0010 (0x0010 - 0x0000)
struct MolePlayerStateComponent_IsMoleEnemy final
{
public:
	const class AActor*                           InActor;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MolePlayerStateComponent_IsMoleEnemy;

// Function MoleGameRuntime.MolePlayerStateComponent.IsMoleEnemyFor
// 0x0018 (0x0018 - 0x0000)
struct MolePlayerStateComponent_IsMoleEnemyFor final
{
public:
	const class APlayerState*                     PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class APlayerState*                     TargetPlayerState;                                 // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MolePlayerStateComponent_IsMoleEnemyFor;

// Function MoleGameRuntime.MolePlayerStateComponent.IsMoleGhost
// 0x0010 (0x0010 - 0x0000)
struct MolePlayerStateComponent_IsMoleGhost final
{
public:
	const class APlayerState*                     PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MolePlayerStateComponent_IsMoleGhost;

// Function MoleGameRuntime.MolePlayerStateComponent.IsMolePlayerDisconnected
// 0x0010 (0x0010 - 0x0000)
struct MolePlayerStateComponent_IsMolePlayerDisconnected final
{
public:
	const class APlayerState*                     PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MolePlayerStateComponent_IsMolePlayerDisconnected;

// Function MoleGameRuntime.MolePlayerStateComponent.SetMoleKiller
// 0x0010 (0x0010 - 0x0000)
struct MolePlayerStateComponent_SetMoleKiller final
{
public:
	class APlayerState*                           Victim;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           Killer;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MolePlayerStateComponent_SetMoleKiller;

// Function MoleGameRuntime.MolePlayerStateComponent.GetPlayerNumber
// 0x0004 (0x0004 - 0x0000)
struct MolePlayerStateComponent_GetPlayerNumber final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MolePlayerStateComponent_GetPlayerNumber;

// Function MoleGameRuntime.MolePlayerTaskManagementComponent.BlueprintServerTaskObjectInteractEvent
// 0x0058 (0x0058 - 0x0000)
struct MolePlayerTaskManagementComponent_BlueprintServerTaskObjectInteractEvent final
{
public:
	class AController*                            User;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FEventMessageTag                       EventMessageTag;                                   // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTaskGenericPayload                    Payload;                                           // 0x0010(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MolePlayerTaskManagementComponent_BlueprintServerTaskObjectInteractEvent;

// Function MoleGameRuntime.MolePlayerTaskManagementComponent.CompleteTaskForGameplayState
// 0x0008 (0x0008 - 0x0000)
struct MolePlayerTaskManagementComponent_CompleteTaskForGameplayState final
{
public:
	class UGameplayState*                         State;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MolePlayerTaskManagementComponent_CompleteTaskForGameplayState;

// Function MoleGameRuntime.MolePlayerTaskManagementComponent.ClientAdvanceLogicThroughPhases
// 0x0018 (0x0018 - 0x0000)
struct MolePlayerTaskManagementComponent_ClientAdvanceLogicThroughPhases final
{
public:
	class UMoleTaskLogic*                         Logic;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 AdvancedPhases;                                    // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MolePlayerTaskManagementComponent_ClientAdvanceLogicThroughPhases;

// Function MoleGameRuntime.MolePlayerTaskManagementComponent.ClientAllTasksInterrupted
// 0x0001 (0x0001 - 0x0000)
struct MolePlayerTaskManagementComponent_ClientAllTasksInterrupted final
{
public:
	EMoleTaskInterruptionType                     InterruptionType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MolePlayerTaskManagementComponent_ClientAllTasksInterrupted;

// Function MoleGameRuntime.MolePlayerTaskManagementComponent.ClientSetPrimaryActiveTask
// 0x0004 (0x0004 - 0x0000)
struct MolePlayerTaskManagementComponent_ClientSetPrimaryActiveTask final
{
public:
	struct FMoleActiveTaskStateHandle             NewPrimaryHandle;                                  // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MolePlayerTaskManagementComponent_ClientSetPrimaryActiveTask;

// Function MoleGameRuntime.MolePlayerTaskManagementComponent.ClientTasksInterrupted
// 0x0018 (0x0018 - 0x0000)
struct MolePlayerTaskManagementComponent_ClientTasksInterrupted final
{
public:
	TArray<class UMoleTaskDataAsset*>             TasksInterrupted;                                  // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EMoleTaskInterruptionType                     InterruptionType;                                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MolePlayerTaskManagementComponent_ClientTasksInterrupted;

// Function MoleGameRuntime.MolePlayerTaskManagementComponent.OnCompletedTaskAdded
// 0x0020 (0x0020 - 0x0000)
struct MolePlayerTaskManagementComponent_OnCompletedTaskAdded final
{
public:
	struct FMoleCompletedTask                     InAddedCompletedTask;                              // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MolePlayerTaskManagementComponent_OnCompletedTaskAdded;

// Function MoleGameRuntime.MolePlayerTaskManagementComponent.OnLeashActorEndOverlap
// 0x0010 (0x0010 - 0x0000)
struct MolePlayerTaskManagementComponent_OnLeashActorEndOverlap final
{
public:
	class AActor*                                 OriginatingActor;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ActorEndingOverlap;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MolePlayerTaskManagementComponent_OnLeashActorEndOverlap;

// Function MoleGameRuntime.MolePlayerTaskManagementComponent.ServerTaskObjectInteractEvent
// 0x0048 (0x0048 - 0x0000)
struct MolePlayerTaskManagementComponent_ServerTaskObjectInteractEvent final
{
public:
	struct FEventMessageTag                       EventMessageTag;                                   // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTaskGenericPayload                    Payload;                                           // 0x0008(0x0040)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MolePlayerTaskManagementComponent_ServerTaskObjectInteractEvent;

// Function MoleGameRuntime.MolePlayerTaskManagementComponent.GetNumCompletedTasks
// 0x0004 (0x0004 - 0x0000)
struct MolePlayerTaskManagementComponent_GetNumCompletedTasks final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MolePlayerTaskManagementComponent_GetNumCompletedTasks;

// Function MoleGameRuntime.MoleQuickChatComponent.ServerSendMessage
// 0x0050 (0x0050 - 0x0000)
struct MoleQuickChatComponent_ServerSendMessage final
{
public:
	struct FMoleQuickChatMessageInfo              Message;                                           // 0x0000(0x0050)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleQuickChatComponent_ServerSendMessage;

// Function MoleGameRuntime.MoleSabotageAbility.RevertSabotageForPlayer
// 0x0008 (0x0008 - 0x0000)
struct MoleSabotageAbility_RevertSabotageForPlayer final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleSabotageAbility_RevertSabotageForPlayer;

// Function MoleGameRuntime.MoleSabotageAbility.GetAllSaboteurs
// 0x0010 (0x0010 - 0x0000)
struct MoleSabotageAbility_GetAllSaboteurs final
{
public:
	TArray<class APlayerState*>                   OutAllSaboteurs;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleSabotageAbility_GetAllSaboteurs;

// Function MoleGameRuntime.MoleSabotageAbility.GetAllValidSabotageTargets
// 0x0010 (0x0010 - 0x0000)
struct MoleSabotageAbility_GetAllValidSabotageTargets final
{
public:
	TArray<class APlayerState*>                   OutValidTargets;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleSabotageAbility_GetAllValidSabotageTargets;

// Function MoleGameRuntime.MoleSabotageAbility.GetInterruptionType
// 0x0001 (0x0001 - 0x0000)
struct MoleSabotageAbility_GetInterruptionType final
{
public:
	EMoleSabotageInterruptionType                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleSabotageAbility_GetInterruptionType;

// Function MoleGameRuntime.MoleSabotageManagerComponent.SendMoleLightingModeChangeEvent
// 0x0010 (0x0010 - 0x0000)
struct MoleSabotageManagerComponent_SendMoleLightingModeChangeEvent final
{
public:
	const class UMoleSabotageAbility*             SabotageAbility;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMoleLightingMode                      LightingMode;                                      // 0x0008(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleSabotageManagerComponent_SendMoleLightingModeChangeEvent;

// Function MoleGameRuntime.MoleSabotageManagerComponent.SendMoleSabotageTimerStartedEvent
// 0x0010 (0x0010 - 0x0000)
struct MoleSabotageManagerComponent_SendMoleSabotageTimerStartedEvent final
{
public:
	const class UMoleSabotageAbility*             SabotageAbility;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMoleTimerInfo                         TimerInfo;                                         // 0x0008(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleSabotageManagerComponent_SendMoleSabotageTimerStartedEvent;

// Function MoleGameRuntime.MoleStateMachine.GetMoleRemainingSaboteurCount
// 0x0010 (0x0010 - 0x0000)
struct MoleStateMachine_GetMoleRemainingSaboteurCount final
{
public:
	class APlayerController*                      ContextPlayer;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleStateMachine_GetMoleRemainingSaboteurCount;

// Function MoleGameRuntime.MoleStateMachine.GetMoleStartOfMatchPlayerCount
// 0x0010 (0x0010 - 0x0000)
struct MoleStateMachine_GetMoleStartOfMatchPlayerCount final
{
public:
	class APlayerController*                      ContextPlayer;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleStateMachine_GetMoleStartOfMatchPlayerCount;

// Function MoleGameRuntime.MoleStateMachine.GetMoleStartOfMatchPlayerCountForPlayspace
// 0x0010 (0x0010 - 0x0000)
struct MoleStateMachine_GetMoleStartOfMatchPlayerCountForPlayspace final
{
public:
	class AMoleGamePlayspace*                     PlayspaceContext;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleStateMachine_GetMoleStartOfMatchPlayerCountForPlayspace;

// Function MoleGameRuntime.MoleState_Gameplay.GetAllMoleFreshlyKilledGhosts
// 0x0018 (0x0018 - 0x0000)
struct MoleState_Gameplay_GetAllMoleFreshlyKilledGhosts final
{
public:
	class APlayerController*                      PlayerContext;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class APlayerState*>                   OutFreshlyKilledGhosts;                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleState_Gameplay_GetAllMoleFreshlyKilledGhosts;

// Function MoleGameRuntime.MoleState_Gameplay.RequestEmergencyMeeting
// 0x0030 (0x0030 - 0x0000)
struct MoleState_Gameplay_RequestEmergencyMeeting final
{
public:
	class AActor*                                 ActorContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMoleEmergencyMeetingData              MeetingData;                                       // 0x0008(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleState_Gameplay_RequestEmergencyMeeting;

// Function MoleGameRuntime.MoleState_Gameplay.HandlePlayerStateDied
// 0x0008 (0x0008 - 0x0000)
struct MoleState_Gameplay_HandlePlayerStateDied final
{
public:
	class APlayerState*                           GhostPlayerState;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleState_Gameplay_HandlePlayerStateDied;

// Function MoleGameRuntime.MoleState_Gameplay.HandleScoreChanged
// 0x0010 (0x0010 - 0x0000)
struct MoleState_Gameplay_HandleScoreChanged final
{
public:
	struct FEventMessageTag                       EventChannel;                                      // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMoleTaskScoreEventData                ScoreEventData;                                    // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleState_Gameplay_HandleScoreChanged;

// Function MoleGameRuntime.MoleSupplyDropSabotageAbility.HandleFixPointInteracted
// 0x0018 (0x0018 - 0x0000)
struct MoleSupplyDropSabotageAbility_HandleFixPointInteracted final
{
public:
	class UMoleTaskLinkComponent*                 TaskLinkComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AFortPawn*                        InteractingPawn;                                   // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInteractionBeingAttempted                    InteractionType;                                   // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleSupplyDropSabotageAbility_HandleFixPointInteracted;

// Function MoleGameRuntime.MoleTaskLinkComponent.GetTaskComponent
// 0x0010 (0x0010 - 0x0000)
struct MoleTaskLinkComponent_GetTaskComponent final
{
public:
	class AActor*                                 TaskActor;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMoleTaskLinkComponent*                 ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskLinkComponent_GetTaskComponent;

// Function MoleGameRuntime.MoleTaskLinkComponent.AddPlayerInteractionData
// 0x0018 (0x0018 - 0x0000)
struct MoleTaskLinkComponent_AddPlayerInteractionData final
{
public:
	class AController*                            User;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InteractionInfoRowName;                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
