#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MoleGameRuntime

#include "Basic.hpp"

#include "MoleGameRuntime_structs.hpp"
#include "TargetingSystem_structs.hpp"
#include "TargetingSystem_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "GameplayMessages_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "PlayspaceSystem_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayStateMachine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MoleGameRuntime.MoleTaskLogicSubobject
// 0x0038 (0x0060 - 0x0028)
class UMoleTaskLogicSubobject : public UObject
{
public:
	struct FGameplayTagContainer                  AssociatedTaskActorTags;                           // 0x0028(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class AActor*>                         AssociatedTaskActors;                              // 0x0048(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         AssociatedActorRemovalPolicyBitmask;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bUsesAssociatedTaskActors : 1;                     // 0x0059(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bReplicates : 1;                                   // 0x0059(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAssociatedTaskActorsAdded(const TArray<class AActor*>& InNewlyAddedTaskActors);
	void OnAssociatedTaskActorsPendingRemoval(const TArray<class AActor*>& InPendingRemovalTaskActors);
	void OnEnterOwningPhase();
	void OnExitOwningPhase();
	void OnOwningTaskBecomePrimaryActiveTask(bool bIsActivePhase);
	void OnOwningTaskNoLongerPrimaryActiveTask(bool bIsActivePhase);
	void OnTaskExternalInterruption(EMoleTaskInterruptionType InterruptionType);
	void OnTaskRemoved();

	const TArray<class AActor*> GetAssociatedTaskActors() const;
	ENetRole GetOwnerRole() const;
	class AController* GetOwningController() const;
	class UMolePlayerTaskManagementComponent* GetOwningPlayerTaskComponent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleTaskLogicSubobject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleTaskLogicSubobject")
	}
	static class UMoleTaskLogicSubobject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicSubobject>();
	}
};
DUMPER7_ASSERTS_UMoleTaskLogicSubobject;

// Class MoleGameRuntime.MoleTaskLogicObjective
// 0x0090 (0x00F0 - 0x0060)
class UMoleTaskLogicObjective : public UMoleTaskLogicSubobject
{
public:
	TMulticastInlineDelegate<void(float NewCurrentValue)> OnObjectiveCurrentValueChanged;            // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float NewTargetValue)> OnObjectiveTargetValueChanged;              // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FMoleObjectiveValue                    CurrentValue;                                      // 0x0080(0x0008)(Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         CapturedInitialValue;                              // 0x0088(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CapturedTargetValue;                               // 0x008C(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMoleTaskObjectiveStatus                      CurrentStatus;                                     // 0x0090(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ObjectiveText;                                     // 0x0098(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector                                IndicatorRelativeOffset;                           // 0x00B0(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MinimumCompletionTimeSecurityThreshold;            // 0x00C0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         bAllowClientCompletion : 1;                        // 0x00E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bValidateDistFromAssociatedActors : 1;             // 0x00E8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bValidateMinCompletionTime : 1;                    // 0x00E8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bInterruptTaskOnValidationFailure : 1;             // 0x00E8(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bClearProgressOnTaskInterruption : 1;              // 0x00E8(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bHasPerformedInitialCapture : 1;                   // 0x00E8(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bAttemptSetPrimaryActiveTaskOnValueDelta : 1;      // 0x00E8(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bAttemptHighlightAssociatedActorsIfPrimaryActiveTask : 1; // 0x00E8(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bAttemptApplyIndicatorsToAssociatedActorsIfPrimaryActiveTask : 1; // 0x00E9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bRequirePermissionForEmphasisFX : 1;               // 0x00E9(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyCurrentValueDelta(float Delta);
	float CaptureInitialValue();
	float CaptureTargetValue();
	void CheckObjectiveStatus();
	void OnRep_CapturedInitialValue();
	void OnRep_CapturedTargetValue();
	void OnRep_CurrentStatus();
	void OnRep_CurrentValue();
	void ServerSetAsPrimaryActiveTask();
	void ServerSuggestObjectiveStatus(EMoleTaskObjectiveStatus InNewSuggestedStatus);
	void SetObjectiveStatus(EMoleTaskObjectiveStatus InNewStatus);

	float GetCapturedInitialValue() const;
	float GetCapturedTargetValue() const;
	float GetCurrentValue() const;
	EMoleTaskObjectiveStatus GetObjectiveStatus() const;
	const class FText GetObjectiveText() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleTaskLogicObjective")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleTaskLogicObjective")
	}
	static class UMoleTaskLogicObjective* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicObjective>();
	}
};
DUMPER7_ASSERTS_UMoleTaskLogicObjective;

// Class MoleGameRuntime.MoleEliminationAbility
// 0x0040 (0x0AE8 - 0x0AA8)
class UMoleEliminationAbility final : public UFortGameplayAbility
{
public:
	struct FGameplayTagContainer                  CooldownTagsToListenTo;                            // 0x0AA8(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  CombinedCooldownTags;                              // 0x0AC8(0x0020)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)

public:
	bool ValidatePotentialEliminationTarget(class AFortPlayerPawn* PotentialTargetPawn) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleEliminationAbility")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleEliminationAbility")
	}
	static class UMoleEliminationAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleEliminationAbility>();
	}
};
DUMPER7_ASSERTS_UMoleEliminationAbility;

// Class MoleGameRuntime.MoleTaskLogicAction
// 0x0008 (0x0068 - 0x0060)
class UMoleTaskLogicAction : public UMoleTaskLogicSubobject
{
public:
	uint8                                         ActionRemovalPolicyBitmask;                        // 0x0060(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bUsesActionRemovalPolicyBitmask : 1;               // 0x0061(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnActionRemovalPolicyInvoked();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleTaskLogicAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleTaskLogicAction")
	}
	static class UMoleTaskLogicAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicAction>();
	}
};
DUMPER7_ASSERTS_UMoleTaskLogicAction;

// Class MoleGameRuntime.MoleTaskLogicAction_GrantAbilitySet
// 0x0070 (0x00D8 - 0x0068)
class UMoleTaskLogicAction_GrantAbilitySet final : public UMoleTaskLogicAction
{
public:
	TSoftObjectPtr<class UFortAbilitySet>         AbilitySetToGrant;                                 // 0x0068(0x0028)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortAbilitySetHandle                  GrantedHandle;                                     // 0x0090(0x0038)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FGuid                                  GrantedInputGuid;                                  // 0x00C8(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleTaskLogicAction_GrantAbilitySet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleTaskLogicAction_GrantAbilitySet")
	}
	static class UMoleTaskLogicAction_GrantAbilitySet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicAction_GrantAbilitySet>();
	}
};
DUMPER7_ASSERTS_UMoleTaskLogicAction_GrantAbilitySet;

// Class MoleGameRuntime.FortCinematicComponent
// 0x00B0 (0x0160 - 0x00B0)
class UFortCinematicComponent : public UControllerComponent
{
public:
	TMap<TWeakObjectPtr<class AFortPawn>, bool>   PawnVisibilityMap;                                 // 0x00B0(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<TWeakObjectPtr<class AFortPawn>, bool>   LocalPawnVisibilityMap;                            // 0x0100(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFortCinematicState>            StateStack;                                        // 0x0150(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	void CancelBlackscreen();
	void FadeFromBlackscreen(float InFadeTime);
	void FadeToBlackscreen(float InFadeTime, bool bInHold);
	bool IsCinematicStateActive(const struct FGameplayTag& StateTag);
	void PushCinematicState(const struct FFortCinematicState& InState);
	void RemoveCinematicState(const struct FGameplayTag& StateId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortCinematicComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortCinematicComponent")
	}
	static class UFortCinematicComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCinematicComponent>();
	}
};
DUMPER7_ASSERTS_UFortCinematicComponent;

// Class MoleGameRuntime.MoleTaskLogicAction_GrantTag
// 0x0020 (0x0088 - 0x0068)
class UMoleTaskLogicAction_GrantTag final : public UMoleTaskLogicAction
{
public:
	struct FGameplayTagContainer                  TagsToGrant;                                       // 0x0068(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleTaskLogicAction_GrantTag")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleTaskLogicAction_GrantTag")
	}
	static class UMoleTaskLogicAction_GrantTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicAction_GrantTag>();
	}
};
DUMPER7_ASSERTS_UMoleTaskLogicAction_GrantTag;

// Class MoleGameRuntime.MoleAFKComponent
// 0x0028 (0x0128 - 0x0100)
class UMoleAFKComponent final : public UFortAFKComponent
{
public:
	float                                         LongestAFKPeriod;                                  // 0x0100(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_104[0x24];                                     // 0x0104(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool HasEverBeenAFK(const class AFortPlayerController* FortPC);
	static bool HasEverBeenAFKForTooLong(const class AFortPlayerController* FortPC);
	static bool IsControllerAFK(class AFortPlayerController* FortPC);
	static bool IsPlayerAFK(const class APlayerState* Player);

	void OnPlayerEnteredPOI(class AActor* OverlapingVolume, class AActor* EnteringActor);
	void OnPlayerLeftPOI(class AActor* OverlapingVolume, class AActor* EnteringActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleAFKComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleAFKComponent")
	}
	static class UMoleAFKComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleAFKComponent>();
	}
};
DUMPER7_ASSERTS_UMoleAFKComponent;

// Class MoleGameRuntime.MoleTaskLogicAction_GrantWeapon
// 0x0038 (0x00A0 - 0x0068)
class UMoleTaskLogicAction_GrantWeapon final : public UMoleTaskLogicAction
{
public:
	TSoftObjectPtr<class UFortWeaponItemDefinition> WeaponToGrant;                                   // 0x0068(0x0028)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  GrantedWeaponGuid;                                 // 0x0090(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleTaskLogicAction_GrantWeapon")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleTaskLogicAction_GrantWeapon")
	}
	static class UMoleTaskLogicAction_GrantWeapon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicAction_GrantWeapon>();
	}
};
DUMPER7_ASSERTS_UMoleTaskLogicAction_GrantWeapon;

// Class MoleGameRuntime.MoleAnalyticsComponent
// 0x01E0 (0x0290 - 0x00B0)
class UMoleAnalyticsComponent final : public UPlayspaceComponent
{
public:
	uint8                                         Pad_B0[0x1E0];                                     // 0x00B0(0x01E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleAnalyticsComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleAnalyticsComponent")
	}
	static class UMoleAnalyticsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleAnalyticsComponent>();
	}
};
DUMPER7_ASSERTS_UMoleAnalyticsComponent;

// Class MoleGameRuntime.MoleTaskLogicAction_HighlightActors
// 0x0010 (0x0078 - 0x0068)
class UMoleTaskLogicAction_HighlightActors final : public UMoleTaskLogicAction
{
public:
	uint8                                         bHighlight : 1;                                    // 0x0068(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bShowIndicator : 1;                                // 0x0068(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bRequirePermissionForEmphasisFX : 1;               // 0x0068(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bShowIndicatorInGoalMode : 1;                      // 0x0068(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                IndicatorRelativeLocationOffset;                   // 0x006C(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleTaskLogicAction_HighlightActors")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleTaskLogicAction_HighlightActors")
	}
	static class UMoleTaskLogicAction_HighlightActors* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicAction_HighlightActors>();
	}
};
DUMPER7_ASSERTS_UMoleTaskLogicAction_HighlightActors;

// Class MoleGameRuntime.MoleAssetManagerComponent
// 0x0038 (0x00E8 - 0x00B0)
class UMoleAssetManagerComponent : public UGameFrameworkComponent
{
public:
	uint8                                         Pad_B0[0x18];                                      // 0x00B0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMoleAssetLoadData>             AssetLoadInfo;                                     // 0x00C8(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           BundlesToLoad;                                     // 0x00D8(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleAssetManagerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleAssetManagerComponent")
	}
	static class UMoleAssetManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleAssetManagerComponent>();
	}
};
DUMPER7_ASSERTS_UMoleAssetManagerComponent;

// Class MoleGameRuntime.MoleTaskLogicAction_SetInteractionData
// 0x0010 (0x0078 - 0x0068)
class UMoleTaskLogicAction_SetInteractionData final : public UMoleTaskLogicAction
{
public:
	class FName                                   InteractionRow;                                    // 0x0068(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bAlsoGrantPermission : 1;                          // 0x0070(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleTaskLogicAction_SetInteractionData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleTaskLogicAction_SetInteractionData")
	}
	static class UMoleTaskLogicAction_SetInteractionData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicAction_SetInteractionData>();
	}
};
DUMPER7_ASSERTS_UMoleTaskLogicAction_SetInteractionData;

// Class MoleGameRuntime.MoleAudioManagerComponent
// 0x0000 (0x00B0 - 0x00B0)
class UMoleAudioManagerComponent final : public UPlayspaceComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleAudioManagerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleAudioManagerComponent")
	}
	static class UMoleAudioManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleAudioManagerComponent>();
	}
};
DUMPER7_ASSERTS_UMoleAudioManagerComponent;

// Class MoleGameRuntime.MoleTaskLogicAction_SetPermission
// 0x0008 (0x0070 - 0x0068)
class UMoleTaskLogicAction_SetPermission final : public UMoleTaskLogicAction
{
public:
	uint8                                         bGrantPermission : 1;                              // 0x0068(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleTaskLogicAction_SetPermission")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleTaskLogicAction_SetPermission")
	}
	static class UMoleTaskLogicAction_SetPermission* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicAction_SetPermission>();
	}
};
DUMPER7_ASSERTS_UMoleTaskLogicAction_SetPermission;

// Class MoleGameRuntime.MoleCheatManager
// 0x0000 (0x0028 - 0x0028)
class UMoleCheatManager final : public UChildCheatManager
{
public:
	void GoToStateGameover(const struct FGameplayTag& InTag);
	void GoToStateGameplay();
	void GoToStateLobby();
	void GoToStateVoting();
	void GrantTask(const class FString& TaskAssetName);
	void MakeSelfMoleGhost();
	void MakeTargetMoleGhost();
	void MoleClearRequestSaboteur();
	void MoleDisableAllTasks();
	void MoleDisableSelfTasks();
	void MoleEnableAllTasks();
	void MoleEnableSelfTasks();
	void MoleInterruptAllTasks();
	void MoleInterruptSelfTasks();
	void MoleRecoverFromAFK();
	void MoleRequestSaboteur();
	void MoleShowImpostorBias();
	void SkipLobbyBackfillLogic();
	void SpawnMoleBots(int32 NumBotsToSpawn);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleCheatManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleCheatManager")
	}
	static class UMoleCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleCheatManager>();
	}
};
DUMPER7_ASSERTS_UMoleCheatManager;

// Class MoleGameRuntime.MoleTaskLogicAction_SetPlayerLeash
// 0x0030 (0x0098 - 0x0068)
class UMoleTaskLogicAction_SetPlayerLeash final : public UMoleTaskLogicAction
{
public:
	EMoleTaskLeashType                            LeashType;                                         // 0x0068(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         LeashDistance;                                     // 0x0070(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleTaskLogicAction_SetPlayerLeash")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleTaskLogicAction_SetPlayerLeash")
	}
	static class UMoleTaskLogicAction_SetPlayerLeash* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicAction_SetPlayerLeash>();
	}
};
DUMPER7_ASSERTS_UMoleTaskLogicAction_SetPlayerLeash;

// Class MoleGameRuntime.MoleCinematicComponent
// 0x0288 (0x03E8 - 0x0160)
class UMoleCinematicComponent final : public UFortCinematicComponent
{
public:
	uint8                                         Pad_160[0x8];                                      // 0x0160(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bRoleAssignedTeleport;                             // 0x0168(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayMessageReceiverHandle         RoleAssignTeleportHandle;                          // 0x0170(0x0020)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FFortCinematicState                    RoleAssignedCineState;                             // 0x0190(0x0048)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FMoleEmergencyMeetingData              MeetingPayload;                                    // 0x01D8(0x0020)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FFortCinematicState                    MeetingCalledCineState;                            // 0x01F8(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_240[0x8];                                      // 0x0240(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bVoteDiscussionTeleport;                           // 0x0248(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayMessageReceiverHandle         VoteDiscussTeleportHandle;                         // 0x0250(0x0020)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FFortCinematicState                    VoteDiscussCineState;                              // 0x0270(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B8[0x20];                                     // 0x02B8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortCinematicState                    VoteResolvedCineState;                             // 0x02D8(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          bVotingTeleport;                                   // 0x0320(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayMessageReceiverHandle         VotingTeleportHandle;                              // 0x0328(0x0020)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortCinematicState                    VoteSkippedCineState;                              // 0x0350(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_398[0x8];                                      // 0x0398(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortCinematicState                    VoteEjectionCineState;                             // 0x03A0(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleCinematicComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleCinematicComponent")
	}
	static class UMoleCinematicComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleCinematicComponent>();
	}
};
DUMPER7_ASSERTS_UMoleCinematicComponent;

// Class MoleGameRuntime.MoleTaskLogicObjective_DamageActors
// 0x0030 (0x0120 - 0x00F0)
class UMoleTaskLogicObjective_DamageActors final : public UMoleTaskLogicObjective
{
public:
	struct FScalableFloat                         DamageAmount;                                      // 0x00F0(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         bOnlyCountDamageFromTaskOwner : 1;                 // 0x0118(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBuildingActorDamaged(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnPawnDamaged(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleTaskLogicObjective_DamageActors")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleTaskLogicObjective_DamageActors")
	}
	static class UMoleTaskLogicObjective_DamageActors* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicObjective_DamageActors>();
	}
};
DUMPER7_ASSERTS_UMoleTaskLogicObjective_DamageActors;

// Class MoleGameRuntime.MoleEliminationMarker
// 0x0008 (0x08C8 - 0x08C0)
class AMoleEliminationMarker final : public ABuildingGameplayActor
{
public:
	class APlayerState*                           RepresentedPlayer;                                 // 0x08C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnRep_RepresentedPlayer();
	void OnRepresentedPlayerSet();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleEliminationMarker")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleEliminationMarker")
	}
	static class AMoleEliminationMarker* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMoleEliminationMarker>();
	}
};
DUMPER7_ASSERTS_AMoleEliminationMarker;

// Class MoleGameRuntime.MoleTaskLogicObjective_DestroyActors
// 0x0040 (0x0130 - 0x00F0)
class UMoleTaskLogicObjective_DestroyActors final : public UMoleTaskLogicObjective
{
public:
	struct FMoleObjectiveCriteriaFloat            Quantity;                                          // 0x00F0(0x0040)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	void OnBuildingActorDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnGenericActorDestroyed(class AActor* DestroyedActor);
	void OnPawnDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleTaskLogicObjective_DestroyActors")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleTaskLogicObjective_DestroyActors")
	}
	static class UMoleTaskLogicObjective_DestroyActors* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleTaskLogicObjective_DestroyActors>();
	}
};
DUMPER7_ASSERTS_UMoleTaskLogicObjective_DestroyActors;

// Class MoleGameRuntime.MoleGameBaseMutator
// 0x00C8 (0x0390 - 0x02C8)
class AMoleGameBaseMutator final : public AFortAthenaMutator
{
public:
	struct FGameplayTagContainer                  BlockedEmoteTags;                                  // 0x02C8(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  BlockedEmoteTagsForGhosts;                         // 0x02E8(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   LeaveTextOverride;                                 // 0x0308(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   LeavePartyTextOverride;                            // 0x0320(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   GhostLeaveTextOverride;                            // 0x0338(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   GhostLeavePartyTextOverride;                       // 0x0350(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         IsSlideEnabled;                                    // 0x0368(0x0028)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleGameBaseMutator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleGameBaseMutator")
	}
	static class AMoleGameBaseMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMoleGameBaseMutator>();
	}
};
DUMPER7_ASSERTS_AMoleGameBaseMutator;

// Class MoleGameRuntime.MoleGameplayAbility_Voting
// 0x0018 (0x0AC0 - 0x0AA8)
class UMoleGameplayAbility_Voting final : public UFortGameplayAbility
{
public:
	class UTargetingPreset*                       VotingTargetingPreset;                             // 0x0AA8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTargetingRequestHandle                AsyncTargetingHandle;                              // 0x0AB0(0x0004)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AB4[0x4];                                      // 0x0AB4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 BestVotingTarget;                                  // 0x0AB8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnVotingTargetChanged(class AActor* Target);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleGameplayAbility_Voting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleGameplayAbility_Voting")
	}
	static class UMoleGameplayAbility_Voting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleGameplayAbility_Voting>();
	}
};
DUMPER7_ASSERTS_UMoleGameplayAbility_Voting;

// Class MoleGameRuntime.MoleGamePlayerSpawningComponent
// 0x0038 (0x00F8 - 0x00C0)
class UMoleGamePlayerSpawningComponent final : public UPlayspaceComponent_PlayerSpawning
{
public:
	uint8                                         Pad_C0[0x38];                                      // 0x00C0(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleGamePlayerSpawningComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleGamePlayerSpawningComponent")
	}
	static class UMoleGamePlayerSpawningComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleGamePlayerSpawningComponent>();
	}
};
DUMPER7_ASSERTS_UMoleGamePlayerSpawningComponent;

// Class MoleGameRuntime.MoleGamePlayspace
// 0x0028 (0x0568 - 0x0540)
class AMoleGamePlayspace final : public AFortPlayspace
{
public:
	TSubclassOf<class UGameplayStateMachine>      MoleStateMachineClass;                             // 0x0540(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_548[0x10];                                     // 0x0548(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryManager*                  InventoryManager;                                  // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameplayStateMachineManager*           StateMachineManager;                               // 0x0560(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleGamePlayspace")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleGamePlayspace")
	}
	static class AMoleGamePlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMoleGamePlayspace>();
	}
};
DUMPER7_ASSERTS_AMoleGamePlayspace;

// Class MoleGameRuntime.MoleGameplayState_Tasks
// 0x0010 (0x0088 - 0x0078)
class UMoleGameplayState_Tasks final : public UGameplayState
{
public:
	float                                         PrepareStateDelayTime;                             // 0x0078(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C[0xC];                                       // 0x007C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleGameplayState_Tasks")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleGameplayState_Tasks")
	}
	static class UMoleGameplayState_Tasks* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleGameplayState_Tasks>();
	}
};
DUMPER7_ASSERTS_UMoleGameplayState_Tasks;

// Class MoleGameRuntime.MoleGhostControllerComponent
// 0x0008 (0x00B8 - 0x00B0)
class UMoleGhostControllerComponent final : public UFortControllerComponent
{
public:
	class UInputComponent*                        GhostInputComp;                                    // 0x00B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ClientRevertGhost();
	void CLientSetupGhost();
	void OnPlayerBecameGhost();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleGhostControllerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleGhostControllerComponent")
	}
	static class UMoleGhostControllerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleGhostControllerComponent>();
	}
};
DUMPER7_ASSERTS_UMoleGhostControllerComponent;

// Class MoleGameRuntime.MoleGhostMannequin
// 0x0018 (0x0578 - 0x0560)
class AMoleGhostMannequin final : public AFortPlayerMannequin
{
public:
	class UMaterialInterface*                     GhostMaterial;                                     // 0x0560(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayerState*                           RepresentedPlayerState;                            // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_570[0x8];                                      // 0x0570(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRepresentedPlayerSet(class APlayerState* PlayerState);

	class APlayerState* GetRepresentedPlayer() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleGhostMannequin")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleGhostMannequin")
	}
	static class AMoleGhostMannequin* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMoleGhostMannequin>();
	}
};
DUMPER7_ASSERTS_AMoleGhostMannequin;

// Class MoleGameRuntime.MoleGlobals
// 0x0000 (0x0028 - 0x0028)
class UMoleGlobals final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleGlobals")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleGlobals")
	}
	static class UMoleGlobals* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleGlobals>();
	}
};
DUMPER7_ASSERTS_UMoleGlobals;

// Class MoleGameRuntime.MoleImpostorBiasComponent
// 0x0020 (0x00D0 - 0x00B0)
class UMoleImpostorBiasComponent final : public UControllerComponent
{
public:
	EMoleRole                                     RolePreference;                                    // 0x00B0(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B1[0x1F];                                      // 0x00B1(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool IsImpostorBiasEnabled();
	static void SetRolePreference(class AFortPlayerController* FortPC, EMoleRole InRolePreference);

	void OnRep_RolePreference();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleImpostorBiasComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleImpostorBiasComponent")
	}
	static class UMoleImpostorBiasComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleImpostorBiasComponent>();
	}
};
DUMPER7_ASSERTS_UMoleImpostorBiasComponent;

// Class MoleGameRuntime.MoleInitialPlayerCountModMagnitudeCalculation
// 0x0000 (0x0040 - 0x0040)
class UMoleInitialPlayerCountModMagnitudeCalculation final : public UFortGameplayModMagnitudeCalculation
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleInitialPlayerCountModMagnitudeCalculation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleInitialPlayerCountModMagnitudeCalculation")
	}
	static class UMoleInitialPlayerCountModMagnitudeCalculation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleInitialPlayerCountModMagnitudeCalculation>();
	}
};
DUMPER7_ASSERTS_UMoleInitialPlayerCountModMagnitudeCalculation;

// Class MoleGameRuntime.MoleLevelDataAsset
// 0x0040 (0x0070 - 0x0030)
class UMoleLevelDataAsset final : public UPrimaryDataAsset
{
public:
	TArray<TSoftObjectPtr<class UWorld>>          Levels;                                            // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  LevelDescriptionTags;                              // 0x0040(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FMoleLevelTaskRequest>          TaskRequests;                                      // 0x0060(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleLevelDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleLevelDataAsset")
	}
	static class UMoleLevelDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleLevelDataAsset>();
	}
};
DUMPER7_ASSERTS_UMoleLevelDataAsset;

// Class MoleGameRuntime.MoleLevelBalanceDataAsset
// 0x0020 (0x0050 - 0x0030)
class UMoleLevelBalanceDataAsset final : public UPrimaryDataAsset
{
public:
	TArray<TSoftObjectPtr<class UDataTable>>      DataTables;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UCurveTable>>     CurveTables;                                       // 0x0040(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleLevelBalanceDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleLevelBalanceDataAsset")
	}
	static class UMoleLevelBalanceDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleLevelBalanceDataAsset>();
	}
};
DUMPER7_ASSERTS_UMoleLevelBalanceDataAsset;

// Class MoleGameRuntime.MoleLevelManagerComponent
// 0x0048 (0x00F8 - 0x00B0)
class UMoleLevelManagerComponent final : public UPlayspaceComponent
{
public:
	struct FGameplayTagContainer                  DesiredMapDescription;                             // 0x00B0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UMoleLevelDataAsset*                    CurrentLevelData;                                  // 0x00D0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D8[0x20];                                      // 0x00D8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleLevelManagerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleLevelManagerComponent")
	}
	static class UMoleLevelManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleLevelManagerComponent>();
	}
};
DUMPER7_ASSERTS_UMoleLevelManagerComponent;

// Class MoleGameRuntime.MoleLobbyStateMachine
// 0x0040 (0x00F0 - 0x00B0)
class UMoleLobbyStateMachine final : public UGameplayStateMachine
{
public:
	uint8                                         Pad_B0[0x40];                                      // 0x00B0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleLobbyStateMachine")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleLobbyStateMachine")
	}
	static class UMoleLobbyStateMachine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleLobbyStateMachine>();
	}
};
DUMPER7_ASSERTS_UMoleLobbyStateMachine;

// Class MoleGameRuntime.MoleLobbyState_Countdown
// 0x0010 (0x0088 - 0x0078)
class UMoleLobbyState_Countdown final : public UGameplayState
{
public:
	float                                         LobbyTransitionServerTime;                         // 0x0078(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7C[0xC];                                       // 0x007C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_LobbyTransitionServerTime();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleLobbyState_Countdown")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleLobbyState_Countdown")
	}
	static class UMoleLobbyState_Countdown* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleLobbyState_Countdown>();
	}
};
DUMPER7_ASSERTS_UMoleLobbyState_Countdown;

// Class MoleGameRuntime.MoleLobbyState_Loading
// 0x0008 (0x0080 - 0x0078)
class UMoleLobbyState_Loading final : public UGameplayState
{
public:
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleLobbyState_Loading")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleLobbyState_Loading")
	}
	static class UMoleLobbyState_Loading* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleLobbyState_Loading>();
	}
};
DUMPER7_ASSERTS_UMoleLobbyState_Loading;

// Class MoleGameRuntime.MoleLobbyState_Login
// 0x0008 (0x0080 - 0x0078)
class UMoleLobbyState_Login final : public UGameplayState
{
public:
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleLobbyState_Login")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleLobbyState_Login")
	}
	static class UMoleLobbyState_Login* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleLobbyState_Login>();
	}
};
DUMPER7_ASSERTS_UMoleLobbyState_Login;

// Class MoleGameRuntime.MoleLobbyState_Matchmake
// 0x0008 (0x0080 - 0x0078)
class UMoleLobbyState_Matchmake final : public UGameplayState
{
public:
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAcquiringMorePlayersCompleted();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleLobbyState_Matchmake")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleLobbyState_Matchmake")
	}
	static class UMoleLobbyState_Matchmake* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleLobbyState_Matchmake>();
	}
};
DUMPER7_ASSERTS_UMoleLobbyState_Matchmake;

// Class MoleGameRuntime.MoleLobbyState_Waiting
// 0x0000 (0x0078 - 0x0078)
class UMoleLobbyState_Waiting final : public UGameplayState
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoleLobbyState_Waiting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoleLobbyState_Waiting")
	}
	static class UMoleLobbyState_Waiting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoleLobbyState_Waiting>();
	}
};
DUMPER7_ASSERTS_UMoleLobbyState_Waiting;

// Class MoleGameRuntime.MolePawnComponent
// 0x0058 (0x0108 - 0x00B0)
class UMolePawnComponent final : public UPawnComponent
{
public:
	class FName                                   MaterialOpacityParameter;                          // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     GhostMaterial;                                     // 0x00B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortFootstepAudioBank*                 PlayerFootstepBankBase;                            // 0x00C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PlayerFootstepBankPriority;                        // 0x00C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCharacterCustomizationData*        BaseCustomizationData;                             // 0x00D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCharacterCustomizationData*        GhostCustomizationData;                            // 0x00D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x14];                                      // 0x00E0(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsGhost;                                          // 0x00F4(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   GhostCollisionProfile;                             // 0x00F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandlePawnCustomizationComplete(class AFortPlayerPawn* Pawn);
	void OnBecameGhost();
	void OnBecameHuman();
	void OnRep_bIsGhost();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MolePawnComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MolePawnComponent")
	}
	static class UMolePawnComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMolePawnComponent>();
	}
};
DUMPER7_ASSERTS_UMolePawnComponent;

// Class MoleGameRuntime.MolePerformanceComponent
// 0x0000 (0x00B0 - 0x00B0)
class UMolePerformanceComponent final : public UPlayspaceComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MolePerformanceComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MolePerformanceComponent")
	}
	static class UMolePerformanceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMolePerformanceComponent>();
	}
};
DUMPER7_ASSERTS_UMolePerformanceComponent;

// Class MoleGameRuntime.MolePlayerControllerComponent
// 0x0050 (0x0100 - 0x00B0)
class UMolePlayerControllerComponent final : public UControllerComponent
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        MoleCoreInputComp;                                 // 0x00B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortPlayerInputSettings*               MoleKBMInputSettings;                              // 0x00C0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortPlayerInputSettings*               MoleControllerInputSettings;                       // 0x00C8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             BindingsDataTable;                                 // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x28];                                      // 0x00D8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MolePlayerControllerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MolePlayerControllerComponent")
	}
	static class UMolePlayerControllerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMolePlayerControllerComponent>();
	}
};
DUMPER7_ASSERTS_UMolePlayerControllerComponent;

// Class MoleGameRuntime.MolePlayerStart
// 0x0008 (0x0298 - 0x0290)
class AMolePlayerStart final : public AFortPlayerStart
{
public:
	int32                                         CorrespondingPlayerNumber;                         // 0x0290(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MolePlayerStart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MolePlayerStart")
	}
	static class AMolePlayerStart* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMolePlayerStart>();
	}
};
DUMPER7_ASSERTS_AMolePlayerStart;

// Class MoleGameRuntime.MolePlayerStateComponent
// 0x00D8 (0x0188 - 0x00B0)
class UMolePlayerStateComponent final : public UPlayerStateComponent
{
public:
	uint8                                         Pad_B0[0x30];                                      // 0x00B0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnPlayerBecameGhost;                               // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         PlayerNumber;                                      // 0x00F0(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMoleDeathInformation                  DeathInfo;                                         // 0x00F4(0x0002)(Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            GhostGameplayEffect;                               // 0x00F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
