#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MoleGameRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayMessages_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "NetCore_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Enum MoleGameRuntime.EMoleTaskInterruptionType
// NumValues: 0x0003
enum class EMoleTaskInterruptionType : uint8
{
	RestartTask                              = 0,
	DisableTask                              = 1,
	EMoleTaskInterruptionType_MAX            = 2,
};

// Enum MoleGameRuntime.EMoleTaskObjectiveStatus
// NumValues: 0x0004
enum class EMoleTaskObjectiveStatus : uint8
{
	Unresolved                               = 0,
	SuccessfulCompletion                     = 1,
	FailedCompletion                         = 2,
	EMoleTaskObjectiveStatus_MAX             = 3,
};

// Enum MoleGameRuntime.EMolePlayerLeftReason
// NumValues: 0x0003
enum class EMolePlayerLeftReason : uint8
{
	PlayerLeft                               = 0,
	PlayerKickedNoPawn                       = 1,
	EMolePlayerLeftReason_MAX                = 2,
};

// Enum MoleGameRuntime.EMoleSabotageInterruptionType
// NumValues: 0x0003
enum class EMoleSabotageInterruptionType : uint8
{
	Interrupt                                = 0,
	Pause                                    = 1,
	EMoleSabotageInterruptionType_MAX        = 2,
};

// Enum MoleGameRuntime.EMoleLightsMode
// NumValues: 0x0004
enum class EMoleLightsMode : uint8
{
	Standard                                 = 0,
	Emergency                                = 1,
	Disabled                                 = 2,
	EMoleLightsMode_MAX                      = 3,
};

// Enum MoleGameRuntime.EMoleTaskLeashType
// NumValues: 0x0003
enum class EMoleTaskLeashType : uint8
{
	CollisionOverlap                         = 0,
	DistanceFromActorLocation                = 1,
	EMoleTaskLeashType_MAX                   = 2,
};

// Enum MoleGameRuntime.EMoleObjectiveCriteriaFloatType
// NumValues: 0x0004
enum class EMoleObjectiveCriteriaFloatType : uint8
{
	FloatValue                               = 0,
	UseObjectiveTaskActorCount               = 1,
	ExplicitActorCount                       = 2,
	EMoleObjectiveCriteriaFloatType_MAX      = 3,
};

// Enum MoleGameRuntime.EMoleTaskLogicSubobjectEventPolicy
// NumValues: 0x0006
enum class EMoleTaskLogicSubobjectEventPolicy : uint8
{
	None                                     = 0,
	OnPhaseEnd                               = 1,
	OnTaskInterruption                       = 2,
	OnTaskRemoval                            = 4,
	OnTaskCompletion                         = 8,
	EMoleTaskLogicSubobjectEventPolicy_MAX   = 9,
};

// Enum MoleGameRuntime.EMoleNewTaskNotificationType
// NumValues: 0x0004
enum class EMoleNewTaskNotificationType : uint8
{
	None                                     = 0,
	NewTaskOnly                              = 1,
	TaskCompletionAndNewTask                 = 2,
	EMoleNewTaskNotificationType_MAX         = 3,
};

// Enum MoleGameRuntime.EMoleRole
// NumValues: 0x0004
enum class EMoleRole : uint8
{
	Unknown                                  = 0,
	Ally                                     = 1,
	Enemy                                    = 2,
	EMoleRole_MAX                            = 3,
};

// Enum MoleGameRuntime.EEmergencyMeetingCause
// NumValues: 0x0004
enum class EEmergencyMeetingCause : uint8
{
	None                                     = 0,
	BodyReported                             = 1,
	MeetingCalled                            = 2,
	EEmergencyMeetingCause_MAX               = 3,
};

// Enum MoleGameRuntime.EVoteType
// NumValues: 0x0004
enum class EVoteType : uint8
{
	None                                     = 0,
	Skip                                     = 1,
	Vote                                     = 2,
	EVoteType_MAX                            = 3,
};

// Enum MoleGameRuntime.EMoleVoiceChannelState
// NumValues: 0x0006
enum class EMoleVoiceChannelState : uint8
{
	None                                     = 0,
	Lobby                                    = 1,
	Gameplay                                 = 2,
	Voting                                   = 3,
	Gameover                                 = 4,
	EMoleVoiceChannelState_MAX               = 5,
};

// ScriptStruct MoleGameRuntime.MoleActiveTaskStateHandle
// 0x0004 (0x0004 - 0x0000)
struct FMoleActiveTaskStateHandle final
{
public:
	int32                                         Handle;                                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMoleActiveTaskStateHandle;

// ScriptStruct MoleGameRuntime.MoleCompletedTask
// 0x0014 (0x0020 - 0x000C)
struct FMoleCompletedTask final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMoleTaskDataAsset*                     TaskAsset;                                         // 0x0010(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMoleActiveTaskStateHandle             StateHandle;                                       // 0x0018(0x0004)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleCompletedTask;

// ScriptStruct MoleGameRuntime.MoleCompletedTaskArray
// 0x0028 (0x0130 - 0x0108)
struct FMoleCompletedTaskArray final : public FFastArraySerializer
{
public:
	uint8                                         Pad_108[0x18];                                     // 0x0108(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMoleCompletedTask>             CompletedTaskArray;                                // 0x0120(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMoleCompletedTaskArray;

// ScriptStruct MoleGameRuntime.PlayerTaskStateData
// 0x001C (0x0028 - 0x000C)
struct FPlayerTaskStateData final : public FFastArraySerializerItem
{
public:
	uint8                                         ChangeFlags;                                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            UserController;                                    // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TaskInteractionInfoRowName;                        // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bHasPermission : 1;                                // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPlayerTaskStateData;

// ScriptStruct MoleGameRuntime.PlayerTaskStateDataArray
// 0x0018 (0x0120 - 0x0108)
struct FPlayerTaskStateDataArray final : public FFastArraySerializer
{
public:
	class UMoleTaskLinkComponent*                 CachedTaskComponent;                               // 0x0108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPlayerTaskStateData>           TaskStateArray;                                    // 0x0110(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FPlayerTaskStateDataArray;

// ScriptStruct MoleGameRuntime.MoleAFKData
// 0x0010 (0x0010 - 0x0000)
struct FMoleAFKData final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeUntilConfirmedAFK;                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleAFKData;

// ScriptStruct MoleGameRuntime.MoleEnemyChangedEventData
// 0x0008 (0x0008 - 0x0000)
struct FMoleEnemyChangedEventData final
{
public:
	class AActor*                                 EnemyTargetActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleEnemyChangedEventData;

// ScriptStruct MoleGameRuntime.MoleObjectiveValue
// 0x0008 (0x0008 - 0x0000)
struct FMoleObjectiveValue final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ForceRepCount;                                     // 0x0004(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleObjectiveValue;

// ScriptStruct MoleGameRuntime.MoleVoteResolutionData
// 0x0020 (0x0020 - 0x0000)
struct FMoleVoteResolutionData final
{
public:
	EVoteType                                     VoteType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           EjectedPlayer;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItemDefinition*                    EjectedPlayerItemDefinition;                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Votes;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnemy;                                          // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkippedDueToEqualVotesAndSkips;                   // 0x001D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleVoteResolutionData;

// ScriptStruct MoleGameRuntime.MoleQuickChatMessageSummary
// 0x0018 (0x0018 - 0x0000)
struct FMoleQuickChatMessageSummary final
{
public:
	class AFortPlayerController*                  SenderController;                                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleQuickChatMessageSummary;

// ScriptStruct MoleGameRuntime.MolePlayerCosmeticData
// 0x0020 (0x0020 - 0x0000)
struct FMolePlayerCosmeticData final
{
public:
	class UAthenaCharacterItemDefinition*         CharacterDefinition;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMcpVariantChannelInfo>         CharacterVariantChannels;                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAthenaBackpackItemDefinition*          Backpack;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMolePlayerCosmeticData;

// ScriptStruct MoleGameRuntime.MoleAnalyticsIntegerStat
// 0x0058 (0x0058 - 0x0000)
struct alignas(0x08) FMoleAnalyticsIntegerStat final
{
public:
	uint8                                         Pad_0[0x58];                                       // 0x0000(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleAnalyticsIntegerStat;

// ScriptStruct MoleGameRuntime.MoleAnalyticsFloatStat
// 0x0058 (0x0058 - 0x0000)
struct alignas(0x08) FMoleAnalyticsFloatStat final
{
public:
	uint8                                         Pad_0[0x58];                                       // 0x0000(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleAnalyticsFloatStat;

// ScriptStruct MoleGameRuntime.MoleMessageLobbyCountdown
// 0x0004 (0x0004 - 0x0000)
struct FMoleMessageLobbyCountdown final
{
public:
	int32                                         SecondsRemaining;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleMessageLobbyCountdown;

// ScriptStruct MoleGameRuntime.MoleQuickChatMessageDetails
// 0x0058 (0x0058 - 0x0000)
struct FMoleQuickChatMessageDetails final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           PlayerA;                                           // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           PlayerB;                                           // 0x0030(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           PlayerC;                                           // 0x0038(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleQuickChatMessageDetails;

// ScriptStruct MoleGameRuntime.MoleAssetLoadData
// 0x0008 (0x0008 - 0x0000)
struct FMoleAssetLoadData final
{
public:
	struct FPrimaryAssetType                      PrimaryAssetType;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleAssetLoadData;

// ScriptStruct MoleGameRuntime.MoleBindingData
// 0x0068 (0x0070 - 0x0008)
struct FMoleBindingData final : public FTableRowBase
{
public:
	class FName                                   KBMActionName;                                     // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GamepadActionName;                                 // 0x0010(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   BindingLabel;                                      // 0x0018(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   BindingDescription;                                // 0x0030(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bIsSaboteurBinding;                                // 0x0048(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKBMOnly;                                          // 0x0049(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGamepadOnly;                                      // 0x004A(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CategoryLabel;                                     // 0x0050(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bIsAxisMapping;                                    // 0x0068(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InputScale;                                        // 0x006C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleBindingData;

// ScriptStruct MoleGameRuntime.MoleTaskDescription
// 0x0020 (0x0020 - 0x0000)
struct FMoleTaskDescription final
{
public:
	struct FGameplayTagContainer                  TaskDescription;                                   // 0x0000(0x0020)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleTaskDescription;

// ScriptStruct MoleGameRuntime.MolePlayerTeleportedInfo
// 0x0008 (0x0008 - 0x0000)
struct FMolePlayerTeleportedInfo final
{
public:
	class APlayerState*                           TeleportedPlayerState;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMolePlayerTeleportedInfo;

// ScriptStruct MoleGameRuntime.MoleRolePreference
// 0x0001 (0x0001 - 0x0000)
struct FMoleRolePreference final
{
public:
	EMoleRole                                     RolePreference;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleRolePreference;

// ScriptStruct MoleGameRuntime.MoleImpostorBias
// 0x0004 (0x0004 - 0x0000)
struct FMoleImpostorBias final
{
public:
	int32                                         ImpostorBias;                                      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleImpostorBias;

// ScriptStruct MoleGameRuntime.MoleLevelTaskRequest
// 0x0010 (0x0010 - 0x0000)
struct FMoleLevelTaskRequest final
{
public:
	TArray<struct FMoleTaskDescription>           SupportedTaskDescriptions;                         // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleLevelTaskRequest;

// ScriptStruct MoleGameRuntime.MoleGameplayInputEventData
// 0x0018 (0x0018 - 0x0000)
struct FMoleGameplayInputEventData final
{
public:
	struct FGameplayTag                           InputActionTag;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerControllerGameplay*          UserController;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPressEvent;                                       // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleGameplayInputEventData;

// ScriptStruct MoleGameRuntime.MoleGhostInfo
// 0x0010 (0x0010 - 0x0000)
struct FMoleGhostInfo final
{
public:
	class APlayerState*                           GhostPlayerState;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasVotedOut;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleGhostInfo;

// ScriptStruct MoleGameRuntime.MoleDeathInformation
// 0x0002 (0x0002 - 0x0000)
struct FMoleDeathInformation final
{
public:
	bool                                          bIsGhost;                                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasVotedOut;                                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleDeathInformation;

// ScriptStruct MoleGameRuntime.MolePlayerTeleportedReplicatedData
// 0x000C (0x000C - 0x0000)
struct FMolePlayerTeleportedReplicatedData final
{
public:
	struct FEventMessageTag                       MessageTag;                                        // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReplicationCount;                                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMolePlayerTeleportedReplicatedData;

// ScriptStruct MoleGameRuntime.MoleActiveTaskState
// 0x007C (0x0088 - 0x000C)
struct FMoleActiveTaskState final : public FFastArraySerializerItem
{
public:
	struct FMoleActiveTaskStateHandle             Handle;                                            // 0x000C(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMoleTaskDataAsset*                     TaskAsset;                                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMoleTaskLogic*                         TaskLogic;                                         // 0x0018(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           TaskStateMachineId;                                // 0x0020(0x0008)(RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortAbilitySetHandle                  AbilitySetHandle;                                  // 0x0028(0x0038)(RepSkip, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGuid                                  AbilitySetInputGuid;                               // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                          GrantedItemGuids;                                  // 0x0070(0x0010)(ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
	EMoleNewTaskNotificationType                  NotificationType;                                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleActiveTaskState;

// ScriptStruct MoleGameRuntime.MoleActiveTaskStateArray
// 0x0040 (0x0148 - 0x0108)
struct FMoleActiveTaskStateArray final : public FFastArraySerializer
{
public:
	uint8                                         Pad_108[0x30];                                     // 0x0108(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMoleActiveTaskState>           TaskStateArray;                                    // 0x0138(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMoleActiveTaskStateArray;

// ScriptStruct MoleGameRuntime.MoleTaskLeashData
// 0x0018 (0x0018 - 0x0000)
struct FMoleTaskLeashData final
{
public:
	class UMoleTaskDataAsset*                     TaskDataAsset;                                     // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 LeashActor;                                        // 0x0008(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceSquared;                                   // 0x0010(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleTaskLeashData;

// ScriptStruct MoleGameRuntime.MolePlayerVisibilityInfo
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FMolePlayerVisibilityInfo final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMolePlayerVisibilityInfo;

// ScriptStruct MoleGameRuntime.MoleQuickChatMessageInfo
// 0x0050 (0x0050 - 0x0000)
struct FMoleQuickChatMessageInfo final
{
public:
	class APlayerState*                           Sender;                                            // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CategoryIndex;                                     // 0x0008(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ActionIndex;                                       // 0x000C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MessageIndex;                                      // 0x0010(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SectionALocationTag;                               // 0x0014(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SectionBLocationTag;                               // 0x001C(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SectionCLocationTag;                               // 0x0024(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           SectionASelectedPlayer;                            // 0x0030(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           SectionBSelectedPlayer;                            // 0x0038(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           SectionCSelectedPlayer;                            // 0x0040(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSelfSelected;                                   // 0x0048(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         DummyCount;                                        // 0x0049(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleQuickChatMessageInfo;

// ScriptStruct MoleGameRuntime.MoleSabotageStatus
// 0x000C (0x000C - 0x0000)
struct FMoleSabotageStatus final
{
public:
	struct FGameplayTag                           SabotageTag;                                       // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsActive;                                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleSabotageStatus;

// ScriptStruct MoleGameRuntime.MoleLightingMode
// 0x0001 (0x0001 - 0x0000)
struct FMoleLightingMode final
{
public:
	EMoleLightsMode                               LightingMode;                                      // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleLightingMode;

// ScriptStruct MoleGameRuntime.MoleStateGameOverEventData
// 0x0020 (0x0020 - 0x0000)
struct FMoleStateGameOverEventData final
{
public:
	struct FGameplayTag                           GameOverReason;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoleRole                                     WinningRole;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerState*>                   WinningPlayerStates;                               // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleStateGameOverEventData;

// ScriptStruct MoleGameRuntime.MoleRevealedEnemies
// 0x0010 (0x0010 - 0x0000)
struct FMoleRevealedEnemies final
{
public:
	TArray<class APlayerState*>                   EnemyPlayerStates;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleRevealedEnemies;

// ScriptStruct MoleGameRuntime.TaskInteractionInfo
// 0x0040 (0x0048 - 0x0008)
struct FTaskInteractionInfo final : public FTableRowBase
{
public:
	class FText                                   PrimaryInteractionText;                            // 0x0008(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   SecondaryInteractionText;                          // 0x0020(0x0018)(Edit, NativeAccessSpecifierPublic)
	uint8                                         bCanPrimaryInteract : 1;                           // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanSecondaryInteract : 1;                         // 0x0038(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PrimaryInteractionSpeed;                           // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondaryInteractionSpeed;                         // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTaskInteractionInfo;

// ScriptStruct MoleGameRuntime.MoleObjectiveCriteriaFloat
// 0x0040 (0x0040 - 0x0000)
struct FMoleObjectiveCriteriaFloat final
{
public:
	EMoleObjectiveCriteriaFloatType               ValueType;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         FlatValue;                                         // 0x0008(0x0028)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ActorRootTag;                                      // 0x0030(0x0008)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bCapValueByObjectiveTaskActorCount : 1;            // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bShowCapValueOption : 1;                           // 0x0038(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleObjectiveCriteriaFloat;

// ScriptStruct MoleGameRuntime.MoleTaskLogicPhase
// 0x0028 (0x0028 - 0x0000)
struct FMoleTaskLogicPhase final
{
public:
	TArray<class UMoleTaskLogicAction*>           Actions;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UMoleTaskLogicObjective*>        Objectives;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleTaskLogicPhase;

// ScriptStruct MoleGameRuntime.MoleTaskMappingElement
// 0x0020 (0x0020 - 0x0000)
struct FMoleTaskMappingElement final
{
public:
	class FString                                 TaskDataContentPackageGuid;                        // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMoleTaskDescription>           SupportedTaskDescriptions;                         // 0x0010(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleTaskMappingElement;

// ScriptStruct MoleGameRuntime.MoleTaskScoreEventData
// 0x0008 (0x0008 - 0x0000)
struct FMoleTaskScoreEventData final
{
public:
	float                                         CurrentScore;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScoreGoal;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleTaskScoreEventData;

// ScriptStruct MoleGameRuntime.MoleTaskTrackingData
// 0x0010 (0x0010 - 0x0000)
struct FMoleTaskTrackingData final
{
public:
	class UMoleTaskDataAsset*                     TaskAsset;                                         // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         DistributionCountRemaining;                        // 0x0008(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bInUse : 1;                                        // 0x0009(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bHasBeenGrantedBefore : 1;                         // 0x0009(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleTaskTrackingData;

// ScriptStruct MoleGameRuntime.MoleTaskPointData
// 0x0010 (0x0010 - 0x0000)
struct FMoleTaskPointData final
{
public:
	class AMoleTaskPoint*                         TaskPoint;                                         // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsVisible;                                        // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleTaskPointData;

// ScriptStruct MoleGameRuntime.MoleNewTaskNotificationData
// 0x0020 (0x0020 - 0x0000)
struct FMoleNewTaskNotificationData final
{
public:
	class FText                                   TaskTitle;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	EMoleNewTaskNotificationType                  NotificationType;                                  // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleNewTaskNotificationData;

// ScriptStruct MoleGameRuntime.MoleTaskMessagePayload
// 0x0020 (0x0020 - 0x0000)
struct FMoleTaskMessagePayload final
{
public:
	class UMoleTaskDataAsset*                     TaskAsset;                                         // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerState*                       AssociatedPlayerState;                             // 0x0008(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                  AssociatedPlayerController;                        // 0x0010(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleTaskMessagePayload;

// ScriptStruct MoleGameRuntime.MoleTimerInfo
// 0x0004 (0x0004 - 0x0000)
struct FMoleTimerInfo final
{
public:
	float                                         ServerTimeFinish;                                  // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleTimerInfo;

// ScriptStruct MoleGameRuntime.MolePlayerContext
// 0x0008 (0x0008 - 0x0000)
struct FMolePlayerContext final
{
public:
	class APlayerState*                           PlayerContext;                                     // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMolePlayerContext;

// ScriptStruct MoleGameRuntime.MoleEmergencyMeetingData
// 0x0020 (0x0020 - 0x0000)
struct FMoleEmergencyMeetingData final
{
public:
	EEmergencyMeetingCause                        MeetingCause;                                      // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           MeetingCaller;                                     // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           BodyFound;                                         // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           LocationTag;                                       // 0x0018(0x0008)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleEmergencyMeetingData;

// ScriptStruct MoleGameRuntime.MoleVote
// 0x0018 (0x0018 - 0x0000)
struct FMoleVote final
{
public:
	EVoteType                                     VoteType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerState*                       VotingPlayer;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerState*                       AccusedPlayer;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleVote;

// ScriptStruct MoleGameRuntime.MoleVoterList
// 0x0010 (0x0010 - 0x0000)
struct FMoleVoterList final
{
public:
	TArray<class APlayerState*>                   Voters;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleVoterList;

// ScriptStruct MoleGameRuntime.MoleVotingSummary
// 0x0060 (0x0060 - 0x0000)
struct FMoleVotingSummary final
{
public:
	TMap<class APlayerState*, struct FMoleVoterList> VotingResults;                                  // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FMoleVoterList                         SkippedVotes;                                      // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleVotingSummary;

// ScriptStruct MoleGameRuntime.TaskGenericPayload
// 0x0040 (0x0040 - 0x0000)
struct FTaskGenericPayload final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ContextTag;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextObject;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  UserTags;                                          // 0x0018(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UObject*                                UserObject;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTaskGenericPayload;

// ScriptStruct MoleGameRuntime.MoleBlockedInput
// 0x000C (0x000C - 0x0000)
struct FMoleBlockedInput final
{
public:
	class FName                                   InputActionName;                                   // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAxis;                                           // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleBlockedInput;

// ScriptStruct MoleGameRuntime.MoleHoldBinding
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FMoleHoldBinding final
{
public:
	class FName                                   ActionBindingName;                                 // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   InvertedActionBindingName;                         // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         HoldTime;                                          // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleHoldBinding;

// ScriptStruct MoleGameRuntime.MoleGenericMessagePayload
// 0x0030 (0x0030 - 0x0000)
struct FMoleGenericMessagePayload final
{
public:
	struct FGameplayTagContainer                  ContextTags;                                       // 0x0000(0x0020)(BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	class AFortPlayerState*                       SourcePlayerState;                                 // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerState*                       TargetPlayerState;                                 // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleGenericMessagePayload;

// ScriptStruct MoleGameRuntime.MoleRoleAssignedMessagePayload
// 0x0020 (0x0020 - 0x0000)
struct FMoleRoleAssignedMessagePayload final
{
public:
	bool                                          bIsImpostor;                                       // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerState*                       LocalPlayerState;                                  // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AFortPlayerState*>               TeamPlayerStates;                                  // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleRoleAssignedMessagePayload;

// ScriptStruct MoleGameRuntime.MoleUIVisibilityData
// 0x0008 (0x0008 - 0x0000)
struct FMoleUIVisibilityData final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlayRate;                                          // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMoleUIVisibilityData;

// ScriptStruct MoleGameRuntime.MoleTaskUIVisibilityData
// 0x0030 (0x0030 - 0x0000)
struct FMoleTaskUIVisibilityData final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  VisibleTaskExceptions;                             // 0x0008(0x0020)(BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	float                                         PlayRate;                                          // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMoleTaskUIVisibilityData;

// ScriptStruct MoleGameRuntime.FortCinematicBlackscreenData
// 0x000C (0x000C - 0x0000)
struct FFortCinematicBlackscreenData final
{
public:
	bool                                          bFadeToBlack;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeTime;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHoldBlack;                                        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFortCinematicBlackscreenData;

// ScriptStruct MoleGameRuntime.FortCinematicElement
// 0x0010 (0x0010 - 0x0000)
struct FFortCinematicElement final
{
public:
	struct FGameplayTag                           ElementType;                                       // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ElementState;                                      // 0x0008(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFortCinematicElement;

// ScriptStruct MoleGameRuntime.FortCinematicState
// 0x0048 (0x0048 - 0x0000)
struct FFortCinematicState final
{
public:
	struct FGameplayTag                           StateId;                                           // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortCinematicElement>          CinematicElements;                                 // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bSequenceStarted;                                  // 0x0018(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SequenceDuration;                                  // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IntroFadeInBlackscreenTime;                        // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IntroFadeOutBlackscreenTime;                       // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutroFadeOutBlackscreenTime;                       // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x1C];                                      // 0x002C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFortCinematicState;

}

