#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MoleUI

#include "Basic.hpp"

#include "MoleUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MoleGameRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function MoleUI.MoleEnemyAbilityItem.GetIndex
// 0x0004 (0x0004 - 0x0000)
struct MoleEnemyAbilityItem_GetIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleEnemyAbilityItem_GetIndex;

// Function MoleUI.MoleVoteTally.OnVoteTallyStarted
// 0x0001 (0x0001 - 0x0000)
struct MoleVoteTally_OnVoteTallyStarted final
{
public:
	bool                                          bIsSkipTally;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleVoteTally_OnVoteTallyStarted;

// Function MoleUI.MoleAssignedTaskContainerWidget.OnActiveTasksChanged
// 0x0001 (0x0001 - 0x0000)
struct MoleAssignedTaskContainerWidget_OnActiveTasksChanged final
{
public:
	bool                                          bFrameDefer;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleAssignedTaskContainerWidget_OnActiveTasksChanged;

// Function MoleUI.MoleControllerBinding.OnBindingInfoSet
// 0x0020 (0x0020 - 0x0000)
struct MoleControllerBinding_OnBindingInfoSet final
{
public:
	class FText                                   BindingLabel;                                      // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bIsSaboteurBinding;                                // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleControllerBinding_OnBindingInfoSet;

// Function MoleUI.MoleEnemyAbilityContainer.OnVisibilityChangeRequested
// 0x0001 (0x0001 - 0x0000)
struct MoleEnemyAbilityContainer_OnVisibilityChangeRequested final
{
public:
	bool                                          bNewVisibility;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleEnemyAbilityContainer_OnVisibilityChangeRequested;

// Function MoleUI.MoleEnemyAbilityEntry.OnAbilityDataReceived
// 0x0008 (0x0008 - 0x0000)
struct MoleEnemyAbilityEntry_OnAbilityDataReceived final
{
public:
	class UMoleEnemyAbilityItem*                  Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleEnemyAbilityEntry_OnAbilityDataReceived;

// Function MoleUI.MoleEnemyAbilityOverlay.OnAbilityDataReceived
// 0x0058 (0x0058 - 0x0000)
struct MoleEnemyAbilityOverlay_OnAbilityDataReceived final
{
public:
	struct FMoleAbilityUIData                     InAbilityUIData;                                   // 0x0000(0x0058)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleEnemyAbilityOverlay_OnAbilityDataReceived;

// Function MoleUI.MoleEnemyAbilityOverlay.OnCooldownStarted
// 0x0004 (0x0004 - 0x0000)
struct MoleEnemyAbilityOverlay_OnCooldownStarted final
{
public:
	int32                                         TimeLeft;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleEnemyAbilityOverlay_OnCooldownStarted;

// Function MoleUI.MoleEnemyAbilityOverlay.OnCooldownUpdated
// 0x0004 (0x0004 - 0x0000)
struct MoleEnemyAbilityOverlay_OnCooldownUpdated final
{
public:
	int32                                         TimeLeft;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleEnemyAbilityOverlay_OnCooldownUpdated;

// Function MoleUI.MoleEnemyAbilityWidgetComponent.AreSabotageShortcutsEnabled
// 0x0001 (0x0001 - 0x0000)
struct MoleEnemyAbilityWidgetComponent_AreSabotageShortcutsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleEnemyAbilityWidgetComponent_AreSabotageShortcutsEnabled;

// Function MoleUI.MoleLocationWidget.OnVisited
// 0x0020 (0x0020 - 0x0000)
struct MoleLocationWidget_OnVisited final
{
public:
	class FText                                   LocalizedLocationName;                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bIsNamedLocation;                                  // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleLocationWidget_OnVisited;

// Function MoleUI.MoleNameplate.SetupNameplateFor
// 0x0008 (0x0008 - 0x0000)
struct MoleNameplate_SetupNameplateFor final
{
public:
	class APlayerState*                           OwningPlayer;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleNameplate_SetupNameplateFor;

// Function MoleUI.MoleQuickChatActionSlot.OnIsAvailableChanged
// 0x0001 (0x0001 - 0x0000)
struct MoleQuickChatActionSlot_OnIsAvailableChanged final
{
public:
	bool                                          bIsAvailable;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleQuickChatActionSlot_OnIsAvailableChanged;

// Function MoleUI.MolePostGameScreen.OnXPCalculated
// 0x0004 (0x0004 - 0x0000)
struct MolePostGameScreen_OnXPCalculated final
{
public:
	int32                                         XPValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MolePostGameScreen_OnXPCalculated;

// Function MoleUI.MoleQuickChatMapEntry.OnMapDataRetrieved
// 0x0038 (0x0038 - 0x0000)
struct MoleQuickChatMapEntry_OnMapDataRetrieved final
{
public:
	struct FMoleLocationData                      LocationData;                                      // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleQuickChatMapEntry_OnMapDataRetrieved;

// Function MoleUI.MoleQuickChatWidget.OnPreviewChanged
// 0x0018 (0x0018 - 0x0000)
struct MoleQuickChatWidget_OnPreviewChanged final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleQuickChatWidget_OnPreviewChanged;

// Function MoleUI.MoleQuickChatWidget.AreAcceptAndBackInverted
// 0x0001 (0x0001 - 0x0000)
struct MoleQuickChatWidget_AreAcceptAndBackInverted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleQuickChatWidget_AreAcceptAndBackInverted;

// Function MoleUI.MoleRoleColor.OnSetColor
// 0x0010 (0x0010 - 0x0000)
struct MoleRoleColor_OnSetColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleRoleColor_OnSetColor;

// Function MoleUI.MoleRoleColor.SetColor
// 0x0010 (0x0010 - 0x0000)
struct MoleRoleColor_SetColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleRoleColor_SetColor;

// Function MoleUI.MoleSlottedRadialMenu.OnCategorySelected
// 0x0050 (0x0050 - 0x0000)
struct MoleSlottedRadialMenu_OnCategorySelected final
{
public:
	const class UFortRadialSlot*                  SelectedSlot;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMoleQuickChatActionData>       Actions;                                           // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FLinearColor                           CategoryColor;                                     // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              CategoryImage;                                     // 0x0028(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleSlottedRadialMenu_OnCategorySelected;

// Function MoleUI.MoleSlottedRadialMenu.OnRadialEntriesChanged
// 0x000C (0x000C - 0x0000)
struct MoleSlottedRadialMenu_OnRadialEntriesChanged final
{
public:
	bool                                          bIsActions;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumEntries;                                        // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Degrees;                                           // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleSlottedRadialMenu_OnRadialEntriesChanged;

// Function MoleUI.MoleSlottedRadialMenu.OnRadialEntrySelected
// 0x0010 (0x0010 - 0x0000)
struct MoleSlottedRadialMenu_OnRadialEntrySelected final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            SelectedEntry;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleSlottedRadialMenu_OnRadialEntrySelected;

// Function MoleUI.MoleSubobjectiveIndicatorWidget.OnScreenClampChanged
// 0x0001 (0x0001 - 0x0000)
struct MoleSubobjectiveIndicatorWidget_OnScreenClampChanged final
{
public:
	bool                                          bScreenClamped;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleSubobjectiveIndicatorWidget_OnScreenClampChanged;

// Function MoleUI.MoleSubobjectiveIndicatorWidget.OnSetUsageMode
// 0x0001 (0x0001 - 0x0000)
struct MoleSubobjectiveIndicatorWidget_OnSetUsageMode final
{
public:
	bool                                          bUseGoalIndicatorMode;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleSubobjectiveIndicatorWidget_OnSetUsageMode;

// Function MoleUI.MoleTaskHUDWidget.OnRepresentedTaskChanged
// 0x0010 (0x0010 - 0x0000)
struct MoleTaskHUDWidget_OnRepresentedTaskChanged final
{
public:
	const class UMoleTaskDataAsset*               PreviousTaskAsset;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMoleActiveTaskStateHandle             PreviousHandle;                                    // 0x0008(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleTaskHUDWidget_OnRepresentedTaskChanged;

// Function MoleUI.MoleTaskHUDWidget.SetAttemptShowActiveObjectives
// 0x0001 (0x0001 - 0x0000)
struct MoleTaskHUDWidget_SetAttemptShowActiveObjectives final
{
public:
	bool                                          bAttemptShow;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskHUDWidget_SetAttemptShowActiveObjectives;

// Function MoleUI.MoleTaskHUDWidget.SetTaskAsset
// 0x0008 (0x0008 - 0x0000)
struct MoleTaskHUDWidget_SetTaskAsset final
{
public:
	class UMoleTaskDataAsset*                     TaskAsset;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskHUDWidget_SetTaskAsset;

// Function MoleUI.MoleTaskHUDWidget.SetTaskHandle
// 0x0004 (0x0004 - 0x0000)
struct MoleTaskHUDWidget_SetTaskHandle final
{
public:
	struct FMoleActiveTaskStateHandle             TaskHandle;                                        // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskHUDWidget_SetTaskHandle;

// Function MoleUI.MoleTaskHUDWidget.GetTaskAsset
// 0x0008 (0x0008 - 0x0000)
struct MoleTaskHUDWidget_GetTaskAsset final
{
public:
	const class UMoleTaskDataAsset*               ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskHUDWidget_GetTaskAsset;

// Function MoleUI.MoleTaskHUDWidget.GetTaskTitle
// 0x0018 (0x0018 - 0x0000)
struct MoleTaskHUDWidget_GetTaskTitle final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskHUDWidget_GetTaskTitle;

// Function MoleUI.MoleTaskObjectiveHUDWidget.OnRepresentedObjectiveCurrentValueChanged
// 0x0004 (0x0004 - 0x0000)
struct MoleTaskObjectiveHUDWidget_OnRepresentedObjectiveCurrentValueChanged final
{
public:
	float                                         NewCurrentValue;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskObjectiveHUDWidget_OnRepresentedObjectiveCurrentValueChanged;

// Function MoleUI.MoleTaskObjectiveHUDWidget.OnRepresentedObjectiveTargetValueChanged
// 0x0004 (0x0004 - 0x0000)
struct MoleTaskObjectiveHUDWidget_OnRepresentedObjectiveTargetValueChanged final
{
public:
	float                                         NewTargetValue;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskObjectiveHUDWidget_OnRepresentedObjectiveTargetValueChanged;

// Function MoleUI.MoleTaskObjectiveHUDWidget.GetTaskObjectiveInfo
// 0x0020 (0x0020 - 0x0000)
struct MoleTaskObjectiveHUDWidget_GetTaskObjectiveInfo final
{
public:
	struct FMoleTaskObjectiveUIInfo               ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTaskObjectiveHUDWidget_GetTaskObjectiveInfo;

// Function MoleUI.MoleTimer.OnTimerStarted
// 0x0004 (0x0004 - 0x0000)
struct MoleTimer_OnTimerStarted final
{
public:
	int32                                         TimeLeft;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTimer_OnTimerStarted;

// Function MoleUI.MoleTimer.OnTimerUpdated
// 0x0004 (0x0004 - 0x0000)
struct MoleTimer_OnTimerUpdated final
{
public:
	int32                                         TimeLeft;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTimer_OnTimerUpdated;

// Function MoleUI.MoleTimer.StartTimer
// 0x0004 (0x0004 - 0x0000)
struct MoleTimer_StartTimer final
{
public:
	float                                         InServerFinishTime;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleTimer_StartTimer;

// Function MoleUI.MoleUIDirector.GetMoleEnemyAbilityUIData
// 0x0070 (0x0070 - 0x0000)
struct MoleUIDirector_GetMoleEnemyAbilityUIData final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SabotageTag;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMoleAbilityUIData                     OutEnemyAbilityUIData;                             // 0x0010(0x0058)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleUIDirector_GetMoleEnemyAbilityUIData;

// Function MoleUI.MoleUIDirector.GetMoleLocationData
// 0x0050 (0x0050 - 0x0000)
struct MoleUIDirector_GetMoleLocationData final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           LocationTag;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMoleLocationData                      OutLocationData;                                   // 0x0010(0x0038)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleUIDirector_GetMoleLocationData;

// Function MoleUI.MoleUIDirector.GetMolePlayerUIData
// 0x0030 (0x0030 - 0x0000)
struct MoleUIDirector_GetMolePlayerUIData final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutPlayerNUmber;                                   // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMolePlayerUIData                      OutPlayerUIData;                                   // 0x0010(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MoleUIDirector_GetMolePlayerUIData;

// Function MoleUI.MoleVoteCastingInfoPanel.OnPanelVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct MoleVoteCastingInfoPanel_OnPanelVisibilityChanged final
{
public:
	bool                                          bShouldShowPanel;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleVoteCastingInfoPanel_OnPanelVisibilityChanged;

// Function MoleUI.MoleVotingIndicator.OnIndicatorRevealed
// 0x0008 (0x0008 - 0x0000)
struct MoleVotingIndicator_OnIndicatorRevealed final
{
public:
	class APlayerState*                           AccuserPlayerState;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MoleVotingIndicator_OnIndicatorRevealed;

}

