#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MultiInteractActorComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MultiInteractActorComponent.MultiInteractActorComponent_C
// 0x0028 (0x0148 - 0x0120)
class UMultiInteractActorComponent_C final : public UFortActorComponent_MultiInteract
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0120(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           RemoveInteractPlayerTag;                           // 0x0128(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AddInteractPlayerTag;                              // 0x0130(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           LoopingMultiInteractTag;                           // 0x0138(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         RequiredDuration;                                  // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddGCNL(class AFortPlayerPawn*& PlayerPawn);
	void ExecuteGCNFromTag(class AFortPlayerPawn*& PlayerPawn, struct FGameplayTag& InteractTag, int32 PreviousInteractPlayerCount);
	void ExecuteUbergraph_MultiInteractActorComponent(int32 EntryPoint);
	void ReceiveBeginPlay();
	void RemoveGCNL(class AFortPlayerPawn*& PlayerPawn);
	void SetRequiredDuration(float NewRequiredDuration);
	void UpdateForPlayerJustJoinedInteraction();
	void UpdateForPlayerJustLeftInteraction(const bool bLocalPlayerInteracting, const bool bLocalPlayerJustLeft);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MultiInteractActorComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MultiInteractActorComponent_C")
	}
	static class UMultiInteractActorComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiInteractActorComponent_C>();
	}
};
DUMPER7_ASSERTS_UMultiInteractActorComponent_C;

}

