#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NetCore

#include "Basic.hpp"


namespace SDK
{

// Enum NetCore.ENetworkFailure
// NumValues: 0x000C
enum class ENetworkFailure : uint8
{
	NetDriverAlreadyExists                   = 0,
	NetDriverCreateFailure                   = 1,
	NetDriverListenFailure                   = 2,
	ConnectionLost                           = 3,
	ConnectionTimeout                        = 4,
	FailureReceived                          = 5,
	OutdatedClient                           = 6,
	OutdatedServer                           = 7,
	PendingConnectionFailure                 = 8,
	NetGuidMismatch                          = 9,
	NetChecksumMismatch                      = 10,
	ENetworkFailure_MAX                      = 11,
};

// Enum NetCore.EFastArraySerializerDeltaFlags
// NumValues: 0x0005
enum class EFastArraySerializerDeltaFlags : uint8
{
	None                                     = 0,
	HasBeenSerialized                        = 1,
	HasDeltaBeenRequested                    = 2,
	IsUsingDeltaSerialization                = 4,
	EFastArraySerializerDeltaFlags_MAX       = 5,
};

// Enum NetCore.ENetCloseResult
// NumValues: 0x0056
enum class ENetCloseResult : uint8
{
	NetDriverAlreadyExists                   = 0,
	NetDriverCreateFailure                   = 1,
	NetDriverListenFailure                   = 2,
	ConnectionLost                           = 3,
	ConnectionTimeout                        = 4,
	FailureReceived                          = 5,
	OutdatedClient                           = 6,
	OutdatedServer                           = 7,
	PendingConnectionFailure                 = 8,
	NetGuidMismatch                          = 9,
	NetChecksumMismatch                      = 10,
	SecurityMalformedPacket                  = 11,
	SecurityInvalidData                      = 12,
	SecurityClosed                           = 13,
	Unknown                                  = 14,
	Success                                  = 15,
	Extended                                 = 16,
	RPCDoS                                   = 17,
	Cleanup                                  = 18,
	MissingLevelPackage                      = 19,
	PacketHandlerIncomingError               = 20,
	ZeroLastByte                             = 21,
	ZeroSize                                 = 22,
	ReadHeaderFail                           = 23,
	ReadHeaderExtraFail                      = 24,
	AckSequenceMismatch                      = 25,
	BunchBadChannelIndex                     = 26,
	BunchChannelNameFail                     = 27,
	BunchWrongChannelType                    = 28,
	BunchHeaderOverflow                      = 29,
	BunchDataOverflow                        = 30,
	BunchPrematureControlChannel             = 31,
	BunchPrematureChannel                    = 32,
	BunchPrematureControlClose               = 33,
	UnknownChannelType                       = 34,
	PrematureSend                            = 35,
	CorruptData                              = 36,
	SocketSendFailure                        = 37,
	BadChildConnectionIndex                  = 38,
	LogLimitInstant                          = 39,
	LogLimitSustained                        = 40,
	ReceivedNetGUIDBunchFail                 = 41,
	MaxReliableExceeded                      = 42,
	ReceivedNextBunchFail                    = 43,
	ReceivedNextBunchQueueFail               = 44,
	PartialInitialReliableDestroy            = 45,
	PartialMergeReliableDestroy              = 46,
	PartialInitialNonByteAligned             = 47,
	PartialNonByteAligned                    = 48,
	PartialFinalPackageMapExports            = 49,
	PartialTooLarge                          = 50,
	AlreadyOpen                              = 51,
	ReliableBeforeOpen                       = 52,
	ReliableBufferOverflow                   = 53,
	ControlChannelClose                      = 54,
	ControlChannelEndianCheck                = 55,
	ControlChannelPlayerChannelFail          = 56,
	ControlChannelMessageUnknown             = 57,
	ControlChannelMessageFail                = 58,
	ControlChannelMessagePayloadFail         = 59,
	ControlChannelBunchOverflowed            = 60,
	ControlChannelQueueBunchOverflowed       = 61,
	ClientHasMustBeMappedGUIDs               = 62,
	UnregisteredMustBeMappedGUID             = 63,
	ObjectReplicatorReceivedBunchFail        = 64,
	ContentBlockFail                         = 65,
	ContentBlockHeaderRepLayoutFail          = 66,
	ContentBlockHeaderIsActorFail            = 67,
	ContentBlockHeaderObjFail                = 68,
	ContentBlockHeaderPrematureEnd           = 69,
	ContentBlockHeaderSubObjectActor         = 70,
	ContentBlockHeaderBadParent              = 71,
	ContentBlockHeaderInvalidCreate          = 72,
	ContentBlockHeaderStablyNamedFail        = 73,
	ContentBlockHeaderNoSubObjectClass       = 74,
	ContentBlockHeaderUObjectSubObject       = 75,
	ContentBlockHeaderAActorSubObject        = 76,
	ContentBlockHeaderFail                   = 77,
	ContentBlockPayloadBitsFail              = 78,
	FieldHeaderRepIndex                      = 79,
	FieldHeaderBadRepIndex                   = 80,
	FieldHeaderPayloadBitsFail               = 81,
	FieldPayloadFail                         = 82,
	FaultDisconnect                          = 83,
	NotRecoverable                           = 84,
	ENetCloseResult_MAX                      = 85,
};

// ScriptStruct NetCore.StateStruct
// 0x0018 (0x0018 - 0x0000)
struct FStateStruct
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StateName;                                         // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FStateStruct;

// ScriptStruct NetCore.FastArraySerializerItem
// 0x000C (0x000C - 0x0000)
struct FFastArraySerializerItem
{
public:
	int32                                         ReplicationID;                                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReplicationKey;                                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MostRecentArrayReplicationKey;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFastArraySerializerItem;

// ScriptStruct NetCore.FastArraySerializer
// 0x0108 (0x0108 - 0x0000)
struct alignas(0x08) FFastArraySerializer
{
public:
	TMap<int32, int32> ItemMap;
	int32 IDCounter;
	int32 ArrayReplicationKey;
	char GuidReferencesMap[0x50];
	char GuidReferencesMap_StructDelta[0x50];

	int32 CachedNumItems;
	int32 CachedNumItemsToConsiderForWriting;

	EFastArraySerializerDeltaFlags DeltaFlags;

	uint8 _Padding1[0x7];

	void MarkItemDirty(FFastArraySerializerItem& Item, bool markArrayDirty = true)
	{
		if (Item.ReplicationID == -1)
		{
			Item.ReplicationID = ++IDCounter;
			if (IDCounter == -1)
			{
				IDCounter++;
			}
		}

		Item.ReplicationKey++;
		if (markArrayDirty) MarkArrayDirty();
	}

	void MarkArrayDirty()
	{
		ArrayReplicationKey++;
		if (ArrayReplicationKey == -1)
		{
			ArrayReplicationKey++;
		}

		CachedNumItems = -1;
		CachedNumItemsToConsiderForWriting = -1;
	}
};
DUMPER7_ASSERTS_FFastArraySerializer;

// ScriptStruct NetCore.EscalationState
// 0x0018 (0x0030 - 0x0018)
struct FEscalationState : public FStateStruct
{
public:
	bool                                          bLogEscalate;                                      // 0x0018(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDormant;                                          // 0x0019(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         CooloffTime;                                       // 0x001A(0x0002)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         AutoEscalateTime;                                  // 0x001C(0x0002)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          HighestTimePeriod;                                 // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int8>                                  AllTimePeriods;                                    // 0x0020(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FEscalationState;

// ScriptStruct NetCore.NetAnalyticsDataConfig
// 0x000C (0x000C - 0x0000)
struct FNetAnalyticsDataConfig final
{
public:
	class FName                                   DataName;                                          // 0x0000(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0008(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNetAnalyticsDataConfig;

// ScriptStruct NetCore.NetFaultState
// 0x0010 (0x0040 - 0x0030)
struct FNetFaultState final : public FEscalationState
{
public:
	bool                                          bCloseConnection;                                  // 0x0030(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x1];                                       // 0x0031(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int16                                         EscalateQuotaFaultsPerPeriod;                      // 0x0032(0x0002)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          EscalateQuotaFaultPercentPerPeriod;                // 0x0034(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x1];                                       // 0x0035(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int16                                         DescalateQuotaFaultsPerPeriod;                     // 0x0036(0x0002)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          DescalateQuotaFaultPercentPerPeriod;               // 0x0038(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          EscalateQuotaTimePeriod;                           // 0x0039(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNetFaultState;

}

