#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NevadaUI

#include "Basic.hpp"

#include "NevadaRuntime_structs.hpp"


namespace SDK::Params
{

// Function NevadaUI.FortNevadaVehicleReticle.OnBatteryChanged
// 0x0004 (0x0004 - 0x0000)
struct FortNevadaVehicleReticle_OnBatteryChanged final
{
public:
	float                                         BatteryLevel;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortNevadaVehicleReticle_OnBatteryChanged;

// Function NevadaUI.FortNevadaVehicleReticle.OnEnergyCannonEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct FortNevadaVehicleReticle_OnEnergyCannonEnabledChanged final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortNevadaVehicleReticle_OnEnergyCannonEnabledChanged;

// Function NevadaUI.FortNevadaVehicleReticle.OnEnergyCanonFired
// 0x0004 (0x0004 - 0x0000)
struct FortNevadaVehicleReticle_OnEnergyCanonFired final
{
public:
	float                                         Cooldown;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortNevadaVehicleReticle_OnEnergyCanonFired;

// Function NevadaUI.FortNevadaVehicleReticle.OnTractorBeamDeactivated
// 0x0004 (0x0004 - 0x0000)
struct FortNevadaVehicleReticle_OnTractorBeamDeactivated final
{
public:
	float                                         Cooldown;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortNevadaVehicleReticle_OnTractorBeamDeactivated;

// Function NevadaUI.FortNevadaVehicleReticle.OnTractorBeamEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct FortNevadaVehicleReticle_OnTractorBeamEnabledChanged final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortNevadaVehicleReticle_OnTractorBeamEnabledChanged;

// Function NevadaUI.FortNevadaVehicleReticle.OnVehicleStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortNevadaVehicleReticle_OnVehicleStateChanged final
{
public:
	ENevadaFlightStates                           VehicleState;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortNevadaVehicleReticle_OnVehicleStateChanged;

// Function NevadaUI.NevadaTargetIndicator.OnTargetActorChanged
// 0x0008 (0x0008 - 0x0000)
struct NevadaTargetIndicator_OnTargetActorChanged final
{
public:
	class AActor*                                 TargetedActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NevadaTargetIndicator_OnTargetActorChanged;

// Function NevadaUI.NevadaTargetIndicator.OnTractorBeamActivated
// 0x0001 (0x0001 - 0x0000)
struct NevadaTargetIndicator_OnTractorBeamActivated final
{
public:
	bool                                          bActivated;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NevadaTargetIndicator_OnTractorBeamActivated;

// Function NevadaUI.NevadaTargetIndicator.OnTractorBeamAttached
// 0x0001 (0x0001 - 0x0000)
struct NevadaTargetIndicator_OnTractorBeamAttached final
{
public:
	bool                                          bAttached;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NevadaTargetIndicator_OnTractorBeamAttached;

}

