#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ParallelRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ParallelRuntime.FortSwingingLayerAnimInstance.GetAttachVectorInPlayerSpace
// 0x0018 (0x0018 - 0x0000)
struct FortSwingingLayerAnimInstance_GetAttachVectorInPlayerSpace final
{
public:
	struct FVector                                InPlayerToAttachPoint;                             // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSwingingLayerAnimInstance_GetAttachVectorInPlayerSpace;

// Function ParallelRuntime.FortSwingingLayerAnimInstance.GetPlayerAnglesFromAttachPoint
// 0x000C (0x000C - 0x0000)
struct FortSwingingLayerAnimInstance_GetPlayerAnglesFromAttachPoint final
{
public:
	float                                         Pitch;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Roll;                                              // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Yaw;                                               // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSwingingLayerAnimInstance_GetPlayerAnglesFromAttachPoint;

}

