#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PictureInPictureCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_classes.hpp"
#include "MediaUtils_structs.hpp"
#include "PictureInPictureDescriptors_structs.hpp"
#include "PictureInPictureCore_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class PictureInPictureCore.PictureInPictureSubsystem
// 0x00F0 (0x0120 - 0x0030)
class UPictureInPictureSubsystem final : public UEngineSubsystem
{
public:
	TArray<class UPictureInPicturePartnerDataAsset*> AvailableClientsList;                           // 0x0030(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPartnerUpdateComplete;                           // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UPictureInPicturePartnerControls* NewPartner)> OnPartnerChanged; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bPartnerListUpdated;                               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsSuspended;                                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CurrentPlatform;                                   // 0x0068(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x10];                                      // 0x0078(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class UPictureInPicturePartnerControls*> SupportedPartnerControls;           // 0x0088(0x0050)(NativeAccessSpecifierPrivate)
	class FString                                 CurrentPartnerName;                                // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 CurrentContinent;                                  // 0x00E8(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 CurrentCountry;                                    // 0x00F8(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FString>                         CurrentSubdivisions;                               // 0x0108(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetAutoEnableSetting();
	class UPictureInPictureClient* GetCurrentPartnerClient();
	class UPictureInPictureMediaController* GetCurrentPartnerController();
	class UPictureInPicturePartnerControls* GetCurrentPartnerControls();
	class UPictureInPicturePartnerDataAsset* GetCurrentPartnerItem();
	void GetLastUsedPartner(class FString* OutPartnerName);
	void GetLastUsedSource(class FString* OutPartnerSourceName);
	class UPictureInPictureClient* GetPartnerClient(const class FString& PartnerName);
	class UPictureInPictureMediaController* GetPartnerController(const class FString& PartnerName);
	class UPictureInPicturePartnerControls* GetPartnerControls(const class FString& PartnerName);
	class UPictureInPicturePartnerDataAsset* GetPartnerItem(const class FString& PartnerName);
	TArray<class UPictureInPicturePartnerDataAsset*> GetPartnerItemList();
	void HandleMediaSourceRequest();
	bool IsPartnerListUpdated();
	void OnCurrentPartnerSourceSelected(const struct FPiPPartnerSource& SelectedSource);
	void ResumeCurrentMediaController();
	void SetCurrentMediaControllerEnabled(bool InEnabled);
	void ShutdownAllPartners();
	void StoreAutoEnableSetting(bool InUserEnabled);
	void StoreLastUsedPartner(const class FString& InPartnerName);
	void StoreLastUsedSource(const class FString& InPartnerSourceName);
	void SuspendCurrentMediaController();
	void UpdatePartnerItemList(class UObject* InWorldContext, bool bForce);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PictureInPictureSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PictureInPictureSubsystem")
	}
	static class UPictureInPictureSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureSubsystem>();
	}
};
DUMPER7_ASSERTS_UPictureInPictureSubsystem;

// Class PictureInPictureCore.PictureInPictureCheatManager
// 0x0000 (0x0028 - 0x0028)
class UPictureInPictureCheatManager final : public UChildCheatManager
{
public:
	void CanEnablePartnerPiP();
	void DisablePiP();
	void EnablePiP();
	void ResumePiP();
	void SuspendPiP();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PictureInPictureCheatManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PictureInPictureCheatManager")
	}
	static class UPictureInPictureCheatManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureCheatManager>();
	}
};
DUMPER7_ASSERTS_UPictureInPictureCheatManager;

// Class PictureInPictureCore.PictureInPictureCoreEnableDisableAction
// 0x0000 (0x0028 - 0x0028)
class UPictureInPictureCoreEnableDisableAction final : public UFortUIGameFeatureAction
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PictureInPictureCoreEnableDisableAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PictureInPictureCoreEnableDisableAction")
	}
	static class UPictureInPictureCoreEnableDisableAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureCoreEnableDisableAction>();
	}
};
DUMPER7_ASSERTS_UPictureInPictureCoreEnableDisableAction;

// Class PictureInPictureCore.PictureInPictureMediaController
// 0x04E0 (0x0508 - 0x0028)
class UPictureInPictureMediaController : public UObject
{
public:
	class FString                                 PartnerName;                                       // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPictureInPictureActionData*>    ActionDataArray;                                   // 0x0038(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FPIPVideoPlayerAssetConfig             DefaultPlayerAssetConfig;                          // 0x0048(0x0078)(NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FPIPVideoPlayerAssetConfig             PlayerAssetConfig;                                 // 0x00C0(0x0078)(NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UPictureInPicturePlayer*                VideoWidget;                                       // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FPIPVideoPlayerConfig                  VideoWidgetConfig;                                 // 0x0140(0x0048)(Protected, NativeAccessSpecifierProtected)
	class UCommonLazyImage*                       ThumbnailImageNext;                                // 0x0188(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonLazyImage*                       ThumbnailImagePrevious;                            // 0x0190(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSupportsMultipleSources;                          // 0x0198(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPiPPartnerSource                      CurrentSource;                                     // 0x01A0(0x0118)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FPiPPartnerSource>              Sources;                                           // 0x02B8(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FPiPPartnerSource>              ValidSources;                                      // 0x02C8(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FMediaPlayerOptions                    LocalOptions;                                      // 0x02D8(0x0030)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(int32 ErrorType, const class FString& ErrorMessage)> BaseErrorEvent; // 0x0308(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(bool IsEnabled)> BaseEnabledEvent;                                 // 0x0318(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(const TArray<struct FPiPPartnerSource>& Sources)> SourcesChangedEvent; // 0x0328(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(const struct FPiPPartnerSource& Source)> SourceSelectedEvent;      // 0x0338(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPictureInPictureActionConfig>  InstanceActionData;                                // 0x0350(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UPictureInPictureAnalyticsManager*      AnalyticsManager;                                  // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDateTime                              ActiveStartTime;                                   // 0x0368(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDateTime                              PausedStartTime;                                   // 0x0370(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_378[0x8];                                      // 0x0378(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPiPSuspendInfo                        SuspendedInfo;                                     // 0x0380(0x0120)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A0[0x68];                                     // 0x04A0(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Exit(bool bStop);
	TArray<class UPictureInPictureActionData*> GetActions();
	struct FPiPPartnerSource GetCurrentSource();
	TArray<struct FPiPPartnerSource> GetSources();
	TArray<struct FPiPPartnerSource> GetValidSources();
	void HandleSourceSelectedEvent(const class FString& SelectedSource);
	bool IsMultiSourceSupported();
	bool IsPaused();
	bool IsPlaying();
	void OnMediaClosedAnalytics();
	void OnMediaPausedAnalytics();
	void OnMediaResumedAnalytics();
	void OnMediaStartedAnalytics();
	void OnNextThumbnailReceived(class UTexture2DDynamic* InTexture);
	void OnPrevThumbnailReceived(class UTexture2DDynamic* InTexture);
	void Pause();
	void Play(bool bForcePlay);
	void SetCurrentSource(const struct FPiPPartnerSource& SelectedSource);
	void SetEnabled(bool bIsEnabled, bool bIsFromUser);
	void Stop();

	const struct FPIPVideoPlayerAssetConfig GetDefaultPlayerAssetConfig() const;
	class UPictureInPicturePlayer* GetMediaPlayerWidget() const;
	const struct FPIPVideoPlayerAssetConfig GetPlayerAssetConfig() const;
	bool IsEnabled() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PictureInPictureMediaController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PictureInPictureMediaController")
	}
	static class UPictureInPictureMediaController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureMediaController>();
	}
};
DUMPER7_ASSERTS_UPictureInPictureMediaController;

// Class PictureInPictureCore.PictureInPictureMediaPlayerCtrl
// 0x0010 (0x0128 - 0x0118)
class UPictureInPictureMediaPlayerCtrl final : public UFortMediaPlayerCtrl
{
public:
	uint8                                         Pad_118[0x10];                                     // 0x0118(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PictureInPictureMediaPlayerCtrl")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PictureInPictureMediaPlayerCtrl")
	}
	static class UPictureInPictureMediaPlayerCtrl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureMediaPlayerCtrl>();
	}
};
DUMPER7_ASSERTS_UPictureInPictureMediaPlayerCtrl;

// Class PictureInPictureCore.PictureInPicturePlayer
// 0x01F8 (0x0220 - 0x0028)
class UPictureInPicturePlayer final : public UObject
{
public:
	uint8                                         Pad_28[0xE0];                                      // 0x0028(0x00E0)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPIPVideoPlayerAssetConfig             AssetConfig;                                       // 0x0108(0x0078)(Transient, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UPictureInPictureMediaPlayerCtrl*       MediaController;                                   // 0x0180(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_188[0x50];                                     // 0x0188(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundSubmixBase*                       DefaultSubmix;                                     // 0x01D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundSubmixBase*                       LicensedSubmix;                                    // 0x01E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1E8[0x38];                                     // 0x01E8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleUCPAudioChanged(class UFortClientSettingsRecord* Settings);
	bool IsAssetConfigSet();
	void SetPlayerAssetConfig(struct FPIPVideoPlayerAssetConfig& InAssetConfig, bool bFlush);
	void StreamedVideoOnUrlFailure(const class FString& URL);
	void StreamedVideoOnUrlSuccess(const class FString& URL);
	void UpdateStreamingPlayerSize(const struct FVector2D& InVector);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PictureInPicturePlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PictureInPicturePlayer")
	}
	static class UPictureInPicturePlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPicturePlayer>();
	}
};
DUMPER7_ASSERTS_UPictureInPicturePlayer;

// Class PictureInPictureCore.PictureInPictureClient
// 0x0080 (0x00A8 - 0x0028)
class UPictureInPictureClient : public UObject
{
public:
	TMulticastInlineDelegate<void()>              LoginSuccessEvent;                                 // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              LogoutSuccessEvent;                                // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTexture2DDynamic* QRCodeTexture)> QRCodeReceivedEvent;      // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& ErrorName, const class FString& ErrorMessage)> ErrorDelegate; // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UserName;                                          // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEpicCMSImage*                          UserAvatarImage;                                   // 0x0080(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2DDynamic*                      CurrentQRCodeTexture;                              // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_98[0x10];                                      // 0x0098(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginLogin(class UObject* InWorldContext);
	void CheckLogin(class UObject* InWorldContext);
	void EndLogin(class UObject* InWorldContext);
	class UEpicCMSImage* GetAvatarImage();
	const EPictureInPictureAuthState GetLoginState();
	class UTexture2DDynamic* GetQRCodeTexture();
	bool IsLoggedIn();
	void Logout();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PictureInPictureClient")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PictureInPictureClient")
	}
	static class UPictureInPictureClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureClient>();
	}
};
DUMPER7_ASSERTS_UPictureInPictureClient;

// Class PictureInPictureCore.PictureInPicturePartnerControls
// 0x0018 (0x0040 - 0x0028)
class UPictureInPicturePartnerControls final : public UObject
{
public:
	bool                                          bRequiresAgeOfConsent;                             // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPictureInPictureClient*                ClientObject;                                      // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPictureInPictureMediaController*       MediaController;                                   // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PictureInPicturePartnerControls")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PictureInPicturePartnerControls")
	}
	static class UPictureInPicturePartnerControls* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPicturePartnerControls>();
	}
};
DUMPER7_ASSERTS_UPictureInPicturePartnerControls;

}

