#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PictureInPictureFNEvents

#include "Basic.hpp"

#include "PictureInPictureDescriptors_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function PictureInPictureFNEvents.LiveEventHUDAd.ShowAdvertisement
// 0x0001 (0x0001 - 0x0000)
struct LiveEventHUDAd_ShowAdvertisement final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LiveEventHUDAd_ShowAdvertisement;

// Function PictureInPictureFNEvents.PictureInPictureFNEventsCheatManager.AddPiPEvent
// 0x0020 (0x0020 - 0x0000)
struct PictureInPictureFNEventsCheatManager_AddPiPEvent final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VUID;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureFNEventsCheatManager_AddPiPEvent;

// Function PictureInPictureFNEvents.PictureInPictureFNEventsCheatManager.RemovePiPEvent
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureFNEventsCheatManager_RemovePiPEvent final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureFNEventsCheatManager_RemovePiPEvent;

// Function PictureInPictureFNEvents.PictureInPictureFNEventsCheatManager.SelectPiPEvent
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureFNEventsCheatManager_SelectPiPEvent final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureFNEventsCheatManager_SelectPiPEvent;

// Function PictureInPictureFNEvents.PictureInPictureFNEventsController.AddPartnerActionAnalytics
// 0x0018 (0x0018 - 0x0000)
struct PictureInPictureFNEventsController_AddPartnerActionAnalytics final
{
public:
	class FString                                 InPartnerName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPictureInPictureAction                       InActionType;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PictureInPictureFNEventsController_AddPartnerActionAnalytics;

// Function PictureInPictureFNEvents.PictureInPictureFNEventsController.HandleFNMediaEventsStreams
// 0x0058 (0x0058 - 0x0000)
struct PictureInPictureFNEventsController_HandleFNMediaEventsStreams final
{
public:
	struct FFortMediaEventsStreamAssets           VideoStreamAssets;                                 // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureFNEventsController_HandleFNMediaEventsStreams;

// Function PictureInPictureFNEvents.PictureInPictureFNEventsController.HandleFNMediaRemoveEventsStream
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureFNEventsController_HandleFNMediaRemoveEventsStream final
{
public:
	class FString                                 InEventName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureFNEventsController_HandleFNMediaRemoveEventsStream;

// Function PictureInPictureFNEvents.PictureInPictureFNEventsController.UpdateClientLoginState
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureFNEventsController_UpdateClientLoginState final
{
public:
	TArray<struct FPiPPartnerSource>              UpdatedSources;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureFNEventsController_UpdateClientLoginState;

}

