#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PictureInPictureUI

#include "Basic.hpp"

#include "PictureInPictureDescriptors_structs.hpp"
#include "CommonUILegacy_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class PictureInPictureUI.PictureInPictureBladeMenuButton
// 0x0000 (0x0F00 - 0x0F00)
class UPictureInPictureBladeMenuButton : public UCommonButtonLegacy
{
public:
	void HandlePiPEnabled(const bool Enabled);
	void HandlePiPLoginSuccess();
	void HandlePiPLogoutSuccess();
	void OnPartnerListUpdated();
	void UpdatePiPStatusBP(const bool LoggedIn, const bool Enabled, const bool ParentalControlsEnabled);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PictureInPictureBladeMenuButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PictureInPictureBladeMenuButton")
	}
	static class UPictureInPictureBladeMenuButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureBladeMenuButton>();
	}
};
DUMPER7_ASSERTS_UPictureInPictureBladeMenuButton;

// Class PictureInPictureUI.PictureInPictureLoadingScreenOverlayAction
// 0x0038 (0x0060 - 0x0028)
class UPictureInPictureLoadingScreenOverlayAction final : public UFortUIGameFeatureAction
{
public:
	class USubtitleDisplayNative*                 SubtitleDisplay;                                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PictureInPictureLoadingScreenOverlayAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PictureInPictureLoadingScreenOverlayAction")
	}
	static class UPictureInPictureLoadingScreenOverlayAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureLoadingScreenOverlayAction>();
	}
};
DUMPER7_ASSERTS_UPictureInPictureLoadingScreenOverlayAction;

// Class PictureInPictureUI.PictureInPictureMetadataOverlay
// 0x0000 (0x0330 - 0x0330)
class UPictureInPictureMetadataOverlay : public UCommonActivatableWidget
{
public:
	void HandleOnPIPVideoResumed();
	void HandleOnPIPVideoStarted();
	void OnMediaStarted();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PictureInPictureMetadataOverlay")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PictureInPictureMetadataOverlay")
	}
	static class UPictureInPictureMetadataOverlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureMetadataOverlay>();
	}
};
DUMPER7_ASSERTS_UPictureInPictureMetadataOverlay;

// Class PictureInPictureUI.PictureInPicturePanelWidget
// 0x01D8 (0x0508 - 0x0330)
class UPictureInPicturePanelWidget : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_330[0x8];                                      // 0x0330(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBox*                               Video_Size_Box;                                    // 0x0338(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_Movie;                                       // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonLazyImage*                       Image_Thumbnail_Prev;                              // 0x0348(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonLazyImage*                       Image_Thumbnail_Next;                              // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNamedSlot*                             MetadataOverlaySlot;                               // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    PressedObjectInputAction;                          // 0x0360(0x0010)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_370[0x8];                                      // 0x0370(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UPictureInPicturePartnerControls*       CurrentPartner;                                    // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableUCPCheck;                                   // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonActivatableWidget>   SourcePickerClass;                                 // 0x0388(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USoundSourceBus*                        SourceBus;                                         // 0x0390(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActionWidget*                    ToggleActionWidget;                                // 0x0398(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonActivatableWidget*               SourcePickerWidget;                                // 0x03A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPictureInPicturePlayer*                VideoWidget;                                       // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3B0[0x28];                                     // 0x03B0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        PIPSoundComponent;                                 // 0x03D8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPiPPartnerSource                      CurrentSource;                                     // 0x03E0(0x0118)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4F8[0x8];                                      // 0x04F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USubtitleDisplay*                       Subtitles;                                         // 0x0500(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void AutoEnableController();
	void DestroyPIPSoundComponent();
	void FlipPIPAudioSubmix(bool bInDefault, const struct FFortMediaEventsStreamAssets& InStreamAssets, bool bForce);
	void HandleIsPictureInPictureEnabledChanged(bool bIsPiPEnabled);
	void HandleOnPartnerChanged(class UPictureInPicturePartnerControls* NewPartnerControls);
	void HandleOnPartnerListUpdated();
	void HandleOnPartnerSourceChanged(const struct FPiPPartnerSource& InSelectedSource);
	void HandleToggleFullscreenMap(bool bFullscreenMapVisible);
	void IntentionalDeactivate();
	void SetupPIPSoundComponent(const struct FFortMediaEventsStreamAssets& InStreamAssets);
	void ShowDebugInfo(bool bShow);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PictureInPicturePanelWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PictureInPicturePanelWidget")
	}
	static class UPictureInPicturePanelWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPicturePanelWidget>();
	}
};
DUMPER7_ASSERTS_UPictureInPicturePanelWidget;

// Class PictureInPictureUI.PictureInPictureSourcePicker
// 0x0040 (0x0370 - 0x0330)
class UPictureInPictureSourcePicker : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_330[0x9];                                      // 0x0330(0x0009)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrimaryContentSetup                   PrimaryContentSetup;                               // 0x0339(0x0001)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_33A[0x6];                                      // 0x033A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_ItemName;                                     // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortPickerOverlay*                     PickerOverlay_MediaSource;                         // 0x0348(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture2D*                             DefaultItemTexture;                                // 0x0350(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPictureInPictureMediaController*       CurrentPartner;                                    // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_360[0x10];                                     // 0x0360(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOnPartnerChanged(class UPictureInPicturePartnerControls* NewPartner);
	void HandleOnPartnerSourceChanged(const TArray<struct FPiPPartnerSource>& CurrentSources);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PictureInPictureSourcePicker")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PictureInPictureSourcePicker")
	}
	static class UPictureInPictureSourcePicker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPictureInPictureSourcePicker>();
	}
};
DUMPER7_ASSERTS_UPictureInPictureSourcePicker;

}

