#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PictureInPictureCore

#include "Basic.hpp"

#include "PictureInPictureDescriptors_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PictureInPictureCore_structs.hpp"


namespace SDK::Params
{

// Function PictureInPictureCore.PictureInPictureSubsystem.GetAutoEnableSetting
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureSubsystem_GetAutoEnableSetting final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureSubsystem_GetAutoEnableSetting;

// Function PictureInPictureCore.PictureInPictureSubsystem.GetCurrentPartnerClient
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureSubsystem_GetCurrentPartnerClient final
{
public:
	class UPictureInPictureClient*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureSubsystem_GetCurrentPartnerClient;

// Function PictureInPictureCore.PictureInPictureSubsystem.GetCurrentPartnerController
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureSubsystem_GetCurrentPartnerController final
{
public:
	class UPictureInPictureMediaController*       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureSubsystem_GetCurrentPartnerController;

// Function PictureInPictureCore.PictureInPictureSubsystem.GetCurrentPartnerControls
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureSubsystem_GetCurrentPartnerControls final
{
public:
	class UPictureInPicturePartnerControls*       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureSubsystem_GetCurrentPartnerControls;

// Function PictureInPictureCore.PictureInPictureSubsystem.GetCurrentPartnerItem
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureSubsystem_GetCurrentPartnerItem final
{
public:
	class UPictureInPicturePartnerDataAsset*      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureSubsystem_GetCurrentPartnerItem;

// Function PictureInPictureCore.PictureInPictureSubsystem.GetLastUsedPartner
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureSubsystem_GetLastUsedPartner final
{
public:
	class FString                                 OutPartnerName;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureSubsystem_GetLastUsedPartner;

// Function PictureInPictureCore.PictureInPictureSubsystem.GetLastUsedSource
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureSubsystem_GetLastUsedSource final
{
public:
	class FString                                 OutPartnerSourceName;                              // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureSubsystem_GetLastUsedSource;

// Function PictureInPictureCore.PictureInPictureSubsystem.GetPartnerClient
// 0x0018 (0x0018 - 0x0000)
struct PictureInPictureSubsystem_GetPartnerClient final
{
public:
	class FString                                 PartnerName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPictureInPictureClient*                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureSubsystem_GetPartnerClient;

// Function PictureInPictureCore.PictureInPictureSubsystem.GetPartnerController
// 0x0018 (0x0018 - 0x0000)
struct PictureInPictureSubsystem_GetPartnerController final
{
public:
	class FString                                 PartnerName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPictureInPictureMediaController*       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureSubsystem_GetPartnerController;

// Function PictureInPictureCore.PictureInPictureSubsystem.GetPartnerControls
// 0x0018 (0x0018 - 0x0000)
struct PictureInPictureSubsystem_GetPartnerControls final
{
public:
	class FString                                 PartnerName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPictureInPicturePartnerControls*       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureSubsystem_GetPartnerControls;

// Function PictureInPictureCore.PictureInPictureSubsystem.GetPartnerItem
// 0x0018 (0x0018 - 0x0000)
struct PictureInPictureSubsystem_GetPartnerItem final
{
public:
	class FString                                 PartnerName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPictureInPicturePartnerDataAsset*      ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureSubsystem_GetPartnerItem;

// Function PictureInPictureCore.PictureInPictureSubsystem.GetPartnerItemList
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureSubsystem_GetPartnerItemList final
{
public:
	TArray<class UPictureInPicturePartnerDataAsset*> ReturnValue;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureSubsystem_GetPartnerItemList;

// Function PictureInPictureCore.PictureInPictureSubsystem.IsPartnerListUpdated
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureSubsystem_IsPartnerListUpdated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureSubsystem_IsPartnerListUpdated;

// Function PictureInPictureCore.PictureInPictureSubsystem.OnCurrentPartnerSourceSelected
// 0x0118 (0x0118 - 0x0000)
struct PictureInPictureSubsystem_OnCurrentPartnerSourceSelected final
{
public:
	struct FPiPPartnerSource                      SelectedSource;                                    // 0x0000(0x0118)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureSubsystem_OnCurrentPartnerSourceSelected;

// Function PictureInPictureCore.PictureInPictureSubsystem.SetCurrentMediaControllerEnabled
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureSubsystem_SetCurrentMediaControllerEnabled final
{
public:
	bool                                          InEnabled;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureSubsystem_SetCurrentMediaControllerEnabled;

// Function PictureInPictureCore.PictureInPictureSubsystem.StoreAutoEnableSetting
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureSubsystem_StoreAutoEnableSetting final
{
public:
	bool                                          InUserEnabled;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureSubsystem_StoreAutoEnableSetting;

// Function PictureInPictureCore.PictureInPictureSubsystem.StoreLastUsedPartner
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureSubsystem_StoreLastUsedPartner final
{
public:
	class FString                                 InPartnerName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureSubsystem_StoreLastUsedPartner;

// Function PictureInPictureCore.PictureInPictureSubsystem.StoreLastUsedSource
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureSubsystem_StoreLastUsedSource final
{
public:
	class FString                                 InPartnerSourceName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureSubsystem_StoreLastUsedSource;

// Function PictureInPictureCore.PictureInPictureSubsystem.UpdatePartnerItemList
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureSubsystem_UpdatePartnerItemList final
{
public:
	class UObject*                                InWorldContext;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForce;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PictureInPictureSubsystem_UpdatePartnerItemList;

// Function PictureInPictureCore.PictureInPictureMediaController.Exit
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureMediaController_Exit final
{
public:
	bool                                          bStop;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureMediaController_Exit;

// Function PictureInPictureCore.PictureInPictureMediaController.GetActions
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureMediaController_GetActions final
{
public:
	TArray<class UPictureInPictureActionData*>    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureMediaController_GetActions;

// Function PictureInPictureCore.PictureInPictureMediaController.GetCurrentSource
// 0x0118 (0x0118 - 0x0000)
struct PictureInPictureMediaController_GetCurrentSource final
{
public:
	struct FPiPPartnerSource                      ReturnValue;                                       // 0x0000(0x0118)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureMediaController_GetCurrentSource;

// Function PictureInPictureCore.PictureInPictureMediaController.GetSources
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureMediaController_GetSources final
{
public:
	TArray<struct FPiPPartnerSource>              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureMediaController_GetSources;

// Function PictureInPictureCore.PictureInPictureMediaController.GetValidSources
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureMediaController_GetValidSources final
{
public:
	TArray<struct FPiPPartnerSource>              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureMediaController_GetValidSources;

// Function PictureInPictureCore.PictureInPictureMediaController.HandleSourceSelectedEvent
// 0x0010 (0x0010 - 0x0000)
struct PictureInPictureMediaController_HandleSourceSelectedEvent final
{
public:
	class FString                                 SelectedSource;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureMediaController_HandleSourceSelectedEvent;

// Function PictureInPictureCore.PictureInPictureMediaController.IsMultiSourceSupported
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureMediaController_IsMultiSourceSupported final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureMediaController_IsMultiSourceSupported;

// Function PictureInPictureCore.PictureInPictureMediaController.IsPaused
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureMediaController_IsPaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureMediaController_IsPaused;

// Function PictureInPictureCore.PictureInPictureMediaController.IsPlaying
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureMediaController_IsPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureMediaController_IsPlaying;

// Function PictureInPictureCore.PictureInPictureMediaController.OnNextThumbnailReceived
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureMediaController_OnNextThumbnailReceived final
{
public:
	class UTexture2DDynamic*                      InTexture;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureMediaController_OnNextThumbnailReceived;

// Function PictureInPictureCore.PictureInPictureMediaController.OnPrevThumbnailReceived
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureMediaController_OnPrevThumbnailReceived final
{
public:
	class UTexture2DDynamic*                      InTexture;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureMediaController_OnPrevThumbnailReceived;

// Function PictureInPictureCore.PictureInPictureMediaController.Play
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureMediaController_Play final
{
public:
	bool                                          bForcePlay;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureMediaController_Play;

// Function PictureInPictureCore.PictureInPictureMediaController.SetCurrentSource
// 0x0118 (0x0118 - 0x0000)
struct PictureInPictureMediaController_SetCurrentSource final
{
public:
	struct FPiPPartnerSource                      SelectedSource;                                    // 0x0000(0x0118)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureMediaController_SetCurrentSource;

// Function PictureInPictureCore.PictureInPictureMediaController.SetEnabled
// 0x0002 (0x0002 - 0x0000)
struct PictureInPictureMediaController_SetEnabled final
{
public:
	bool                                          bIsEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFromUser;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureMediaController_SetEnabled;

// Function PictureInPictureCore.PictureInPictureMediaController.GetDefaultPlayerAssetConfig
// 0x0078 (0x0078 - 0x0000)
struct PictureInPictureMediaController_GetDefaultPlayerAssetConfig final
{
public:
	struct FPIPVideoPlayerAssetConfig             ReturnValue;                                       // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureMediaController_GetDefaultPlayerAssetConfig;

// Function PictureInPictureCore.PictureInPictureMediaController.GetMediaPlayerWidget
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureMediaController_GetMediaPlayerWidget final
{
public:
	class UPictureInPicturePlayer*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureMediaController_GetMediaPlayerWidget;

// Function PictureInPictureCore.PictureInPictureMediaController.GetPlayerAssetConfig
// 0x0078 (0x0078 - 0x0000)
struct PictureInPictureMediaController_GetPlayerAssetConfig final
{
public:
	struct FPIPVideoPlayerAssetConfig             ReturnValue;                                       // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureMediaController_GetPlayerAssetConfig;

// Function PictureInPictureCore.PictureInPictureMediaController.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureMediaController_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureMediaController_IsEnabled;

// Function PictureInPictureCore.PictureInPicturePlayer.HandleUCPAudioChanged
// 0x0008 (0x0008 - 0x0000)
struct PictureInPicturePlayer_HandleUCPAudioChanged final
{
public:
	class UFortClientSettingsRecord*              Settings;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPicturePlayer_HandleUCPAudioChanged;

// Function PictureInPictureCore.PictureInPicturePlayer.IsAssetConfigSet
// 0x0001 (0x0001 - 0x0000)
struct PictureInPicturePlayer_IsAssetConfigSet final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPicturePlayer_IsAssetConfigSet;

// Function PictureInPictureCore.PictureInPicturePlayer.SetPlayerAssetConfig
// 0x0080 (0x0080 - 0x0000)
struct PictureInPicturePlayer_SetPlayerAssetConfig final
{
public:
	struct FPIPVideoPlayerAssetConfig             InAssetConfig;                                     // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bFlush;                                            // 0x0078(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PictureInPicturePlayer_SetPlayerAssetConfig;

// Function PictureInPictureCore.PictureInPicturePlayer.StreamedVideoOnUrlFailure
// 0x0010 (0x0010 - 0x0000)
struct PictureInPicturePlayer_StreamedVideoOnUrlFailure final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPicturePlayer_StreamedVideoOnUrlFailure;

// Function PictureInPictureCore.PictureInPicturePlayer.StreamedVideoOnUrlSuccess
// 0x0010 (0x0010 - 0x0000)
struct PictureInPicturePlayer_StreamedVideoOnUrlSuccess final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPicturePlayer_StreamedVideoOnUrlSuccess;

// Function PictureInPictureCore.PictureInPicturePlayer.UpdateStreamingPlayerSize
// 0x0008 (0x0008 - 0x0000)
struct PictureInPicturePlayer_UpdateStreamingPlayerSize final
{
public:
	struct FVector2D                              InVector;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPicturePlayer_UpdateStreamingPlayerSize;

// Function PictureInPictureCore.PictureInPictureClient.BeginLogin
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureClient_BeginLogin final
{
public:
	class UObject*                                InWorldContext;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureClient_BeginLogin;

// Function PictureInPictureCore.PictureInPictureClient.CheckLogin
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureClient_CheckLogin final
{
public:
	class UObject*                                InWorldContext;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureClient_CheckLogin;

// Function PictureInPictureCore.PictureInPictureClient.EndLogin
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureClient_EndLogin final
{
public:
	class UObject*                                InWorldContext;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureClient_EndLogin;

// Function PictureInPictureCore.PictureInPictureClient.GetAvatarImage
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureClient_GetAvatarImage final
{
public:
	class UEpicCMSImage*                          ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureClient_GetAvatarImage;

// Function PictureInPictureCore.PictureInPictureClient.GetLoginState
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureClient_GetLoginState final
{
public:
	EPictureInPictureAuthState                    ReturnValue;                                       // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureClient_GetLoginState;

// Function PictureInPictureCore.PictureInPictureClient.GetQRCodeTexture
// 0x0008 (0x0008 - 0x0000)
struct PictureInPictureClient_GetQRCodeTexture final
{
public:
	class UTexture2DDynamic*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureClient_GetQRCodeTexture;

// Function PictureInPictureCore.PictureInPictureClient.IsLoggedIn
// 0x0001 (0x0001 - 0x0000)
struct PictureInPictureClient_IsLoggedIn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PictureInPictureClient_IsLoggedIn;

}

