#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PiPBladeMenuButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function PiPBladeMenuButton.PiPBladeMenuButton_C.ExecuteUbergraph_PiPBladeMenuButton
// 0x0018 (0x0018 - 0x0000)
struct PiPBladeMenuButton_C_ExecuteUbergraph_PiPBladeMenuButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_LoggedIn;                             // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Enabled;                              // 0x0005(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ParentalControlsEnabled;              // 0x0006(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PiPBladeMenuButton_C_ExecuteUbergraph_PiPBladeMenuButton;

// Function PiPBladeMenuButton.PiPBladeMenuButton_C.UpdatePiPStatusBP
// 0x0003 (0x0003 - 0x0000)
struct PiPBladeMenuButton_C_UpdatePiPStatusBP final
{
public:
	bool                                          LoggedIn;                                          // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enabled;                                           // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ParentalControlsEnabled;                           // 0x0002(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PiPBladeMenuButton_C_UpdatePiPStatusBP;

// Function PiPBladeMenuButton.PiPBladeMenuButton_C.UpdateStatus
// 0x0098 (0x0098 - 0x0000)
struct PiPBladeMenuButton_C_UpdateStatus final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoggedIn;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsParentalControlsEnabled;                         // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OffStatusText;                                     // 0x0008(0x0018)(Edit, BlueprintVisible)
	class FText                                   OnStatusText;                                      // 0x0020(0x0018)(Edit, BlueprintVisible)
	class FText                                   DisabledText;                                      // 0x0038(0x0018)(Edit, BlueprintVisible)
	class FText                                   TurnOffText;                                       // 0x0050(0x0018)(Edit, BlueprintVisible)
	class FText                                   TurnOnText;                                        // 0x0068(0x0018)(Edit, BlueprintVisible)
	class FText                                   LogInText;                                         // 0x0080(0x0018)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_PiPBladeMenuButton_C_UpdateStatus;

}

