#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveyRatingChoice

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PlayerSurveyRatingChoice.PlayerSurveyRatingChoice_C.ExecuteUbergraph_PlayerSurveyRatingChoice
// 0x0004 (0x0004 - 0x0000)
struct PlayerSurveyRatingChoice_C_ExecuteUbergraph_PlayerSurveyRatingChoice final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PlayerSurveyRatingChoice_C_ExecuteUbergraph_PlayerSurveyRatingChoice;

// Function PlayerSurveyRatingChoice.PlayerSurveyRatingChoice_C.GetCurrentButtonBrush
// 0x09C0 (0x09C0 - 0x0000)
struct PlayerSurveyRatingChoice_C_GetCurrentButtonBrush final
{
public:
	struct FSlateBrush                            CurrentBrush;                                      // 0x0000(0x00B0)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPressed_ReturnValue;                    // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPressed_ReturnValue_1;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue_1;                  // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonStyle*                     CallFunc_GetStyle_ReturnValue;                     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetDisabledBrush_Brush;                   // 0x00D0(0x00B0)()
	struct FSlateBrush                            CallFunc_GetNormalBaseBrush_Brush;                 // 0x0180(0x00B0)()
	struct FSlateBrush                            CallFunc_GetNormalHoveredBrush_Brush;              // 0x0230(0x00B0)()
	struct FSlateBrush                            CallFunc_GetNormalPressedBrush_Brush;              // 0x02E0(0x00B0)()
	struct FSlateBrush                            K2Node_Select_Default;                             // 0x0390(0x00B0)()
	struct FSlateBrush                            CallFunc_GetSelectedPressedBrush_Brush;            // 0x0440(0x00B0)()
	struct FSlateBrush                            K2Node_Select_Default_1;                           // 0x04F0(0x00B0)()
	struct FSlateBrush                            CallFunc_GetSelectedBaseBrush_Brush;               // 0x05A0(0x00B0)()
	struct FSlateBrush                            CallFunc_GetSelectedHoveredBrush_Brush;            // 0x0650(0x00B0)()
	struct FSlateBrush                            K2Node_Select_Default_2;                           // 0x0700(0x00B0)()
	struct FSlateBrush                            K2Node_Select_Default_3;                           // 0x07B0(0x00B0)()
	struct FSlateBrush                            K2Node_Select_Default_4;                           // 0x0860(0x00B0)()
	struct FSlateBrush                            K2Node_Select_Default_5;                           // 0x0910(0x00B0)()
};
DUMPER7_ASSERTS_PlayerSurveyRatingChoice_C_GetCurrentButtonBrush;

// Function PlayerSurveyRatingChoice.PlayerSurveyRatingChoice_C.UpdateInputActionRenderOpacity
// 0x0014 (0x0014 - 0x0000)
struct PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_PlayerSurveyRatingChoice_C_UpdateInputActionRenderOpacity;

// Function PlayerSurveyRatingChoice.PlayerSurveyRatingChoice_C.UpdateTextStyle
// 0x0030 (0x0030 - 0x0000)
struct PlayerSurveyRatingChoice_C_UpdateTextStyle final
{
public:
	class UCommonTextStyle*                       CallFunc_GetCurrentTextStyle_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColor_OutColor;                        // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0014)()
};
DUMPER7_ASSERTS_PlayerSurveyRatingChoice_C_UpdateTextStyle;

}

