#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RebirthRuntime

#include "Basic.hpp"

#include "RebirthRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// Class RebirthRuntime.FortAthenaMutator_Rebirth
// 0x00A0 (0x0480 - 0x03E0)
class AFortAthenaMutator_Rebirth final : public AFortAthenaMutator_GameModeBase
{
public:
	uint8                                         Pad_3E0[0x18];                                     // 0x03E0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaMutator_ItemPromotion*       ItemPromotionMutator;                              // 0x03F8(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AFortPlayerStateAthena>  ClientViewedPlayerState;                           // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FRebirthPlayerRarity>           PlayerRarities;                                    // 0x0408(0x0010)(Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPrivate)
	TArray<struct FRebirthPlayerRarity>           CachedLocalPlayerRarities;                         // 0x0418(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	EFortRarity                                   MaxItemRarity;                                     // 0x0428(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EFortRarity                                   StartingItemRarity;                                // 0x0429(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_42A[0x6];                                      // 0x042A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EFortRarity, class FString>              KillFeedRarityStyles;                              // 0x0430(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	void OnClientSpectatorChanged(class AFortPlayerStateZone* SpectatingTarget);
	void OnRep_PlayerRarities();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaMutator_Rebirth")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaMutator_Rebirth")
	}
	static class AFortAthenaMutator_Rebirth* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_Rebirth>();
	}
};
DUMPER7_ASSERTS_AFortAthenaMutator_Rebirth;

// Class RebirthRuntime.FortCheatManager_Rebirth
// 0x0000 (0x0038 - 0x0038)
class UFortCheatManager_Rebirth final : public UFortCheatManager_Coupled
{
public:
	void PromoteItems();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortCheatManager_Rebirth")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortCheatManager_Rebirth")
	}
	static class UFortCheatManager_Rebirth* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_Rebirth>();
	}
};
DUMPER7_ASSERTS_UFortCheatManager_Rebirth;

}

