#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RebirthUI

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// Class RebirthUI.RebirthLimitedLivesWidgetBase
// 0x0018 (0x0320 - 0x0308)
class URebirthLimitedLivesWidgetBase final : public ULTMWidgetBase
{
public:
	TWeakObjectPtr<class AFortAthenaMutator_Rebirth> RebirthMutator;                                 // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AFortPlayerStateAthena>  ViewedPlayerState;                                 // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortRarity                                   CurrentRarity;                                     // 0x0318(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentLivesRemaining;                             // 0x031C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleLastLife();
	void HandlePawnChanged();
	void HandlePlayerRaritiesUpdated();
	void UpdateWidgetRarity(bool bPlayAnimations);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RebirthLimitedLivesWidgetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RebirthLimitedLivesWidgetBase")
	}
	static class URebirthLimitedLivesWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<URebirthLimitedLivesWidgetBase>();
	}
};
DUMPER7_ASSERTS_URebirthLimitedLivesWidgetBase;

}

