#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidewaysCodeRuntime

#include "Basic.hpp"

#include "SidewaysCodeRuntime_structs.hpp"


namespace SDK::Params
{

// Function SidewaysCodeRuntime.SidewaysCheatManager.SetSidewaysState
// 0x0001 (0x0001 - 0x0000)
struct SidewaysCheatManager_SetSidewaysState final
{
public:
	ESidewaysState                                SidewaysState;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SidewaysCheatManager_SetSidewaysState;

// Function SidewaysCodeRuntime.SidewaysLibrary.GetSidewaysStateComponent
// 0x0010 (0x0010 - 0x0000)
struct SidewaysLibrary_GetSidewaysStateComponent final
{
public:
	const class AActor*                           Owner;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USidewaysStateComponent*                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SidewaysLibrary_GetSidewaysStateComponent;

// Function SidewaysCodeRuntime.SidewaysStateComponent.HandleSidewaysStateChanged
// 0x0010 (0x0010 - 0x0000)
struct SidewaysStateComponent_HandleSidewaysStateChanged final
{
public:
	class ASidewaysPlayspace*                     NewSidewaysPlayspace;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESidewaysState                                OldState;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESidewaysState                                NewState;                                          // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SidewaysStateComponent_HandleSidewaysStateChanged;

// Function SidewaysCodeRuntime.SidewaysStateComponent.OnRep_SidewaysPlayspace
// 0x0008 (0x0008 - 0x0000)
struct SidewaysStateComponent_OnRep_SidewaysPlayspace final
{
public:
	class ASidewaysPlayspace*                     NewSidewaysPlayspace;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SidewaysStateComponent_OnRep_SidewaysPlayspace;

// Function SidewaysCodeRuntime.SidewaysStateComponent.OnRep_SidewaysState
// 0x0001 (0x0001 - 0x0000)
struct SidewaysStateComponent_OnRep_SidewaysState final
{
public:
	ESidewaysState                                LastSidewaysState;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SidewaysStateComponent_OnRep_SidewaysState;

// Function SidewaysCodeRuntime.SidewaysStateComponent.SetSidewaysState
// 0x0010 (0x0010 - 0x0000)
struct SidewaysStateComponent_SetSidewaysState final
{
public:
	ESidewaysState                                NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASidewaysPlayspace*                     NewSidewaysPlayspace;                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SidewaysStateComponent_SetSidewaysState;

// Function SidewaysCodeRuntime.SidewaysStateComponent.GetSidewaysState
// 0x0001 (0x0001 - 0x0000)
struct SidewaysStateComponent_GetSidewaysState final
{
public:
	ESidewaysState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SidewaysStateComponent_GetSidewaysState;

}

