#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarSettingsListEntry_Scalar_Narrow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarSettingsListEntry_Scalar_Narrow.SidebarSettingsListEntry_Scalar_Narrow_C
// 0x0028 (0x02F8 - 0x02D0)
class USidebarSettingsListEntry_Scalar_Narrow_C final : public UFortSettingsListEntrySetting_Scalar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DefaultValueLayer;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleMaterialProgressBar_C*           Progress;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USidebarSettingEntryBackground_C*       SidebarSettingEntryBackground;                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SidebarSettingsListEntry_Scalar_Narrow(int32 EntryPoint);
	class UWidget* GetPrimaryGamepadFocusWidget();
	void OnDefaultValueChanged(float DefaultValue);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnValueChanged(float Value);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SidebarSettingsListEntry_Scalar_Narrow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SidebarSettingsListEntry_Scalar_Narrow_C")
	}
	static class USidebarSettingsListEntry_Scalar_Narrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarSettingsListEntry_Scalar_Narrow_C>();
	}
};
DUMPER7_ASSERTS_USidebarSettingsListEntry_Scalar_Narrow_C;

}

