#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarPartyPortrait

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SidebarPartyPortrait.SidebarPartyPortrait_C
// 0x0028 (0x02B0 - 0x0288)
class USidebarPartyPortrait_C final : public UFortJoinablePartyPortrait
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_OnlineStatusIndicator_1;                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Crown_1;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortSocialAvatarIcon*                  Image_ValueBackground;                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsPartyLeader;                                     // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SidebarPartyPortrait(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SidebarPartyPortrait_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SidebarPartyPortrait_C")
	}
	static class USidebarPartyPortrait_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidebarPartyPortrait_C>();
	}
};
DUMPER7_ASSERTS_USidebarPartyPortrait_C;

}

