#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidebarJoinablePartyActionMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function SidebarJoinablePartyActionMenu.SidebarJoinablePartyActionMenu_C.ExecuteUbergraph_SidebarJoinablePartyActionMenu
// 0x0018 (0x0018 - 0x0000)
struct SidebarJoinablePartyActionMenu_C_ExecuteUbergraph_SidebarJoinablePartyActionMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsVisible;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SidebarJoinablePartyActionMenu_C_ExecuteUbergraph_SidebarJoinablePartyActionMenu;

// Function SidebarJoinablePartyActionMenu.SidebarJoinablePartyActionMenu_C.OnToggleConfirmation
// 0x0001 (0x0001 - 0x0000)
struct SidebarJoinablePartyActionMenu_C_OnToggleConfirmation final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SidebarJoinablePartyActionMenu_C_OnToggleConfirmation;

}

