#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_AssassinGlider_Parts_Skeleton_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_AssassinGlider_Parts_Skeleton_AnimBP.SK_AssassinGlider_Parts_Skeleton_AnimBP_C
// 0x01D0 (0x0750 - 0x0580)
class USK_AssassinGlider_Parts_Skeleton_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0580(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0588(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0590(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0598(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x05B8(0x0188)(ContainsInstancedReference)
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x0740(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void ExecuteUbergraph_SK_AssassinGlider_Parts_Skeleton_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SK_AssassinGlider_Parts_Skeleton_AnimBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SK_AssassinGlider_Parts_Skeleton_AnimBP_C")
	}
	static class USK_AssassinGlider_Parts_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_AssassinGlider_Parts_Skeleton_AnimBP_C>();
	}
};
DUMPER7_ASSERTS_USK_AssassinGlider_Parts_Skeleton_AnimBP_C;

}

