#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SnowSurfaceTreeBitArray

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ModularGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SnowSurfaceTreeBitArray.SnowSurfaceTreeBitArray_C
// 0x0028 (0x00D8 - 0x00B0)
class USnowSurfaceTreeBitArray_C final : public UGameFrameworkComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortGameStateComponent_SurfaceOverride* SurfaceOverrideComponent;                         // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AParent_Tree_Apollo_C*                  ParentTreeApollo;                                  // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ParentActor;                                       // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Static_Mesh_Component;                             // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SnowSurfaceTreeBitArray(int32 EntryPoint);
	void IsTreeInSnow();
	void ReceiveBeginPlay();
	void S_19_Is_Tree_in_Snow(bool* InSnow);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SnowSurfaceTreeBitArray_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SnowSurfaceTreeBitArray_C")
	}
	static class USnowSurfaceTreeBitArray_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USnowSurfaceTreeBitArray_C>();
	}
};
DUMPER7_ASSERTS_USnowSurfaceTreeBitArray_C;

}

