#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoundLibrary

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "SoundLibrary_structs.hpp"
#include "AudioGameplay_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class SoundLibrary.SoundLibraryContext
// 0x0008 (0x0030 - 0x0028)
class USoundLibraryContext : public UObject
{
public:
	class AActor*                                 Actor;                                             // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundLibraryContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundLibraryContext")
	}
	static class USoundLibraryContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundLibraryContext>();
	}
};
DUMPER7_ASSERTS_USoundLibraryContext;

// Class SoundLibrary.SoundLibraryAnimContext
// 0x0040 (0x0070 - 0x0030)
class USoundLibraryAnimContext final : public USoundLibraryContext
{
public:
	struct FSoundLibraryAnimContextSettings       AnimSettings;                                      // 0x0030(0x0028)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      Animation;                                         // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 MeshComponent;                                     // 0x0060(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimRate;                                          // 0x0068(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ConfigureContext(class AActor* OwningActor, class UAnimSequenceBase* InAnimation, const struct FSoundLibraryAnimContextSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundLibraryAnimContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundLibraryAnimContext")
	}
	static class USoundLibraryAnimContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundLibraryAnimContext>();
	}
};
DUMPER7_ASSERTS_USoundLibraryAnimContext;

// Class SoundLibrary.SoundLibraryAnimNotifyHelper
// 0x0040 (0x0068 - 0x0028)
class USoundLibraryAnimNotifyHelper final : public UObject
{
public:
	TArray<class UAudioComponent*>                PlayingComps;                                      // 0x0028(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FSoundLibraryPlaySoundResult           PlaybackResult;                                    // 0x0038(0x0030)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundLibraryAnimNotifyHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundLibraryAnimNotifyHelper")
	}
	static class USoundLibraryAnimNotifyHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundLibraryAnimNotifyHelper>();
	}
};
DUMPER7_ASSERTS_USoundLibraryAnimNotifyHelper;

// Class SoundLibrary.AnimNotify_SoundLibrary
// 0x0010 (0x0048 - 0x0038)
class UAnimNotify_SoundLibrary final : public UAnimNotify
{
public:
	class USoundLibraryContext*                   SoundContext;                                      // 0x0038(0x0008)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundLibraryAnimNotifyHelper*          NotifyHelper;                                      // 0x0040(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_SoundLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_SoundLibrary")
	}
	static class UAnimNotify_SoundLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_SoundLibrary>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_SoundLibrary;

// Class SoundLibrary.AnimNotifyState_SoundLibrary
// 0x0010 (0x0040 - 0x0030)
class UAnimNotifyState_SoundLibrary final : public UAnimNotifyState
{
public:
	class USoundLibraryContext*                   SoundContext;                                      // 0x0030(0x0008)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundLibraryAnimNotifyHelper*          NotifyHelper;                                      // 0x0038(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_SoundLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_SoundLibrary")
	}
	static class UAnimNotifyState_SoundLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_SoundLibrary>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_SoundLibrary;

// Class SoundLibrary.SoundLibraryComponent
// 0x0020 (0x00D8 - 0x00B8)
class USoundLibraryComponent final : public UAudioGameplayComponent
{
public:
	TMulticastInlineDelegate<void(const struct FSoundLibraryPlaySoundResult& Results, const class USoundLibraryContext* Context)> OnSoundLibraryPlayEvent; // 0x00B8(0x0010)(ZeroConstructor, Transient, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class USoundLibrary>>      SoundLibraries;                                    // 0x00C8(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundLibraryComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundLibraryComponent")
	}
	static class USoundLibraryComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundLibraryComponent>();
	}
};
DUMPER7_ASSERTS_USoundLibraryComponent;

// Class SoundLibrary.SoundLibrarySubsystem
// 0x00F0 (0x0120 - 0x0030)
class USoundLibrarySubsystem final : public UWorldSubsystem
{
public:
	TMap<class FName, class USoundLibrary*>       SoundLibraries;                                    // 0x0030(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_80[0xA0];                                      // 0x0080(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddLibraries(const class AActor* Actor, const TArray<TSubclassOf<class USoundLibrary>>& Libraries);
	void AddLibrary(const class AActor* Actor, TSubclassOf<class USoundLibrary> Library);
	void DisableEventsForActor(const class AActor* Actor);
	void EnableEventsForActor(const class AActor* Actor);
	void PlaySound(const class USoundLibraryContext* Context, struct FSoundLibraryPlaySoundResult* OutResults);
	void RemoveLibraries(const class AActor* Actor, const TArray<TSubclassOf<class USoundLibrary>>& Libraries);
	void RemoveLibrary(const class AActor* Actor, TSubclassOf<class USoundLibrary> Library);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundLibrarySubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundLibrarySubsystem")
	}
	static class USoundLibrarySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundLibrarySubsystem>();
	}
};
DUMPER7_ASSERTS_USoundLibrarySubsystem;

// Class SoundLibrary.SimpleSoundLibraryContext
// 0x0028 (0x0058 - 0x0030)
class USimpleSoundLibraryContext final : public USoundLibraryContext
{
public:
	struct FSimpleSoundLibraryContextSettings     Settings;                                          // 0x0030(0x0028)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, NativeAccessSpecifierPublic)

public:
	void ConfigureContext(class AActor* OwningActor, const struct FSimpleSoundLibraryContextSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimpleSoundLibraryContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimpleSoundLibraryContext")
	}
	static class USimpleSoundLibraryContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleSoundLibraryContext>();
	}
};
DUMPER7_ASSERTS_USimpleSoundLibraryContext;

// Class SoundLibrary.AttachedSoundLibraryContext
// 0x0048 (0x0078 - 0x0030)
class UAttachedSoundLibraryContext final : public USoundLibraryContext
{
public:
	struct FAttachedSoundLibraryContextSettings   Settings;                                          // 0x0030(0x0048)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, NativeAccessSpecifierPublic)

public:
	void ConfigureContext(class AActor* OwningActor, const struct FAttachedSoundLibraryContextSettings& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AttachedSoundLibraryContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AttachedSoundLibraryContext")
	}
	static class UAttachedSoundLibraryContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttachedSoundLibraryContext>();
	}
};
DUMPER7_ASSERTS_UAttachedSoundLibraryContext;

// Class SoundLibrary.SoundLibrary
// 0x0088 (0x00B0 - 0x0028)
class USoundLibrary : public UObject
{
public:
	TMap<struct FGameplayTag, TSoftObjectPtr<class USoundBase>> Sounds;                              // 0x0028(0x0050)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class USoundBase*>                     LoadedSoundObjects;                                // 0x0078(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0x28];                                      // 0x0088(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundLibrary")
	}
	static class USoundLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundLibrary>();
	}
};
DUMPER7_ASSERTS_USoundLibrary;

}

