#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SrirachaRanch

#include "Basic.hpp"

#include "SrirachaRanch_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function SrirachaRanch.StreamingRadioPlayerComponent.MediaExplicitClose
// 0x0001 (0x0001 - 0x0000)
struct StreamingRadioPlayerComponent_MediaExplicitClose final
{
public:
	bool                                          bReallyExplicit;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_MediaExplicitClose;

// Function SrirachaRanch.StreamingRadioPlayerComponent.MediaFailedToOpen
// 0x0010 (0x0010 - 0x0000)
struct StreamingRadioPlayerComponent_MediaFailedToOpen final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_MediaFailedToOpen;

// Function SrirachaRanch.StreamingRadioPlayerComponent.MediaReady
// 0x0010 (0x0010 - 0x0000)
struct StreamingRadioPlayerComponent_MediaReady final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_MediaReady;

// Function SrirachaRanch.StreamingRadioPlayerComponent.NativeOnPawnEnterSeat
// 0x0020 (0x0020 - 0x0000)
struct StreamingRadioPlayerComponent_NativeOnPawnEnterSeat final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              PlayerPawn;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_NativeOnPawnEnterSeat;

// Function SrirachaRanch.StreamingRadioPlayerComponent.NativeOnPawnEnterVehicle
// 0x0020 (0x0020 - 0x0000)
struct StreamingRadioPlayerComponent_NativeOnPawnEnterVehicle final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              PlayerPawn;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_NativeOnPawnEnterVehicle;

// Function SrirachaRanch.StreamingRadioPlayerComponent.NativeOnPawnExitSeat
// 0x0020 (0x0020 - 0x0000)
struct StreamingRadioPlayerComponent_NativeOnPawnExitSeat final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              PlayerPawn;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_NativeOnPawnExitSeat;

// Function SrirachaRanch.StreamingRadioPlayerComponent.NativeOnPawnExitVehicle
// 0x0020 (0x0020 - 0x0000)
struct StreamingRadioPlayerComponent_NativeOnPawnExitVehicle final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              PlayerPawn;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_NativeOnPawnExitVehicle;

// Function SrirachaRanch.StreamingRadioPlayerComponent.NativeOnVehicleOwnerChanged
// 0x0020 (0x0020 - 0x0000)
struct StreamingRadioPlayerComponent_NativeOnVehicleOwnerChanged final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           NewOwner;                                          // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           PrevOwner;                                         // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_NativeOnVehicleOwnerChanged;

// Function SrirachaRanch.StreamingRadioPlayerComponent.OnFailedURL
// 0x0010 (0x0010 - 0x0000)
struct StreamingRadioPlayerComponent_OnFailedURL final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_OnFailedURL;

// Function SrirachaRanch.StreamingRadioPlayerComponent.OnLicensedAudioSettingChanged
// 0x0008 (0x0008 - 0x0000)
struct StreamingRadioPlayerComponent_OnLicensedAudioSettingChanged final
{
public:
	class UFortClientSettingsRecord*              Settings;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_OnLicensedAudioSettingChanged;

// Function SrirachaRanch.StreamingRadioPlayerComponent.OnOwningVehicleDied
// 0x0038 (0x0038 - 0x0000)
struct StreamingRadioPlayerComponent_OnOwningVehicleDied final
{
public:
	class AFortAthenaVehicle*                     DeadVehicle;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  InTags;                                            // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AController*                            EventInstigator;                                   // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_OnOwningVehicleDied;

// Function SrirachaRanch.StreamingRadioPlayerComponent.OnPawnEnterSeat
// 0x0020 (0x0020 - 0x0000)
struct StreamingRadioPlayerComponent_OnPawnEnterSeat final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              PlayerPawn;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_OnPawnEnterSeat;

// Function SrirachaRanch.StreamingRadioPlayerComponent.OnPawnEnterVehicle
// 0x0020 (0x0020 - 0x0000)
struct StreamingRadioPlayerComponent_OnPawnEnterVehicle final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              PlayerPawn;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_OnPawnEnterVehicle;

// Function SrirachaRanch.StreamingRadioPlayerComponent.OnPawnExitSeat
// 0x0020 (0x0020 - 0x0000)
struct StreamingRadioPlayerComponent_OnPawnExitSeat final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              PlayerPawn;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_OnPawnExitSeat;

// Function SrirachaRanch.StreamingRadioPlayerComponent.OnPawnExitVehicle
// 0x0020 (0x0020 - 0x0000)
struct StreamingRadioPlayerComponent_OnPawnExitVehicle final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPawn*                              PlayerPawn;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_OnPawnExitVehicle;

// Function SrirachaRanch.StreamingRadioPlayerComponent.OnPiPPlayerBlockedChanged
// 0x0001 (0x0001 - 0x0000)
struct StreamingRadioPlayerComponent_OnPiPPlayerBlockedChanged final
{
public:
	bool                                          bPiPPlayerBlocking;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_OnPiPPlayerBlockedChanged;

// Function SrirachaRanch.StreamingRadioPlayerComponent.OnSuccessfulURL
// 0x0010 (0x0010 - 0x0000)
struct StreamingRadioPlayerComponent_OnSuccessfulURL final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_OnSuccessfulURL;

// Function SrirachaRanch.StreamingRadioPlayerComponent.ServerPlayIndex
// 0x0008 (0x0008 - 0x0000)
struct StreamingRadioPlayerComponent_ServerPlayIndex final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStreamingRadioSourceState                    InState;                                           // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_ServerPlayIndex;

// Function SrirachaRanch.StreamingRadioPlayerComponent.ServerSaveAutoStart
// 0x0001 (0x0001 - 0x0000)
struct StreamingRadioPlayerComponent_ServerSaveAutoStart final
{
public:
	bool                                          bInAutoStart;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_ServerSaveAutoStart;

// Function SrirachaRanch.StreamingRadioPlayerComponent.ServerSavedSource
// 0x0038 (0x0038 - 0x0000)
struct StreamingRadioPlayerComponent_ServerSavedSource final
{
public:
	struct FAthenaRadioStation                    InSource;                                          // 0x0000(0x0038)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_ServerSavedSource;

// Function SrirachaRanch.StreamingRadioPlayerComponent.ServerSaveFadeOutTime
// 0x0004 (0x0004 - 0x0000)
struct StreamingRadioPlayerComponent_ServerSaveFadeOutTime final
{
public:
	float                                         InFadeOutSeconds;                                  // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_ServerSaveFadeOutTime;

// Function SrirachaRanch.StreamingRadioPlayerComponent.ServerSetDisabledForCurrentPlayerState
// 0x0001 (0x0001 - 0x0000)
struct StreamingRadioPlayerComponent_ServerSetDisabledForCurrentPlayerState final
{
public:
	bool                                          bInDisableForCurrentPlayerState;                   // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_ServerSetDisabledForCurrentPlayerState;

// Function SrirachaRanch.StreamingRadioPlayerComponent.SetExteriorVolume
// 0x0010 (0x0010 - 0x0000)
struct StreamingRadioPlayerComponent_SetExteriorVolume final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_SetExteriorVolume;

// Function SrirachaRanch.StreamingRadioPlayerComponent.SetInteriorVolume
// 0x0010 (0x0010 - 0x0000)
struct StreamingRadioPlayerComponent_SetInteriorVolume final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_SetInteriorVolume;

// Function SrirachaRanch.StreamingRadioPlayerComponent.SoundMixUpdateTargetingState
// 0x0001 (0x0001 - 0x0000)
struct StreamingRadioPlayerComponent_SoundMixUpdateTargetingState final
{
public:
	bool                                          bNewIsTargeting;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_SoundMixUpdateTargetingState;

// Function SrirachaRanch.StreamingRadioPlayerComponent.SoundMixUpdateWeaponState
// 0x0010 (0x0010 - 0x0000)
struct StreamingRadioPlayerComponent_SoundMixUpdateWeaponState final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            PrevWeapon;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_SoundMixUpdateWeaponState;

// Function SrirachaRanch.StreamingRadioPlayerComponent.StartRadio
// 0x0008 (0x0008 - 0x0000)
struct StreamingRadioPlayerComponent_StartRadio final
{
public:
	int32                                         IdxToPlay;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFallbackOverride;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_StartRadio;

// Function SrirachaRanch.StreamingRadioPlayerComponent.StopIfNoDriver
// 0x0010 (0x0010 - 0x0000)
struct StreamingRadioPlayerComponent_StopIfNoDriver final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_StopIfNoDriver;

// Function SrirachaRanch.StreamingRadioPlayerComponent.StopRadioWithFadeout
// 0x0004 (0x0004 - 0x0000)
struct StreamingRadioPlayerComponent_StopRadioWithFadeout final
{
public:
	int32                                         Milliseconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_StopRadioWithFadeout;

// Function SrirachaRanch.StreamingRadioPlayerComponent.GetOptionAt
// 0x0040 (0x0040 - 0x0000)
struct StreamingRadioPlayerComponent_GetOptionAt final
{
public:
	int32                                         idx;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaRadioStation                    ReturnValue;                                       // 0x0008(0x0038)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_GetOptionAt;

// Function SrirachaRanch.StreamingRadioPlayerComponent.IsExternalSeat
// 0x0008 (0x0008 - 0x0000)
struct StreamingRadioPlayerComponent_IsExternalSeat final
{
public:
	int32                                         SeatIdx;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_IsExternalSeat;

// Function SrirachaRanch.StreamingRadioPlayerComponent.IsPlayingLiveFeed
// 0x0001 (0x0001 - 0x0000)
struct StreamingRadioPlayerComponent_IsPlayingLiveFeed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_IsPlayingLiveFeed;

}

