#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StandaloneBacchusItemShop

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function StandaloneBacchusItemShop.StandaloneBacchusItemShop_C.ExecuteUbergraph_StandaloneBacchusItemShop
// 0x00B0 (0x00B0 - 0x0000)
struct StandaloneBacchusItemShop_C_ExecuteUbergraph_StandaloneBacchusItemShop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStandaloneItemShopTabInfo             K2Node_MakeStruct_StandaloneItemShopTabInfo;       // 0x0008(0x0030)(ContainsInstancedReference)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShown;                               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_TabIndex;                             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStandaloneItemShopTabInfo             K2Node_MakeStruct_StandaloneItemShopTabInfo_1;     // 0x0050(0x0030)(ContainsInstancedReference)
	struct FStandaloneItemShopTabInfo             K2Node_MakeStruct_StandaloneItemShopTabInfo_2;     // 0x0080(0x0030)(ContainsInstancedReference)
};
DUMPER7_ASSERTS_StandaloneBacchusItemShop_C_ExecuteUbergraph_StandaloneBacchusItemShop;

// Function StandaloneBacchusItemShop.StandaloneBacchusItemShop_C.OnLoadingIndicatorShown
// 0x0001 (0x0001 - 0x0000)
struct StandaloneBacchusItemShop_C_OnLoadingIndicatorShown final
{
public:
	bool                                          bShown;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_StandaloneBacchusItemShop_C_OnLoadingIndicatorShown;

// Function StandaloneBacchusItemShop.StandaloneBacchusItemShop_C.OnTabSelected
// 0x0004 (0x0004 - 0x0000)
struct StandaloneBacchusItemShop_C_OnTabSelected final
{
public:
	int32                                         TabIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_StandaloneBacchusItemShop_C_OnTabSelected;

}

