#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SuperstormRuntime

#include "Basic.hpp"


namespace SDK::Params
{

// Function SuperstormRuntime.TempestLightningComponent.GetCloudHeight
// 0x0004 (0x0004 - 0x0000)
struct TempestLightningComponent_GetCloudHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TempestLightningComponent_GetCloudHeight;

// Function SuperstormRuntime.TempestLightningComponent.GetLightningRadius
// 0x0004 (0x0004 - 0x0000)
struct TempestLightningComponent_GetLightningRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TempestLightningComponent_GetLightningRadius;

// Function SuperstormRuntime.TempestTornadoForcesComponent.IsActorInTornado
// 0x0010 (0x0010 - 0x0000)
struct TempestTornadoForcesComponent_IsActorInTornado final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TempestTornadoForcesComponent_IsActorInTornado;

}

