#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tailgate

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class Tailgate.TailgateGameState
// 0x0000 (0x0270 - 0x0270)
class ATailgateGameState final : public AGameStateBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TailgateGameState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TailgateGameState")
	}
	static class ATailgateGameState* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATailgateGameState>();
	}
};
DUMPER7_ASSERTS_ATailgateGameState;

// Class Tailgate.TailgateMultiplierSystem
// 0x0000 (0x0028 - 0x0028)
class UTailgateMultiplierSystem final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TailgateMultiplierSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TailgateMultiplierSystem")
	}
	static class UTailgateMultiplierSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTailgateMultiplierSystem>();
	}
};
DUMPER7_ASSERTS_UTailgateMultiplierSystem;

// Class Tailgate.TailgateTargetBase
// 0x0008 (0x0228 - 0x0220)
class ATailgateTargetBase final : public AActor
{
public:
	struct FGameplayTag                           TargetType;                                        // 0x0220(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TailgateTargetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TailgateTargetBase")
	}
	static class ATailgateTargetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATailgateTargetBase>();
	}
};
DUMPER7_ASSERTS_ATailgateTargetBase;

// Class Tailgate.TailgateTargetDefinition
// 0x0000 (0x0028 - 0x0028)
class UTailgateTargetDefinition final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TailgateTargetDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TailgateTargetDefinition")
	}
	static class UTailgateTargetDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTailgateTargetDefinition>();
	}
};
DUMPER7_ASSERTS_UTailgateTargetDefinition;

// Class Tailgate.TailgateTargetSpawnCondition
// 0x0008 (0x0030 - 0x0028)
class UTailgateTargetSpawnCondition final : public UObject
{
public:
	struct FGameplayTag                           TargetType;                                        // 0x0028(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TailgateTargetSpawnCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TailgateTargetSpawnCondition")
	}
	static class UTailgateTargetSpawnCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTailgateTargetSpawnCondition>();
	}
};
DUMPER7_ASSERTS_UTailgateTargetSpawnCondition;

// Class Tailgate.TailgateTargetSpawnerDefinition
// 0x0020 (0x0048 - 0x0028)
class UTailgateTargetSpawnerDefinition final : public UObject
{
public:
	struct FGameplayTag                           SpawnerID;                                         // 0x0028(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UTailgateTargetSpawnCondition*>  SpawnConditions;                                   // 0x0030(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TSubclassOf<class UTailgateTargetDefinition>  TargetDefinitionOverride;                          // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TailgateTargetSpawnerDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TailgateTargetSpawnerDefinition")
	}
	static class UTailgateTargetSpawnerDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTailgateTargetSpawnerDefinition>();
	}
};
DUMPER7_ASSERTS_UTailgateTargetSpawnerDefinition;

// Class Tailgate.TailgateWaveDefinition
// 0x0028 (0x0050 - 0x0028)
class UTailgateWaveDefinition final : public UObject
{
public:
	TArray<TSubclassOf<class UTailgateTargetSpawnerDefinition>> TargetSpawnerDefinitionClasses;      // 0x0028(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UTailgateTargetSpawnerDefinition*> TargetSpawnerDefinitions;                        // 0x0038(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TSubclassOf<class UTailgateTargetDefinition>  DefaultTargetDefinition;                           // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TailgateWaveDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TailgateWaveDefinition")
	}
	static class UTailgateWaveDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTailgateWaveDefinition>();
	}
};
DUMPER7_ASSERTS_UTailgateWaveDefinition;

// Class Tailgate.TailgateWaveDirector
// 0x0030 (0x0250 - 0x0220)
class ATailgateWaveDirector final : public AActor
{
public:
	TArray<TSubclassOf<class UTailgateWaveDefinition>> WaveDefinitionClasses;                        // 0x0220(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UTailgateWaveDefinition*>        WaveDefinitions;                                   // 0x0230(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TSubclassOf<class UTailgateMultiplierSystem>  MultiplierSystemClass;                             // 0x0240(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTailgateMultiplierSystem*              MultiplierSystem;                                  // 0x0248(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TailgateWaveDirector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TailgateWaveDirector")
	}
	static class ATailgateWaveDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATailgateWaveDirector>();
	}
};
DUMPER7_ASSERTS_ATailgateWaveDirector;

}

