#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThrowingToyRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ThrowingToyRuntime.ThrowingToyTrackerComponent.AddThrowingToy
// 0x0018 (0x0018 - 0x0000)
struct ThrowingToyTrackerComponent_AddThrowingToy final
{
public:
	class AActor*                                 ThrowingToyActor;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  WorldItemGuid;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThrowingToyTrackerComponent_AddThrowingToy;

// Function ThrowingToyRuntime.ThrowingToyTrackerComponent.GetAndReleaseThrowingToy
// 0x0018 (0x0018 - 0x0000)
struct ThrowingToyTrackerComponent_GetAndReleaseThrowingToy final
{
public:
	struct FGuid                                  WorldItemGuid;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThrowingToyTrackerComponent_GetAndReleaseThrowingToy;

// Function ThrowingToyRuntime.ThrowingToyTrackerComponent.GetThrowingToy
// 0x0018 (0x0018 - 0x0000)
struct ThrowingToyTrackerComponent_GetThrowingToy final
{
public:
	struct FGuid                                  WorldItemGuid;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ThrowingToyTrackerComponent_GetThrowingToy;

}

