#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValetRuntime

#include "Basic.hpp"

#include "ValetRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ValetRuntime.DagwoodNetworkPhysicsComponent.SetPendingInputCmd
// 0x001C (0x001C - 0x0000)
struct DagwoodNetworkPhysicsComponent_SetPendingInputCmd final
{
public:
	struct FFortDagwoodCmd                        In;                                                // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DagwoodNetworkPhysicsComponent_SetPendingInputCmd;

// Function ValetRuntime.DagwoodNetworkPhysicsComponent.SetState_GT
// 0x0230 (0x0230 - 0x0000)
struct DagwoodNetworkPhysicsComponent_SetState_GT final
{
public:
	struct FDagwoodInPersistent                   In;                                                // 0x0000(0x0230)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DagwoodNetworkPhysicsComponent_SetState_GT;

// Function ValetRuntime.DagwoodNetworkPhysicsComponent.GetPendingInputCmd
// 0x001C (0x001C - 0x0000)
struct DagwoodNetworkPhysicsComponent_GetPendingInputCmd final
{
public:
	struct FFortDagwoodCmd                        ReturnValue;                                       // 0x0000(0x001C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DagwoodNetworkPhysicsComponent_GetPendingInputCmd;

// Function ValetRuntime.DagwoodNetworkPhysicsComponent.GetState_GT
// 0x0230 (0x0230 - 0x0000)
struct DagwoodNetworkPhysicsComponent_GetState_GT final
{
public:
	struct FDagwoodInPersistent                   ReturnValue;                                       // 0x0000(0x0230)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DagwoodNetworkPhysicsComponent_GetState_GT;

// Function ValetRuntime.DagwoodNetworkPhysicsComponent.GetState_PT
// 0x0158 (0x0158 - 0x0000)
struct DagwoodNetworkPhysicsComponent_GetState_PT final
{
public:
	struct FDagwoodState_PT                       ReturnValue;                                       // 0x0000(0x0158)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DagwoodNetworkPhysicsComponent_GetState_PT;

// Function ValetRuntime.FortAthenaMutator_OverrideValetVehicleParameters.OnPlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaMutator_OverrideValetVehicleParameters_OnPlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContainerTags;                             // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_OverrideValetVehicleParameters_OnPlaylistLoaded;

// Function ValetRuntime.FortContextualTutorial_VehicleValetLowFuel.HandleVehicleStateChanged
// 0x0018 (0x0018 - 0x0000)
struct FortContextualTutorial_VehicleValetLowFuel_HandleVehicleStateChanged final
{
public:
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 NewVehicle;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OldVehicle;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortContextualTutorial_VehicleValetLowFuel_HandleVehicleStateChanged;

// Function ValetRuntime.FortDagwoodVehicle.GetCurrentDagwoodRuntimeProperties
// 0x0088 (0x0088 - 0x0000)
struct FortDagwoodVehicle_GetCurrentDagwoodRuntimeProperties final
{
public:
	struct FDagwoodRuntimeModifiers               ReturnValue;                                       // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetCurrentDagwoodRuntimeProperties;

// Function ValetRuntime.FortDagwoodVehicle.HandleCurrentPlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct FortDagwoodVehicle_HandleCurrentPlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_HandleCurrentPlaylistLoaded;

// Function ValetRuntime.FortDagwoodVehicle.MakeOperable
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_MakeOperable final
{
public:
	bool                                          bAddGas;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_MakeOperable;

// Function ValetRuntime.FortDagwoodVehicle.NativeOnFuelChanged
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_NativeOnFuelChanged final
{
public:
	float                                         NewFuelPercent;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OldFuelPercent;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_NativeOnFuelChanged;

// Function ValetRuntime.FortDagwoodVehicle.OnClientBeginAltInteract
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_OnClientBeginAltInteract final
{
public:
	class AFortPawn*                              Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnClientBeginAltInteract;

// Function ValetRuntime.FortDagwoodVehicle.OnDestroyedPropFromCollision
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_OnDestroyedPropFromCollision final
{
public:
	const class ABuildingActor*                   BuildingHitActor;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnDestroyedPropFromCollision;

// Function ValetRuntime.FortDagwoodVehicle.OnGainedFuel
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_OnGainedFuel final
{
public:
	float                                         NewPercent;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnGainedFuel;

// Function ValetRuntime.FortDagwoodVehicle.OnHoldSelfDestructStarted
// 0x0010 (0x0010 - 0x0000)
struct FortDagwoodVehicle_OnHoldSelfDestructStarted final
{
public:
	class AFortPawn*                              DriverPawn;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExitDuration;                                      // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnHoldSelfDestructStarted;

// Function ValetRuntime.FortDagwoodVehicle.OnHoldSelfDestructStopped
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_OnHoldSelfDestructStopped final
{
public:
	class AFortPawn*                              DriverPawn;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnHoldSelfDestructStopped;

// Function ValetRuntime.FortDagwoodVehicle.OnInoperableChanged
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_OnInoperableChanged final
{
public:
	bool                                          bInoperable;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnInoperableChanged;

// Function ValetRuntime.FortDagwoodVehicle.OnPoppedTire
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_OnPoppedTire final
{
public:
	int32                                         TireIndex;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFakeTire;                                         // 0x0004(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnPoppedTire;

// Function ValetRuntime.FortDagwoodVehicle.OnRep_DagwoodRuntimeModifiers
// 0x0088 (0x0088 - 0x0000)
struct FortDagwoodVehicle_OnRep_DagwoodRuntimeModifiers final
{
public:
	struct FDagwoodRuntimeModifiers               PrevMods;                                          // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnRep_DagwoodRuntimeModifiers;

// Function ValetRuntime.FortDagwoodVehicle.OnRep_FakeTires
// 0x0010 (0x0010 - 0x0000)
struct FortDagwoodVehicle_OnRep_FakeTires final
{
public:
	TArray<ETireStates>                           PrevTireStates;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnRep_FakeTires;

// Function ValetRuntime.FortDagwoodVehicle.OnRep_Tires
// 0x0010 (0x0010 - 0x0000)
struct FortDagwoodVehicle_OnRep_Tires final
{
public:
	TArray<ETireStates>                           PrevTireStates;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnRep_Tires;

// Function ValetRuntime.FortDagwoodVehicle.OnRimScrapeDamage
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_OnRimScrapeDamage final
{
public:
	int32                                         TireIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnRimScrapeDamage;

// Function ValetRuntime.FortDagwoodVehicle.OnServerAltInteract
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_OnServerAltInteract final
{
public:
	class AFortPawn*                              Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnServerAltInteract;

// Function ValetRuntime.FortDagwoodVehicle.OnTickAudioController
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_OnTickAudioController final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnTickAudioController;

// Function ValetRuntime.FortDagwoodVehicle.OnTickAudioFade
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_OnTickAudioFade final
{
public:
	float                                         FadeParam;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnTickAudioFade;

// Function ValetRuntime.FortDagwoodVehicle.ServerAddRuntimeGearsInfo
// 0x0010 (0x0010 - 0x0000)
struct FortDagwoodVehicle_ServerAddRuntimeGearsInfo final
{
public:
	struct FRuntimeGearInfo                       GearInfo;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_ServerAddRuntimeGearsInfo;

// Function ValetRuntime.FortDagwoodVehicle.ServerSetDestructionInfo
// 0x0010 (0x0010 - 0x0000)
struct FortDagwoodVehicle_ServerSetDestructionInfo final
{
public:
	float                                         SelfDestructTime;                                  // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTimeZeroHealth;                                 // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTimeSelfDestructCleanup;                        // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTimeExplosion;                                  // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_ServerSetDestructionInfo;

// Function ValetRuntime.FortDagwoodVehicle.ServerSetFadeDuration
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_ServerSetFadeDuration final
{
public:
	float                                         NewFadeDuration;                                   // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_ServerSetFadeDuration;

// Function ValetRuntime.FortDagwoodVehicle.ServerSetRuntimeBoostInfo
// 0x0018 (0x0018 - 0x0000)
struct FortDagwoodVehicle_ServerSetRuntimeBoostInfo final
{
public:
	struct FRuntimeBoostInfo                      BoostInfo;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_ServerSetRuntimeBoostInfo;

// Function ValetRuntime.FortDagwoodVehicle.ServerSetRuntimeDriveInfo
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_ServerSetRuntimeDriveInfo final
{
public:
	float                                         MaxIncline;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTilt;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_ServerSetRuntimeDriveInfo;

// Function ValetRuntime.FortDagwoodVehicle.ServerSetRuntimeFuelInfo
// 0x000C (0x000C - 0x0000)
struct FortDagwoodVehicle_ServerSetRuntimeFuelInfo final
{
public:
	struct FRuntimeFuelInfo                       FuelInfo;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_ServerSetRuntimeFuelInfo;

// Function ValetRuntime.FortDagwoodVehicle.ServerSetRuntimeGravity
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_ServerSetRuntimeGravity final
{
public:
	float                                         GravMult;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_ServerSetRuntimeGravity;

// Function ValetRuntime.FortDagwoodVehicle.ServerSetRuntimeSpringsInfo
// 0x0020 (0x0020 - 0x0000)
struct FortDagwoodVehicle_ServerSetRuntimeSpringsInfo final
{
public:
	struct FRuntimeSpringsInfo                    SpringsInfo;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_ServerSetRuntimeSpringsInfo;

// Function ValetRuntime.FortDagwoodVehicle.SetDamageInfoOnServer
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_SetDamageInfoOnServer final
{
public:
	bool                                          bInDamageFriendlyVehicles;                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInDamageOtherVehicles;                            // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInDamageOwnVehicle;                               // 0x0002(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInDamageAllowedFromOtherVehicle;                  // 0x0003(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_SetDamageInfoOnServer;

// Function ValetRuntime.FortDagwoodVehicle.SetFuel
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_SetFuel final
{
public:
	float                                         NewFuel;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_SetFuel;

// Function ValetRuntime.FortDagwoodVehicle.SetOnFire
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_SetOnFire final
{
public:
	bool                                          bNewFire;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_SetOnFire;

// Function ValetRuntime.FortDagwoodVehicle.SetValetAudioController
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_SetValetAudioController final
{
public:
	class AFortValetAudioController*              ValetAudio_0;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_SetValetAudioController;

// Function ValetRuntime.FortDagwoodVehicle.ForwardOrReverseInputPressed
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_ForwardOrReverseInputPressed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_ForwardOrReverseInputPressed;

// Function ValetRuntime.FortDagwoodVehicle.GetBumpiness
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_GetBumpiness final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetBumpiness;

// Function ValetRuntime.FortDagwoodVehicle.GetExplosionDelay
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_GetExplosionDelay final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetExplosionDelay;

// Function ValetRuntime.FortDagwoodVehicle.GetFuel
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_GetFuel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetFuel;

// Function ValetRuntime.FortDagwoodVehicle.GetFuelCapacity
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_GetFuelCapacity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetFuelCapacity;

// Function ValetRuntime.FortDagwoodVehicle.GetMaxZeroHealthTime
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_GetMaxZeroHealthTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetMaxZeroHealthTime;

// Function ValetRuntime.FortDagwoodVehicle.GetMiddleAxleForwardAdjust
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_GetMiddleAxleForwardAdjust final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetMiddleAxleForwardAdjust;

// Function ValetRuntime.FortDagwoodVehicle.GetOnFire
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_GetOnFire final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetOnFire;

// Function ValetRuntime.FortDagwoodVehicle.GetSelfDestructCleanupDelay
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_GetSelfDestructCleanupDelay final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetSelfDestructCleanupDelay;

// Function ValetRuntime.FortDagwoodVehicle.GetSelfDestructDelay
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_GetSelfDestructDelay final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetSelfDestructDelay;

// Function ValetRuntime.FortDagwoodVehicle.GetTireHealthPercent
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_GetTireHealthPercent final
{
public:
	ETireLocations                                TireIndex;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetTireHealthPercent;

// Function ValetRuntime.FortDagwoodVehicle.GetTireState
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_GetTireState final
{
public:
	int32                                         TireIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetTireState;

// Function ValetRuntime.FortDagwoodVehicle.GetTireSurface
// 0x0002 (0x0002 - 0x0000)
struct FortDagwoodVehicle_GetTireSurface final
{
public:
	ETireLocations                                TireIndex;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETireSurfaces                                 ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetTireSurface;

// Function ValetRuntime.FortDagwoodVehicle.IsNativeBPTickEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_IsNativeBPTickEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_IsNativeBPTickEnabled;

// Function ValetRuntime.FortDagwoodVehicle.IsOffroad
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_IsOffroad final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_IsOffroad;

// Function ValetRuntime.FortDagwoodVehicle.IsOnDirt
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_IsOnDirt final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_IsOnDirt;

// Function ValetRuntime.FortDagwoodVehicle.IsOnLandscape
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_IsOnLandscape final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_IsOnLandscape;

// Function ValetRuntime.FortDagwoodVehicle.IsOnRoad
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_IsOnRoad final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_IsOnRoad;

// Function ValetRuntime.FortDagwoodVehicle.IsTireSkidding
// 0x0014 (0x0014 - 0x0000)
struct FortDagwoodVehicle_IsTireSkidding final
{
public:
	float                                         MinSpeedForSkid;                                   // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleForSkid;                                      // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedForPeelout;                                   // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedForBraking;                                   // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortDagwoodVehicle_IsTireSkidding;

// Function ValetRuntime.FortDagwoodVehicle.IsVehicleAcceleratingWithSpeedThreshold
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_IsVehicleAcceleratingWithSpeedThreshold final
{
public:
	float                                         SpeedThreshold;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortDagwoodVehicle_IsVehicleAcceleratingWithSpeedThreshold;

// Function ValetRuntime.FortDagwoodVehicle.NativeCalculateAccelRumbleIntensity
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_NativeCalculateAccelRumbleIntensity final
{
public:
	float                                         MaxIntensity;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_NativeCalculateAccelRumbleIntensity;

// Function ValetRuntime.FortDagwoodVehicleManager.CustomHandleActorStreamedInEditor
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicleManager_CustomHandleActorStreamedInEditor final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicleManager_CustomHandleActorStreamedInEditor;

// Function ValetRuntime.FortDagwoodVehicleManager.OnVehicleSpawned
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicleManager_OnVehicleSpawned final
{
public:
	class AFortAthenaVehicle*                     Vehicle;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicleManager_OnVehicleSpawned;

// Function ValetRuntime.FortDagwoodVehicleManager.OnVehicleSpawnsUpdated
// 0x0020 (0x0020 - 0x0000)
struct FortDagwoodVehicleManager_OnVehicleSpawnsUpdated final
{
public:
	class UFortVehicleItemDefinition*             VehicleItemDef;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         SpawnedVehicles;                                   // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NewVehicleCount;                                   // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortDagwoodVehicleManager_OnVehicleSpawnsUpdated;

// Function ValetRuntime.FortValetAudioController.CacheValetVehicle
// 0x0008 (0x0008 - 0x0000)
struct FortValetAudioController_CacheValetVehicle final
{
public:
	class AFortDagwoodVehicle*                    InVehicle;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortValetAudioController_CacheValetVehicle;

// Function ValetRuntime.FortValetAudioController.OnSuspensionCollision_Native
// 0x0008 (0x0008 - 0x0000)
struct FortValetAudioController_OnSuspensionCollision_Native final
{
public:
	bool                                          OutResult;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OutMagnitude;                                      // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortValetAudioController_OnSuspensionCollision_Native;

// Function ValetRuntime.FortValetAudioController.OnTireModApplied
// 0x01A8 (0x01A8 - 0x0000)
struct FortValetAudioController_OnTireModApplied final
{
public:
	struct FTireInfo                              AppliedTireMod;                                    // 0x0000(0x01A8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortValetAudioController_OnTireModApplied;

}

