#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VictoryCrownsUI

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function VictoryCrownsUI.FortUIManagerComponent_VictoryCrowns.HandleGamePhaseStepChanged
// 0x0018 (0x0018 - 0x0000)
struct FortUIManagerComponent_VictoryCrowns_HandleGamePhaseStepChanged final
{
public:
	TScriptInterface<class IFortSafeZoneInterface> SafeZoneInterface;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAthenaGamePhaseStep                          GamePhaseStep;                                     // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortUIManagerComponent_VictoryCrowns_HandleGamePhaseStepChanged;

// Function VictoryCrownsUI.FortUIManagerComponent_VictoryCrowns.RebuildBearerIndicators
// 0x0010 (0x0010 - 0x0000)
struct FortUIManagerComponent_VictoryCrowns_RebuildBearerIndicators final
{
public:
	TArray<class AFortPlayerStateAthena*>         CrownBearerList;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIManagerComponent_VictoryCrowns_RebuildBearerIndicators;

// Function VictoryCrownsUI.VictoryCrownsBearerInfoBase.OnSetPlayerState
// 0x0008 (0x0008 - 0x0000)
struct VictoryCrownsBearerInfoBase_OnSetPlayerState final
{
public:
	class AFortPlayerStateAthena*                 PSA;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VictoryCrownsBearerInfoBase_OnSetPlayerState;

// Function VictoryCrownsUI.VictoryCrownsBearerInfoBase.SetPlayerState
// 0x0008 (0x0008 - 0x0000)
struct VictoryCrownsBearerInfoBase_SetPlayerState final
{
public:
	class AFortPlayerStateAthena*                 InPlayerState;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VictoryCrownsBearerInfoBase_SetPlayerState;

// Function VictoryCrownsUI.VictoryCrownsIndicator.OnDistanceChanged
// 0x0004 (0x0004 - 0x0000)
struct VictoryCrownsIndicator_OnDistanceChanged final
{
public:
	int32                                         Distance;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VictoryCrownsIndicator_OnDistanceChanged;

// Function VictoryCrownsUI.VictoryCrownsIndicator.OnScreenClampChanged
// 0x0001 (0x0001 - 0x0000)
struct VictoryCrownsIndicator_OnScreenClampChanged final
{
public:
	bool                                          bIsClamped;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VictoryCrownsIndicator_OnScreenClampChanged;

// Function VictoryCrownsUI.VictoryCrownsIndicator.OnTargetActorChanged
// 0x0008 (0x0008 - 0x0000)
struct VictoryCrownsIndicator_OnTargetActorChanged final
{
public:
	class AActor*                                 TargetedActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VictoryCrownsIndicator_OnTargetActorChanged;

// Function VictoryCrownsUI.VictoryCrownsIndicator.GetIndicatedPlayerStateAthena
// 0x0008 (0x0008 - 0x0000)
struct VictoryCrownsIndicator_GetIndicatedPlayerStateAthena final
{
public:
	const class AFortPlayerStateAthena*           ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VictoryCrownsIndicator_GetIndicatedPlayerStateAthena;

// Function VictoryCrownsUI.VictoryCrownsPlayerInfoWidget.HandleCrownBearerListChanged
// 0x0010 (0x0010 - 0x0000)
struct VictoryCrownsPlayerInfoWidget_HandleCrownBearerListChanged final
{
public:
	TArray<class AFortPlayerStateAthena*>         CrownBearerList;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VictoryCrownsPlayerInfoWidget_HandleCrownBearerListChanged;

// Function VictoryCrownsUI.VictoryCrownsPlayerInfoWidget.OnPlayerVictoryCrownStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct VictoryCrownsPlayerInfoWidget_OnPlayerVictoryCrownStatusChanged final
{
public:
	bool                                          bHasCrown;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VictoryCrownsPlayerInfoWidget_OnPlayerVictoryCrownStatusChanged;

// Function VictoryCrownsUI.VictoryCrownsPreGameWidget.HandleGamePhaseStepChanged
// 0x0018 (0x0018 - 0x0000)
struct VictoryCrownsPreGameWidget_HandleGamePhaseStepChanged final
{
public:
	TScriptInterface<class IFortSafeZoneInterface> SafeZoneInterface;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAthenaGamePhaseStep                          GamePhaseStep;                                     // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VictoryCrownsPreGameWidget_HandleGamePhaseStepChanged;

// Function VictoryCrownsUI.VictoryCrownsPreGameWidget.OnButtonCloseProgress
// 0x0004 (0x0004 - 0x0000)
struct VictoryCrownsPreGameWidget_OnButtonCloseProgress final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VictoryCrownsPreGameWidget_OnButtonCloseProgress;

// Function VictoryCrownsUI.VictoryCrownsPreGameWidget.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct VictoryCrownsPreGameWidget_OnInputMethodChanged final
{
public:
	ECommonInputType                              CurrentInput;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VictoryCrownsPreGameWidget_OnInputMethodChanged;

// Function VictoryCrownsUI.VictoryCrownsPreGameWidget.RebuildBearerList
// 0x0010 (0x0010 - 0x0000)
struct VictoryCrownsPreGameWidget_RebuildBearerList final
{
public:
	TArray<class AFortPlayerStateAthena*>         CrownBearerList;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VictoryCrownsPreGameWidget_RebuildBearerList;

}

