#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VkEngineTypes

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "JsonUtilities_structs.hpp"


namespace SDK
{

// Enum VkEngineTypes.EConsumerRole
// NumValues: 0x0003
enum class EConsumerRole : uint8
{
	Server                                   = 0,
	Client                                   = 1,
	EConsumerRole_MAX                        = 2,
};

// Enum VkEngineTypes.EVkLinkPublishMode
// NumValues: 0x0003
enum class EVkLinkPublishMode : uint8
{
	Live                                     = 0,
	Playtest                                 = 1,
	EVkLinkPublishMode_MAX                   = 2,
};

// Enum VkEngineTypes.EVkModuleAccess
// NumValues: 0x0004
enum class EVkModuleAccess : uint8
{
	Private                                  = 0,
	Protected                                = 1,
	Public                                   = 2,
	EVkModuleAccess_MAX                      = 3,
};

// Enum VkEngineTypes.EVkOwnerType
// NumValues: 0x0003
enum class EVkOwnerType : uint8
{
	Account                                  = 0,
	Team                                     = 1,
	EVkOwnerType_MAX                         = 2,
};

// Enum VkEngineTypes.EVkValidationFlags
// NumValues: 0x0007
enum class EVkValidationFlags : uint8
{
	None                                     = 0,
	VF_IgnoreValidation                      = 1,
	VF_AllowMissingGameFeatureDataAsset      = 2,
	VF_AllowEngineContent                    = 4,
	VF_AllowGameContent                      = 8,
	VF_NoPreCheckVerse                       = 16,
	EVkValidationFlags_MAX                   = 17,
};

// ScriptStruct VkEngineTypes.VkNamedId
// 0x0020 (0x0020 - 0x0000)
struct FVkNamedId final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ID;                                                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkNamedId;

// ScriptStruct VkEngineTypes.VkContentFilter
// 0x0010 (0x0010 - 0x0000)
struct FVkContentFilter final
{
public:
	class FString                                 Platform;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkContentFilter;

// ScriptStruct VkEngineTypes.VkArtifactOption
// 0x0028 (0x0028 - 0x0000)
struct FVkArtifactOption final
{
public:
	class FString                                 ArtifactId;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EConsumerRole                                 Role;                                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVkContentFilter                       Filter;                                            // 0x0018(0x0010)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkArtifactOption;

// ScriptStruct VkEngineTypes.VkModuleVersionRef
// 0x0020 (0x0020 - 0x0000)
struct FVkModuleVersionRef final
{
public:
	class FString                                 ModuleId;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Version;                                           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkModuleVersionRef;

// ScriptStruct VkEngineTypes.VkModuleVersion
// 0x0018 (0x0018 - 0x0000)
struct FVkModuleVersion
{
public:
	class FString                                 ModuleId;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Version;                                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FVkModuleVersion;

// ScriptStruct VkEngineTypes.VkModuleVersionWithArtifacts
// 0x0010 (0x0028 - 0x0018)
struct FVkModuleVersionWithArtifacts final : public FVkModuleVersion
{
public:
	TArray<struct FVkArtifactOption>              Artifacts;                                         // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkModuleVersionWithArtifacts;

// ScriptStruct VkEngineTypes.VkModuleDoc
// 0x0148 (0x0148 - 0x0000)
struct FVkModuleDoc final
{
public:
	class FString                                 ModuleId;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              Created;                                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              Updated;                                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVkNamedId                             Author;                                            // 0x0020(0x0020)(NativeAccessSpecifierPublic)
	class FString                                 ProjectID;                                         // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ModuleName;                                        // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContentType;                                       // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EConsumerRole, bool>                     Relevance;                                         // 0x0070(0x0050)(NativeAccessSpecifierPublic)
	class FString                                 AliasForModuleId;                                  // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJsonObjectWrapper                     Meta;                                              // 0x00D0(0x0020)(NativeAccessSpecifierPublic)
	TMap<class FString, int32>                    Labels;                                            // 0x00F0(0x0050)(NativeAccessSpecifierPublic)
	int32                                         LatestVersion;                                     // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FVkModuleDoc;

// ScriptStruct VkEngineTypes.VkContentPackage
// 0x0070 (0x0070 - 0x0000)
struct FVkContentPackage final
{
public:
	class FString                                 ProjectID;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            ProjectFlags;                                      // 0x0010(0x0050)(NativeAccessSpecifierPublic)
	TArray<struct FVkModuleVersionWithArtifacts>  Content;                                           // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkContentPackage;

// ScriptStruct VkEngineTypes.VkModuleBinaries
// 0x0050 (0x0050 - 0x0000)
struct FVkModuleBinaries final
{
public:
	class FString                                 BaseUrl;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Manifest;                                          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Files;                                             // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	double                                        TotalSizeKb;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ManifestSizeKb;                                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ManifestDiskSizeKb;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ManifestDownloadSizeKb;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkModuleBinaries;

// ScriptStruct VkEngineTypes.VkResolvedModule
// 0x0060 (0x0060 - 0x0000)
struct FVkResolvedModule final
{
public:
	class FString                                 ModuleId;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVkModuleBinaries                      Binaries;                                          // 0x0010(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkResolvedModule;

// ScriptStruct VkEngineTypes.VkContentManifest
// 0x0010 (0x0010 - 0x0000)
struct FVkContentManifest final
{
public:
	TArray<struct FVkResolvedModule>              Content;                                           // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkContentManifest;

// ScriptStruct VkEngineTypes.VkBuildVersion
// 0x0018 (0x0018 - 0x0000)
struct FVkBuildVersion final
{
public:
	class FString                                 Major;                                             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Minor;                                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Patch;                                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkBuildVersion;

// ScriptStruct VkEngineTypes.VkJobOutput
// 0x0038 (0x0038 - 0x0000)
struct FVkJobOutput final
{
public:
	class FString                                 BaseUrl;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalSizeKb;                                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Files;                                             // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 Manifest;                                          // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkJobOutput;

// ScriptStruct VkEngineTypes.VkModuleVersionDoc
// 0x0168 (0x0168 - 0x0000)
struct FVkModuleVersionDoc final
{
public:
	class FString                                 ModuleId;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Version;                                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ProjectID;                                         // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVkModuleAccess                               Access;                                            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              Created;                                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVkNamedId                             Author;                                            // 0x0038(0x0020)(NativeAccessSpecifierPublic)
	struct FJsonObjectWrapper                     Meta;                                              // 0x0058(0x0020)(NativeAccessSpecifierPublic)
	TArray<struct FVkModuleVersionRef>            Dependencies;                                      // 0x0078(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVkJobOutput                           StagedFiles;                                       // 0x0088(0x0038)(NativeAccessSpecifierPublic)
	struct FVkBuildVersion                        SourceVersion;                                     // 0x00C0(0x0018)(NativeAccessSpecifierPublic)
	class FString                                 ContentType;                                       // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EConsumerRole, bool>                     Relevance;                                         // 0x00E8(0x0050)(NativeAccessSpecifierPublic)
	class FString                                 ArtifactKey;                                       // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Checksum;                                          // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVkArtifactOption>              Artifacts;                                         // 0x0158(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkModuleVersionDoc;

// ScriptStruct VkEngineTypes.VkPublishedLink
// 0x0048 (0x0048 - 0x0000)
struct FVkPublishedLink final
{
public:
	class FString                                 LinkCode;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LinkVersion;                                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              LastPublished;                                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RootModuleId;                                      // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ModuleVersion;                                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MatchmakingScheme;                                 // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkPublishedLink;

// ScriptStruct VkEngineTypes.VkProjectDoc
// 0x00C8 (0x00C8 - 0x0000)
struct FVkProjectDoc final
{
public:
	class FString                                 ProjectID;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              Created;                                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVkNamedId                             Author;                                            // 0x0018(0x0020)(NativeAccessSpecifierPublic)
	EVkOwnerType                                  OwnerType;                                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVkNamedId                             Owner;                                             // 0x0040(0x0020)(NativeAccessSpecifierPublic)
	struct FJsonObjectWrapper                     Meta;                                              // 0x0060(0x0020)(NativeAccessSpecifierPublic)
	struct FVkPublishedLink                       LiveLink;                                          // 0x0080(0x0048)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkProjectDoc;

// ScriptStruct VkEngineTypes.VkProjectUserInfo
// 0x00D0 (0x00D0 - 0x0000)
struct FVkProjectUserInfo final
{
public:
	class FString                                 ProjectID;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AccountId;                                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Title;                                             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasStar;                                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, bool>                     Access;                                            // 0x0038(0x0050)(NativeAccessSpecifierPublic)
	struct FVkPublishedLink                       PlaytestLink;                                      // 0x0088(0x0048)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkProjectUserInfo;

// ScriptStruct VkEngineTypes.VkCreateProjectRequest
// 0x0030 (0x0030 - 0x0000)
struct FVkCreateProjectRequest final
{
public:
	class FString                                 DesiredProjectId;                                  // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJsonObjectWrapper                     Meta;                                              // 0x0010(0x0020)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkCreateProjectRequest;

// ScriptStruct VkEngineTypes.VkCreateModuleRequest
// 0x00A0 (0x00A0 - 0x0000)
struct FVkCreateModuleRequest final
{
public:
	class FString                                 ModuleName;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJsonObjectWrapper                     Meta;                                              // 0x0010(0x0020)(NativeAccessSpecifierPublic)
	class FString                                 ContentType;                                       // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EConsumerRole, bool>                     Relevance;                                         // 0x0040(0x0050)(NativeAccessSpecifierPublic)
	class FString                                 DesiredModuleId;                                   // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkCreateModuleRequest;

// ScriptStruct VkEngineTypes.VkCreateModuleVersionRequest
// 0x0090 (0x0090 - 0x0000)
struct FVkCreateModuleVersionRequest final
{
public:
	TMap<class FString, class FString>            RawFiles;                                          // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	TArray<struct FVkModuleVersionRef>            Dependencies;                                      // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FJsonObjectWrapper                     Meta;                                              // 0x0060(0x0020)(NativeAccessSpecifierPublic)
	class FString                                 Checksum;                                          // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkCreateModuleVersionRequest;

// ScriptStruct VkEngineTypes.VkResolvedContent
// 0x0070 (0x0070 - 0x0000)
struct FVkResolvedContent
{
public:
	struct FVkModuleVersionRef                    Root;                                              // 0x0000(0x0020)(NativeAccessSpecifierPublic)
	TMap<class FString, int32>                    Resolutions;                                       // 0x0020(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkResolvedContent;

// ScriptStruct VkEngineTypes.VkVersionedLinkCode
// 0x0018 (0x0018 - 0x0000)
struct FVkVersionedLinkCode final
{
public:
	class FString                                 Mnemonic;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Version;                                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FVkVersionedLinkCode;

// ScriptStruct VkEngineTypes.VkSnapshotSaveRequest
// 0x0090 (0x0090 - 0x0000)
struct FVkSnapshotSaveRequest final
{
public:
	struct FVkResolvedContent                     Content;                                           // 0x0000(0x0070)(NativeAccessSpecifierPublic)
	TArray<struct FVkVersionedLinkCode>           Palette;                                           // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 MapPath;                                           // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkSnapshotSaveRequest;

// ScriptStruct VkEngineTypes.VkProjectSnapshot
// 0x00D0 (0x00D0 - 0x0000)
struct FVkProjectSnapshot final
{
public:
	class FString                                 UniqueId;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProjectID;                                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AccountId;                                         // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              CreatedAt;                                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DeltaFileIndex;                                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVkResolvedContent                     Content;                                           // 0x0040(0x0070)(NativeAccessSpecifierPublic)
	TArray<struct FVkVersionedLinkCode>           Palette;                                           // 0x00B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 MapPath;                                           // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkProjectSnapshot;

// ScriptStruct VkEngineTypes.VkPublishRequest
// 0x0030 (0x00A0 - 0x0070)
struct FVkPublishRequest final : public FVkResolvedContent
{
public:
	class FString                                 MatchmakingScheme;                                 // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJsonObjectWrapper                     Meta;                                              // 0x0080(0x0020)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkPublishRequest;

// ScriptStruct VkEngineTypes.VkProjectSearchResult
// 0x0050 (0x0050 - 0x0000)
struct FVkProjectSearchResult final
{
public:
	class FString                                 ProjectID;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              Created;                                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              Updated;                                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJsonObjectWrapper                     Meta;                                              // 0x0020(0x0020)(NativeAccessSpecifierPublic)
	class FString                                 LinkCode;                                          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkProjectSearchResult;

// ScriptStruct VkEngineTypes.VkLaunchData_LaunchLinkCode
// 0x0018 (0x0018 - 0x0000)
struct FVkLaunchData_LaunchLinkCode final
{
public:
	class FString                                 LinkCode;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Version;                                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FVkLaunchData_LaunchLinkCode;

// ScriptStruct VkEngineTypes.VkLaunchData_JoinMatchmakingSession
// 0x0010 (0x0010 - 0x0000)
struct FVkLaunchData_JoinMatchmakingSession final
{
public:
	class FString                                 SessionId;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkLaunchData_JoinMatchmakingSession;

// ScriptStruct VkEngineTypes.VkProjectPlaytestAccessRequest
// 0x0010 (0x0010 - 0x0000)
struct FVkProjectPlaytestAccessRequest final
{
public:
	TArray<class FString>                         Users;                                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkProjectPlaytestAccessRequest;

// ScriptStruct VkEngineTypes.VkProjectAccessControl
// 0x0005 (0x0005 - 0x0000)
struct FVkProjectAccessControl final
{
public:
	bool                                          Read;                                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Edit;                                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Operate;                                           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Publish;                                           // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Admin;                                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkProjectAccessControl;

// ScriptStruct VkEngineTypes.VkProjectPlaytestAccessResult
// 0x0080 (0x0080 - 0x0000)
struct FVkProjectPlaytestAccessResult final
{
public:
	struct FVkNamedId                             Owner;                                             // 0x0000(0x0020)(NativeAccessSpecifierPublic)
	class FString                                 OwnerType;                                         // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, struct FVkProjectAccessControl> Playtesters;                                 // 0x0030(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVkProjectPlaytestAccessResult;

// ScriptStruct VkEngineTypes.VkMetaDataFlags
// 0x0050 (0x0050 - 0x0000)
struct FVkMetaDataFlags final
{
public:
	TMap<class FString, class FString>            _validation_flags;                                 // 0x0000(0x0050)(NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FVkMetaDataFlags;

}

