#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WidgetCarousel

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK
{

// ScriptStruct WidgetCarousel.WidgetCarouselNavigationButtonStyle
// 0x04D8 (0x04E0 - 0x0008)
struct FWidgetCarouselNavigationButtonStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           InnerButtonStyle;                                  // 0x0010(0x0370)(NativeAccessSpecifierPublic)
	struct FSlateBrush                            NavigationButtonLeftImage;                         // 0x0380(0x00B0)(NativeAccessSpecifierPublic)
	struct FSlateBrush                            NavigationButtonRightImage;                        // 0x0430(0x00B0)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWidgetCarouselNavigationButtonStyle;

// ScriptStruct WidgetCarousel.WidgetCarouselNavigationBarStyle
// 0x0B08 (0x0B10 - 0x0008)
struct FWidgetCarouselNavigationBarStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            HighlightBrush;                                    // 0x0010(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FButtonStyle                           LeftButtonStyle;                                   // 0x00C0(0x0370)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FButtonStyle                           CenterButtonStyle;                                 // 0x0430(0x0370)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FButtonStyle                           RightButtonStyle;                                  // 0x07A0(0x0370)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWidgetCarouselNavigationBarStyle;

}

